{"class_name": "Sequential",
  "keras_version": "2.0.2",
  "backend": "tensorflow",
  "config": [{"class_name": "LSTM",
    "config": {"go_backwards": false, "return_sequences": true,
                "kernel_regularizer": null, "implementation": 0,
                "activation": "tanh", "unroll": false,
                "recurrent_constraint": null,
                "batch_input_shape": [null, 1, 52],
                "kernel_constraint": null,
                "kernel_initializer": {"class_name": "VarianceScaling",
                  "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}},
      "units": 2,
      "trainable": true,
      "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}},
      "recurrent_activation": "hard_sigmoid",
      "dtype": "float32",
      "recurrent_regularizer": null,
      "dropout": 0.0,
      "unit_forget_bias": true,
      "bias_regularizer": null,
      "recurrent_dropout": 0.0,
      "stateful": false,
      "use_bias": true,
      "activity_regularizer": null,
      "name": "lstm_1",
      "bias_initializer": {"class_name": "Zeros", "config": {}},
      "bias_constraint": null}},
    {"class_name": "LSTM",
      "config": {"go_backwards": false,
        "return_sequences": true,
        "kernel_regularizer": null,
        "implementation": 0,
        "activation": "tanh",
        "unroll": false,
        "recurrent_constraint": null,
        "kernel_constraint": null,
        "kernel_initializer": {"class_name": "VarianceScaling",
          "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}},
        "units": 8,
        "trainable": true,
        "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}},
        "recurrent_activation": "hard_sigmoid",
        "recurrent_regularizer": null,
        "dropout": 0.0,
        "unit_forget_bias": true,
        "bias_regularizer": null,
        "recurrent_dropout": 0.0,
        "stateful": false,
        "use_bias": true,
        "activity_regularizer": null,
        "name": "lstm_2",
        "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}
    {"class_name": "LSTM",
      "config": {"go_backwards": false,
        "return_sequences": true,
        "kernel_regularizer": null,
        "implementation": 0,
        "activation": "tanh",
        "unroll": false,
        "recurrent_constraint": null,
        "kernel_constraint": null,
        "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}},
        "units": 16,
        "trainable": true,
        "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}},
        "recurrent_activation": "hard_sigmoid",
        "recurrent_regularizer": null,
        "dropout": 0.0,
        "unit_forget_bias": true,
        "bias_regularizer": null,
        "recurrent_dropout": 0.0,
        "stateful": false,
        "use_bias": true,
        "activity_regularizer": null,
        "name": "lstm_3",
        "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}},
    {"class_name": "LSTM",
      "config": {"go_backwards": false,
        "return_sequences": true,
        "kernel_regularizer": null,
        "implementation": 0,
        "activation": "tanh",
        "unroll": false,
        "recurrent_constraint": null,
        "kernel_constraint": null,
        "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}},
        "units": 128,
        "trainable": true,
        "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}},
        "recurrent_activation": "hard_sigmoid",
        "recurrent_regularizer": null,
        "dropout": 0.0,
        "unit_forget_bias": true,
        "bias_regularizer": null,
        "recurrent_dropout": 0.0,
        "stateful": false,
        "use_bias": true,
        "activity_regularizer": null,
        "name": "lstm_4",
        "bias_initializer": {"class_name": "Zeros", "config": {}},
        "bias_constraint": null}},
    {"class_name": "LSTM",
      "config": {"go_backwards": false,
        "return_sequences": true,
        "kernel_regularizer": null,
        "implementation": 0,
        "activation": "tanh",
        "unroll": false,
        "recurrent_constraint": null,
        "kernel_constraint": null,
        "kernel_initializer": {"class_name": "VarianceScaling",
          "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}},
        "units": 16,
        "trainable": true,
        "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}},
        "recurrent_activation": "hard_sigmoid",
        "recurrent_regularizer": null,
        "dropout": 0.0,
        "unit_forget_bias": true,
        "bias_regularizer": null,
        "recurrent_dropout": 0.0,
        "stateful": false,
        "use_bias": true,
        "activity_regularizer": null,
        "name": "lstm_5",
        "bias_initializer": {"class_name": "Zeros", "config": {}},
        "bias_constraint": null}},
    {"class_name": "LSTM",
      "config": {"go_backwards": false,
        "return_sequences": true,
        "kernel_regularizer": null,
        "implementation": 0,
        "activation": "tanh",
        "unroll": false,
        "recurrent_constraint": null,
        "kernel_constraint": null,
        "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}},
        "units": 8,
        "trainable": true,
        "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}},
        "recurrent_activation": "hard_sigmoid",
        "recurrent_regularizer": null,
        "dropout": 0.0,
        "unit_forget_bias": true,
        "bias_regularizer": null,
        "recurrent_dropout": 0.0,
        "stateful": false,
        "use_bias": true,
        "activity_regularizer": null,
        "name": "lstm_6",
        "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}},
    {"class_name": "LSTM",
      "config": {"go_backwards": false,
        "return_sequences": true,
        "kernel_regularizer": null,
        "implementation": 0,
        "activation": "tanh",
        "unroll": false,
        "recurrent_constraint": null,
        "kernel_constraint": null,
        "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}},
        "units": 2,
        "trainable": true,
        "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}},
        "recurrent_activation": "hard_sigmoid",
        "recurrent_regularizer": null,
        "dropout": 0.0,
        "unit_forget_bias": true,
        "bias_regularizer": null,
        "recurrent_dropout": 0.0,
        "stateful": false,
        "use_bias": true,
        "activity_regularizer": null,
        "name": "lstm_7",
        "bias_initializer": {"class_name": "Zeros", "config": {}},
        "bias_constraint": null}},
    {"class_name": "Dense",
      "config": {"kernel_regularizer": null,
        "trainable": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "bias_constraint": null, "units": 1}}]}