{"config": [{"config": {"activation": "tanh", "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unit_forget_bias": true, "kernel_constraint": null, "recurrent_regularizer": null, "go_backwards": false, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "dropout": 0.0, "stateful": false, "implementation": 0, "unroll": false, "recurrent_constraint": null, "bias_constraint": null, "use_bias": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "batch_input_shape": [null, 1, 48], "bias_regularizer": null, "kernel_regularizer": null, "name": "lstm_1", "activity_regularizer": null, "trainable": true, "units": 64}, "class_name": "LSTM"}, {"config": {"activation": "tanh", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unit_forget_bias": true, "kernel_constraint": null, "recurrent_regularizer": null, "go_backwards": false, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "dropout": 0.0, "kernel_regularizer": null, "implementation": 0, "unroll": false, "recurrent_constraint": null, "bias_constraint": null, "use_bias": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "bias_regularizer": null, "stateful": false, "name": "lstm_2", "activity_regularizer": null, "trainable": true, "units": 8}, "class_name": "LSTM"}, {"config": {"activation": "tanh", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unit_forget_bias": true, "kernel_constraint": null, "recurrent_regularizer": null, "go_backwards": false, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "dropout": 0.0, "kernel_regularizer": null, "implementation": 0, "unroll": false, "recurrent_constraint": null, "bias_constraint": null, "use_bias": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "bias_regularizer": null, "stateful": false, "name": "lstm_3", "activity_regularizer": null, "trainable": true, "units": 2}, "class_name": "LSTM"}, {"config": {"activation": "relu", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1, "activity_regularizer": null, "name": "dense_1", "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.2"}