{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"recurrent_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "dtype": "float32", "stateful": false, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_regularizer": null, "batch_input_shape": [null, 1, 52], "bias_regularizer": null, "unit_forget_bias": true, "go_backwards": false, "name": "lstm_1", "unroll": false, "bias_constraint": null, "trainable": true, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "implementation": 0, "units": 2, "recurrent_regularizer": null, "use_bias": true, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"recurrent_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "stateful": false, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "unit_forget_bias": true, "go_backwards": false, "name": "lstm_2", "unroll": false, "bias_constraint": null, "trainable": true, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "implementation": 0, "units": 4, "recurrent_regularizer": null, "use_bias": true, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"recurrent_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "stateful": false, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "unit_forget_bias": true, "go_backwards": false, "name": "lstm_3", "unroll": false, "bias_constraint": null, "trainable": true, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "implementation": 0, "units": 8, "recurrent_regularizer": null, "use_bias": true, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"recurrent_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "stateful": false, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "unit_forget_bias": true, "go_backwards": false, "name": "lstm_4", "unroll": false, "bias_constraint": null, "trainable": true, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "implementation": 0, "units": 16, "recurrent_regularizer": null, "use_bias": true, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"recurrent_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "stateful": false, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "unit_forget_bias": true, "go_backwards": false, "name": "lstm_5", "unroll": false, "bias_constraint": null, "trainable": true, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "implementation": 0, "units": 32, "recurrent_regularizer": null, "use_bias": true, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"recurrent_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "stateful": false, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "unit_forget_bias": true, "go_backwards": false, "name": "lstm_6", "unroll": false, "bias_constraint": null, "trainable": true, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "implementation": 0, "units": 64, "recurrent_regularizer": null, "use_bias": true, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"recurrent_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "stateful": false, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "unit_forget_bias": true, "go_backwards": false, "name": "lstm_7", "unroll": false, "bias_constraint": null, "trainable": true, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "implementation": 0, "units": 128, "recurrent_regularizer": null, "use_bias": true, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"recurrent_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "stateful": false, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "unit_forget_bias": true, "go_backwards": false, "name": "lstm_8", "unroll": false, "bias_constraint": null, "trainable": true, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "implementation": 0, "units": 64, "recurrent_regularizer": null, "use_bias": true, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"recurrent_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "stateful": false, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "unit_forget_bias": true, "go_backwards": false, "name": "lstm_9", "unroll": false, "bias_constraint": null, "trainable": true, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "implementation": 0, "units": 32, "recurrent_regularizer": null, "use_bias": true, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"recurrent_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "stateful": false, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "unit_forget_bias": true, "go_backwards": false, "name": "lstm_10", "unroll": false, "bias_constraint": null, "trainable": true, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "implementation": 0, "units": 16, "recurrent_regularizer": null, "use_bias": true, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"recurrent_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "stateful": false, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "unit_forget_bias": true, "go_backwards": false, "name": "lstm_11", "unroll": false, "bias_constraint": null, "trainable": true, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "implementation": 0, "units": 8, "recurrent_regularizer": null, "use_bias": true, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"recurrent_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "stateful": false, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "unit_forget_bias": true, "go_backwards": false, "name": "lstm_12", "unroll": false, "bias_constraint": null, "trainable": true, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "implementation": 0, "units": 4, "recurrent_regularizer": null, "use_bias": true, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"recurrent_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "stateful": false, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "unit_forget_bias": true, "go_backwards": false, "name": "lstm_13", "unroll": false, "bias_constraint": null, "trainable": true, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "implementation": 0, "units": 2, "recurrent_regularizer": null, "use_bias": true, "activation": "tanh"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "name": "dense_1", "bias_constraint": null, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "units": 1, "use_bias": true, "activation": "relu"}}], "keras_version": "2.0.2"}