{"config": [{"class_name": "LSTM", "config": {"kernel_regularizer": null, "recurrent_dropout": 0.0, "implementation": 0, "activity_regularizer": null, "units": 2, "name": "lstm_1", "batch_input_shape": [null, 1, 48], "activation": "tanh", "unroll": false, "bias_regularizer": null, "recurrent_constraint": null, "dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "stateful": false, "dtype": "float32", "kernel_constraint": null, "use_bias": true, "return_sequences": true, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}}, "trainable": true, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "unit_forget_bias": true}}, {"class_name": "LSTM", "config": {"kernel_regularizer": null, "recurrent_dropout": 0.0, "implementation": 0, "activity_regularizer": null, "units": 8, "name": "lstm_2", "activation": "tanh", "unroll": false, "bias_constraint": null, "recurrent_constraint": null, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "return_sequences": true, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}}, "trainable": true, "bias_regularizer": null, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true}}, {"class_name": "LSTM", "config": {"kernel_regularizer": null, "recurrent_dropout": 0.0, "implementation": 0, "activity_regularizer": null, "units": 32, "name": "lstm_3", "activation": "tanh", "unroll": false, "bias_constraint": null, "recurrent_constraint": null, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "return_sequences": true, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}}, "trainable": true, "bias_regularizer": null, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true}}, {"class_name": "LSTM", "config": {"kernel_regularizer": null, "recurrent_dropout": 0.0, "implementation": 0, "activity_regularizer": null, "units": 32, "name": "lstm_4", "activation": "tanh", "unroll": false, "bias_constraint": null, "recurrent_constraint": null, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "return_sequences": true, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}}, "trainable": true, "bias_regularizer": null, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true}}, {"class_name": "LSTM", "config": {"kernel_regularizer": null, "recurrent_dropout": 0.0, "implementation": 0, "activity_regularizer": null, "units": 8, "name": "lstm_5", "activation": "tanh", "unroll": false, "bias_constraint": null, "recurrent_constraint": null, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "return_sequences": true, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}}, "trainable": true, "bias_regularizer": null, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true}}, {"class_name": "LSTM", "config": {"kernel_regularizer": null, "recurrent_dropout": 0.0, "implementation": 0, "activity_regularizer": null, "units": 2, "name": "lstm_6", "activation": "tanh", "unroll": false, "bias_constraint": null, "recurrent_constraint": null, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "return_sequences": true, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}}, "trainable": true, "bias_regularizer": null, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "units": 1, "name": "dense_1", "use_bias": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}}, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.2"}