{"config": [{"config": {"recurrent_regularizer": null, "stateful": false, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unroll": false, "bias_regularizer": null, "activation": "tanh", "batch_input_shape": [null, 1, 52], "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_constraint": null, "dropout": 0.0, "kernel_regularizer": null, "units": 128, "dtype": "float32", "implementation": 0, "recurrent_constraint": null, "name": "lstm_1", "activity_regularizer": null, "recurrent_dropout": 0.0, "use_bias": true, "return_sequences": true, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "unit_forget_bias": true, "go_backwards": false}, "class_name": "LSTM"}, {"config": {"bias_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_1", "units": 1, "use_bias": true, "activation": "relu", "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}], "keras_version": "2.0.2", "class_name": "Sequential", "backend": "tensorflow"}