{"config": [{"class_name": "LSTM", "config": {"batch_input_shape": [null, 1, 52], "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "recurrent_regularizer": null, "dropout": 0.0, "recurrent_dropout": 0.0, "name": "lstm_1", "units": 2, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "stateful": false, "recurrent_activation": "hard_sigmoid", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}}, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "implementation": 0, "unroll": false, "recurrent_constraint": null, "activity_regularizer": null, "dtype": "float32", "activation": "tanh", "use_bias": true, "unit_forget_bias": true, "return_sequences": true}}, {"class_name": "LSTM", "config": {"kernel_regularizer": null, "recurrent_dropout": 0.0, "bias_constraint": null, "recurrent_regularizer": null, "dropout": 0.0, "kernel_constraint": null, "name": "lstm_2", "units": 64, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "stateful": false, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}}, "bias_regularizer": null, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "implementation": 0, "unroll": false, "recurrent_constraint": null, "activity_regularizer": null, "activation": "tanh", "use_bias": true, "unit_forget_bias": true, "return_sequences": true}}, {"class_name": "LSTM", "config": {"kernel_regularizer": null, "recurrent_dropout": 0.0, "bias_constraint": null, "recurrent_regularizer": null, "dropout": 0.0, "kernel_constraint": null, "name": "lstm_3", "units": 64, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "stateful": false, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}}, "bias_regularizer": null, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "implementation": 0, "unroll": false, "recurrent_constraint": null, "activity_regularizer": null, "activation": "tanh", "use_bias": true, "unit_forget_bias": true, "return_sequences": true}}, {"class_name": "LSTM", "config": {"kernel_regularizer": null, "recurrent_dropout": 0.0, "bias_constraint": null, "recurrent_regularizer": null, "dropout": 0.0, "kernel_constraint": null, "name": "lstm_4", "units": 2, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "stateful": false, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}}, "bias_regularizer": null, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "implementation": 0, "unroll": false, "recurrent_constraint": null, "activity_regularizer": null, "activation": "tanh", "use_bias": true, "unit_forget_bias": true, "return_sequences": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "name": "dense_1", "activation": "relu", "use_bias": true, "units": 1}}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.2"}