{"class_name": "Sequential", "keras_version": "2.0.2", "config": [{"class_name": "LSTM", "config": {"trainable": true, "recurrent_regularizer": null, "use_bias": true, "units": 128, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "recurrent_dropout": 0.0, "recurrent_constraint": null, "name": "lstm_1", "go_backwards": false, "dtype": "float32", "unroll": false, "unit_forget_bias": true, "stateful": false, "bias_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "implementation": 0, "dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "batch_input_shape": [null, 1, 52], "activation": "tanh", "bias_regularizer": null, "return_sequences": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}}}}, {"class_name": "LSTM", "config": {"trainable": true, "recurrent_regularizer": null, "use_bias": true, "units": 32, "kernel_regularizer": null, "recurrent_dropout": 0.0, "recurrent_constraint": null, "name": "lstm_2", "go_backwards": false, "stateful": false, "unroll": false, "unit_forget_bias": true, "bias_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "implementation": 0, "dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "bias_regularizer": null, "return_sequences": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}}}}, {"class_name": "LSTM", "config": {"trainable": true, "recurrent_regularizer": null, "use_bias": true, "units": 2, "kernel_regularizer": null, "recurrent_dropout": 0.0, "recurrent_constraint": null, "name": "lstm_3", "go_backwards": false, "stateful": false, "unroll": false, "unit_forget_bias": true, "bias_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "implementation": 0, "dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "bias_regularizer": null, "return_sequences": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}}}}, {"class_name": "Dense", "config": {"trainable": true, "bias_constraint": null, "use_bias": true, "units": 1, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}}}}], "backend": "tensorflow"}