{"keras_version": "2.0.2", "config": [{"config": {"dtype": "float32", "recurrent_dropout": 0.0, "kernel_regularizer": null, "recurrent_regularizer": null, "implementation": 0, "return_sequences": true, "batch_input_shape": [null, 1, 52], "go_backwards": false, "recurrent_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "tanh", "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "stateful": false, "kernel_initializer": {"config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dropout": 0.0, "trainable": true, "unroll": false, "unit_forget_bias": true, "name": "lstm_1", "units": 32, "kernel_constraint": null}, "class_name": "LSTM"}, {"config": {"recurrent_regularizer": null, "recurrent_dropout": 0.0, "kernel_regularizer": null, "implementation": 0, "return_sequences": true, "go_backwards": false, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "tanh", "recurrent_constraint": null, "bias_regularizer": null, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "stateful": false, "kernel_initializer": {"config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dropout": 0.0, "trainable": true, "unroll": false, "unit_forget_bias": true, "name": "lstm_2", "units": 32, "kernel_constraint": null}, "class_name": "LSTM"}, {"config": {"recurrent_regularizer": null, "recurrent_dropout": 0.0, "kernel_regularizer": null, "implementation": 0, "return_sequences": true, "go_backwards": false, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "tanh", "recurrent_constraint": null, "bias_regularizer": null, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "stateful": false, "kernel_initializer": {"config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dropout": 0.0, "trainable": true, "unroll": false, "unit_forget_bias": true, "name": "lstm_3", "units": 32, "kernel_constraint": null}, "class_name": "LSTM"}, {"config": {"recurrent_regularizer": null, "recurrent_dropout": 0.0, "kernel_regularizer": null, "implementation": 0, "return_sequences": true, "go_backwards": false, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "tanh", "recurrent_constraint": null, "bias_regularizer": null, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "stateful": false, "kernel_initializer": {"config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dropout": 0.0, "trainable": true, "unroll": false, "unit_forget_bias": true, "name": "lstm_4", "units": 32, "kernel_constraint": null}, "class_name": "LSTM"}, {"config": {"recurrent_regularizer": null, "recurrent_dropout": 0.0, "kernel_regularizer": null, "implementation": 0, "return_sequences": true, "go_backwards": false, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "tanh", "recurrent_constraint": null, "bias_regularizer": null, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "stateful": false, "kernel_initializer": {"config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dropout": 0.0, "trainable": true, "unroll": false, "unit_forget_bias": true, "name": "lstm_5", "units": 32, "kernel_constraint": null}, "class_name": "LSTM"}, {"config": {"use_bias": true, "bias_regularizer": null, "bias_constraint": null, "name": "dense_1", "kernel_initializer": {"config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "units": 1, "kernel_constraint": null, "activation": "relu"}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow"}