{"config": [{"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "bias_constraint": null, "unroll": false, "batch_input_shape": [null, 1, 48], "activation": "tanh", "return_sequences": true, "recurrent_activation": "hard_sigmoid", "units": 8, "dropout": 0.0, "unit_forget_bias": true, "trainable": true, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "kernel_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "dtype": "float32", "implementation": 0, "recurrent_constraint": null, "use_bias": true, "name": "lstm_1", "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "stateful": false, "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "mode": "fan_in", "scale": 2.0}, "class_name": "VarianceScaling"}}, "class_name": "LSTM"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "bias_constraint": null, "unroll": false, "return_sequences": true, "recurrent_activation": "hard_sigmoid", "units": 8, "dropout": 0.0, "unit_forget_bias": true, "trainable": true, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "kernel_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "activation": "tanh", "implementation": 0, "recurrent_constraint": null, "use_bias": true, "name": "lstm_2", "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "stateful": false, "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "mode": "fan_in", "scale": 2.0}, "class_name": "VarianceScaling"}}, "class_name": "LSTM"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "bias_constraint": null, "unroll": false, "return_sequences": true, "recurrent_activation": "hard_sigmoid", "units": 8, "dropout": 0.0, "unit_forget_bias": true, "trainable": true, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "kernel_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "activation": "tanh", "implementation": 0, "recurrent_constraint": null, "use_bias": true, "name": "lstm_3", "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "stateful": false, "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "mode": "fan_in", "scale": 2.0}, "class_name": "VarianceScaling"}}, "class_name": "LSTM"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "bias_constraint": null, "unroll": false, "return_sequences": true, "recurrent_activation": "hard_sigmoid", "units": 8, "dropout": 0.0, "unit_forget_bias": true, "trainable": true, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "kernel_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "activation": "tanh", "implementation": 0, "recurrent_constraint": null, "use_bias": true, "name": "lstm_4", "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "stateful": false, "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "mode": "fan_in", "scale": 2.0}, "class_name": "VarianceScaling"}}, "class_name": "LSTM"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "trainable": true, "use_bias": true, "name": "dense_1", "units": 1, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "mode": "fan_in", "scale": 2.0}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.2"}