{"config": [{"config": {"bias_regularizer": null, "trainable": true, "activation": "tanh", "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "recurrent_constraint": null, "return_sequences": true, "bias_constraint": null, "batch_input_shape": [null, 1, 48], "go_backwards": false, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "units": 2, "kernel_regularizer": null, "unit_forget_bias": true, "unroll": false, "dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "stateful": false, "implementation": 0, "kernel_constraint": null, "dtype": "float32", "name": "lstm_1", "use_bias": true, "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM"}, {"config": {"bias_regularizer": null, "trainable": true, "activation": "tanh", "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "recurrent_constraint": null, "return_sequences": true, "bias_constraint": null, "go_backwards": false, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "units": 16, "kernel_regularizer": null, "unit_forget_bias": true, "unroll": false, "dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "stateful": false, "implementation": 0, "kernel_constraint": null, "name": "lstm_2", "use_bias": true, "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM"}, {"config": {"bias_regularizer": null, "trainable": true, "activation": "tanh", "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "recurrent_constraint": null, "return_sequences": true, "bias_constraint": null, "go_backwards": false, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "units": 64, "kernel_regularizer": null, "unit_forget_bias": true, "unroll": false, "dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "stateful": false, "implementation": 0, "kernel_constraint": null, "name": "lstm_3", "use_bias": true, "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM"}, {"config": {"bias_regularizer": null, "trainable": true, "activation": "tanh", "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "recurrent_constraint": null, "return_sequences": true, "bias_constraint": null, "go_backwards": false, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "units": 64, "kernel_regularizer": null, "unit_forget_bias": true, "unroll": false, "dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "stateful": false, "implementation": 0, "kernel_constraint": null, "name": "lstm_4", "use_bias": true, "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM"}, {"config": {"bias_regularizer": null, "trainable": true, "activation": "tanh", "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "recurrent_constraint": null, "return_sequences": true, "bias_constraint": null, "go_backwards": false, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "units": 16, "kernel_regularizer": null, "unit_forget_bias": true, "unroll": false, "dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "stateful": false, "implementation": 0, "kernel_constraint": null, "name": "lstm_5", "use_bias": true, "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM"}, {"config": {"bias_regularizer": null, "trainable": true, "activation": "tanh", "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "recurrent_constraint": null, "return_sequences": true, "bias_constraint": null, "go_backwards": false, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "units": 2, "kernel_regularizer": null, "unit_forget_bias": true, "unroll": false, "dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "stateful": false, "implementation": 0, "kernel_constraint": null, "name": "lstm_6", "use_bias": true, "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM"}, {"config": {"bias_regularizer": null, "kernel_regularizer": null, "trainable": true, "activation": "relu", "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "kernel_constraint": null, "units": 1, "use_bias": true}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.0.2", "class_name": "Sequential"}