{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.2", "config": [{"class_name": "LSTM", "config": {"bias_constraint": null, "dtype": "float32", "implementation": 0, "units": 2, "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "seed": null, "mode": "fan_in"}}, "return_sequences": true, "recurrent_dropout": 0.0, "bias_regularizer": null, "recurrent_constraint": null, "activity_regularizer": null, "unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "batch_input_shape": [null, 1, 48], "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "trainable": true, "unroll": false, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "use_bias": true, "kernel_constraint": null, "name": "lstm_1", "go_backwards": false, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"bias_constraint": null, "implementation": 0, "units": 2, "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "seed": null, "mode": "fan_in"}}, "return_sequences": true, "recurrent_dropout": 0.0, "bias_regularizer": null, "recurrent_constraint": null, "activity_regularizer": null, "unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "trainable": true, "unroll": false, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "use_bias": true, "kernel_constraint": null, "name": "lstm_2", "go_backwards": false, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"bias_constraint": null, "implementation": 0, "units": 2, "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "seed": null, "mode": "fan_in"}}, "return_sequences": true, "recurrent_dropout": 0.0, "bias_regularizer": null, "recurrent_constraint": null, "activity_regularizer": null, "unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "trainable": true, "unroll": false, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "use_bias": true, "kernel_constraint": null, "name": "lstm_3", "go_backwards": false, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"bias_constraint": null, "implementation": 0, "units": 2, "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "seed": null, "mode": "fan_in"}}, "return_sequences": true, "recurrent_dropout": 0.0, "bias_regularizer": null, "recurrent_constraint": null, "activity_regularizer": null, "unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "trainable": true, "unroll": false, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "use_bias": true, "kernel_constraint": null, "name": "lstm_4", "go_backwards": false, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"bias_constraint": null, "implementation": 0, "units": 2, "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "seed": null, "mode": "fan_in"}}, "return_sequences": true, "recurrent_dropout": 0.0, "bias_regularizer": null, "recurrent_constraint": null, "activity_regularizer": null, "unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "trainable": true, "unroll": false, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "use_bias": true, "kernel_constraint": null, "name": "lstm_5", "go_backwards": false, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"bias_constraint": null, "implementation": 0, "units": 2, "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "seed": null, "mode": "fan_in"}}, "return_sequences": true, "recurrent_dropout": 0.0, "bias_regularizer": null, "recurrent_constraint": null, "activity_regularizer": null, "unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "trainable": true, "unroll": false, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "use_bias": true, "kernel_constraint": null, "name": "lstm_6", "go_backwards": false, "activation": "tanh"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "units": 1, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "seed": null, "mode": "fan_in"}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "name": "dense_1", "activity_regularizer": null, "activation": "relu"}}]}