{"config": [{"class_name": "LSTM", "config": {"implementation": 0, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}}, "dropout": 0.0, "dtype": "float32", "activity_regularizer": null, "activation": "tanh", "name": "lstm_1", "batch_input_shape": [null, 1, 52], "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_sequences": true, "kernel_regularizer": null, "recurrent_regularizer": null, "go_backwards": false, "use_bias": true, "trainable": true, "kernel_constraint": null, "unit_forget_bias": true, "recurrent_dropout": 0.0, "units": 16, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "stateful": false, "unroll": false, "bias_constraint": null}}, {"class_name": "LSTM", "config": {"implementation": 0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}}, "dropout": 0.0, "activity_regularizer": null, "activation": "tanh", "name": "lstm_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_sequences": true, "kernel_regularizer": null, "recurrent_regularizer": null, "go_backwards": false, "use_bias": true, "trainable": true, "kernel_constraint": null, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "units": 16, "recurrent_constraint": null, "bias_regularizer": null, "stateful": false, "unroll": false, "recurrent_dropout": 0.0, "bias_constraint": null}}, {"class_name": "LSTM", "config": {"implementation": 0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}}, "dropout": 0.0, "activity_regularizer": null, "activation": "tanh", "name": "lstm_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_sequences": true, "kernel_regularizer": null, "recurrent_regularizer": null, "go_backwards": false, "use_bias": true, "trainable": true, "kernel_constraint": null, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "units": 16, "recurrent_constraint": null, "bias_regularizer": null, "stateful": false, "unroll": false, "recurrent_dropout": 0.0, "bias_constraint": null}}, {"class_name": "LSTM", "config": {"implementation": 0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}}, "dropout": 0.0, "activity_regularizer": null, "activation": "tanh", "name": "lstm_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_sequences": true, "kernel_regularizer": null, "recurrent_regularizer": null, "go_backwards": false, "use_bias": true, "trainable": true, "kernel_constraint": null, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "units": 16, "recurrent_constraint": null, "bias_regularizer": null, "stateful": false, "unroll": false, "recurrent_dropout": 0.0, "bias_constraint": null}}, {"class_name": "LSTM", "config": {"implementation": 0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}}, "dropout": 0.0, "activity_regularizer": null, "activation": "tanh", "name": "lstm_5", "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_sequences": true, "kernel_regularizer": null, "recurrent_regularizer": null, "go_backwards": false, "use_bias": true, "trainable": true, "kernel_constraint": null, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "units": 16, "recurrent_constraint": null, "bias_regularizer": null, "stateful": false, "unroll": false, "recurrent_dropout": 0.0, "bias_constraint": null}}, {"class_name": "LSTM", "config": {"implementation": 0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}}, "dropout": 0.0, "activity_regularizer": null, "activation": "tanh", "name": "lstm_6", "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_sequences": true, "kernel_regularizer": null, "recurrent_regularizer": null, "go_backwards": false, "use_bias": true, "trainable": true, "kernel_constraint": null, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "units": 16, "recurrent_constraint": null, "bias_regularizer": null, "stateful": false, "unroll": false, "recurrent_dropout": 0.0, "bias_constraint": null}}, {"class_name": "LSTM", "config": {"implementation": 0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}}, "dropout": 0.0, "activity_regularizer": null, "activation": "tanh", "name": "lstm_7", "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_sequences": true, "kernel_regularizer": null, "recurrent_regularizer": null, "go_backwards": false, "use_bias": true, "trainable": true, "kernel_constraint": null, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "units": 16, "recurrent_constraint": null, "bias_regularizer": null, "stateful": false, "unroll": false, "recurrent_dropout": 0.0, "bias_constraint": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}}, "trainable": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "name": "dense_1", "activity_regularizer": null, "bias_constraint": null}}], "backend": "tensorflow", "keras_version": "2.0.2", "class_name": "Sequential"}