{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"go_backwards": false, "dtype": "float32", "batch_input_shape": [null, 1, 52], "activation": "tanh", "units": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "recurrent_constraint": null, "name": "lstm_1", "unit_forget_bias": true, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "return_sequences": true, "stateful": false, "implementation": 0, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_constraint": null, "dropout": 0.0, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "use_bias": true, "recurrent_dropout": 0.0}}, {"class_name": "LSTM", "config": {"go_backwards": false, "activation": "tanh", "units": 8, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "recurrent_constraint": null, "name": "lstm_2", "unit_forget_bias": true, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "return_sequences": true, "stateful": false, "implementation": 0, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_constraint": null, "dropout": 0.0, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "use_bias": true, "recurrent_dropout": 0.0}}, {"class_name": "LSTM", "config": {"go_backwards": false, "activation": "tanh", "units": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "recurrent_constraint": null, "name": "lstm_3", "unit_forget_bias": true, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "return_sequences": true, "stateful": false, "implementation": 0, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_constraint": null, "dropout": 0.0, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "use_bias": true, "recurrent_dropout": 0.0}}, {"class_name": "LSTM", "config": {"go_backwards": false, "activation": "tanh", "units": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "recurrent_constraint": null, "name": "lstm_4", "unit_forget_bias": true, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "return_sequences": true, "stateful": false, "implementation": 0, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_constraint": null, "dropout": 0.0, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "use_bias": true, "recurrent_dropout": 0.0}}, {"class_name": "LSTM", "config": {"go_backwards": false, "activation": "tanh", "units": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "recurrent_constraint": null, "name": "lstm_5", "unit_forget_bias": true, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "return_sequences": true, "stateful": false, "implementation": 0, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_constraint": null, "dropout": 0.0, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "use_bias": true, "recurrent_dropout": 0.0}}, {"class_name": "LSTM", "config": {"go_backwards": false, "activation": "tanh", "units": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "recurrent_constraint": null, "name": "lstm_6", "unit_forget_bias": true, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "return_sequences": true, "stateful": false, "implementation": 0, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_constraint": null, "dropout": 0.0, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "use_bias": true, "recurrent_dropout": 0.0}}, {"class_name": "LSTM", "config": {"go_backwards": false, "activation": "tanh", "units": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "recurrent_constraint": null, "name": "lstm_7", "unit_forget_bias": true, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "return_sequences": true, "stateful": false, "implementation": 0, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_constraint": null, "dropout": 0.0, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "use_bias": true, "recurrent_dropout": 0.0}}, {"class_name": "LSTM", "config": {"go_backwards": false, "activation": "tanh", "units": 8, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "recurrent_constraint": null, "name": "lstm_8", "unit_forget_bias": true, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "return_sequences": true, "stateful": false, "implementation": 0, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_constraint": null, "dropout": 0.0, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "use_bias": true, "recurrent_dropout": 0.0}}, {"class_name": "LSTM", "config": {"go_backwards": false, "activation": "tanh", "units": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "recurrent_constraint": null, "name": "lstm_9", "unit_forget_bias": true, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "return_sequences": true, "stateful": false, "implementation": 0, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_constraint": null, "dropout": 0.0, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "use_bias": true, "recurrent_dropout": 0.0}}, {"class_name": "Dense", "config": {"use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "bias_constraint": null, "name": "dense_1", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "kernel_regularizer": null}}], "keras_version": "2.0.2", "backend": "tensorflow"}