{"backend": "tensorflow", "keras_version": "2.0.2", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"unroll": false, "activity_regularizer": null, "return_sequences": true, "trainable": true, "batch_input_shape": [null, 1, 48], "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "units": 2, "dropout": 0.0, "recurrent_dropout": 0.0, "recurrent_constraint": null, "recurrent_regularizer": null, "implementation": 0, "dtype": "float32", "kernel_regularizer": null, "activation": "tanh", "bias_constraint": null, "stateful": false, "name": "lstm_1", "bias_regularizer": null, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "unit_forget_bias": true, "kernel_constraint": null}}, {"class_name": "LSTM", "config": {"unroll": false, "activity_regularizer": null, "return_sequences": true, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "trainable": true, "dropout": 0.0, "recurrent_dropout": 0.0, "recurrent_constraint": null, "recurrent_regularizer": null, "implementation": 0, "units": 8, "kernel_regularizer": null, "activation": "tanh", "bias_constraint": null, "stateful": false, "name": "lstm_2", "bias_regularizer": null, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "unit_forget_bias": true, "kernel_constraint": null}}, {"class_name": "LSTM", "config": {"unroll": false, "activity_regularizer": null, "return_sequences": true, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "trainable": true, "dropout": 0.0, "recurrent_dropout": 0.0, "recurrent_constraint": null, "recurrent_regularizer": null, "implementation": 0, "units": 32, "kernel_regularizer": null, "activation": "tanh", "bias_constraint": null, "stateful": false, "name": "lstm_3", "bias_regularizer": null, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "unit_forget_bias": true, "kernel_constraint": null}}, {"class_name": "LSTM", "config": {"unroll": false, "activity_regularizer": null, "return_sequences": true, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "trainable": true, "dropout": 0.0, "recurrent_dropout": 0.0, "recurrent_constraint": null, "recurrent_regularizer": null, "implementation": 0, "units": 32, "kernel_regularizer": null, "activation": "tanh", "bias_constraint": null, "stateful": false, "name": "lstm_4", "bias_regularizer": null, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "unit_forget_bias": true, "kernel_constraint": null}}, {"class_name": "LSTM", "config": {"unroll": false, "activity_regularizer": null, "return_sequences": true, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "trainable": true, "dropout": 0.0, "recurrent_dropout": 0.0, "recurrent_constraint": null, "recurrent_regularizer": null, "implementation": 0, "units": 8, "kernel_regularizer": null, "activation": "tanh", "bias_constraint": null, "stateful": false, "name": "lstm_5", "bias_regularizer": null, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "unit_forget_bias": true, "kernel_constraint": null}}, {"class_name": "LSTM", "config": {"unroll": false, "activity_regularizer": null, "return_sequences": true, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "trainable": true, "dropout": 0.0, "recurrent_dropout": 0.0, "recurrent_constraint": null, "recurrent_regularizer": null, "implementation": 0, "units": 2, "kernel_regularizer": null, "activation": "tanh", "bias_constraint": null, "stateful": false, "name": "lstm_6", "bias_regularizer": null, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "unit_forget_bias": true, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"use_bias": true, "activity_regularizer": null, "name": "dense_1", "units": 1, "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "bias_constraint": null, "kernel_regularizer": null, "activation": "relu", "kernel_constraint": null}}]}