{"keras_version": "2.0.2", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"activation": "tanh", "go_backwards": false, "kernel_constraint": null, "bias_regularizer": null, "recurrent_constraint": null, "trainable": true, "units": 2, "kernel_regularizer": null, "unroll": false, "name": "lstm_1", "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "activity_regularizer": null, "dtype": "float32", "batch_input_shape": [null, 1, 52], "recurrent_regularizer": null, "unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "dropout": 0.0, "implementation": 0, "use_bias": true, "stateful": false}}, {"class_name": "LSTM", "config": {"activation": "tanh", "go_backwards": false, "kernel_constraint": null, "bias_regularizer": null, "recurrent_constraint": null, "trainable": true, "units": 8, "kernel_regularizer": null, "unroll": false, "name": "lstm_2", "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "activity_regularizer": null, "stateful": false, "recurrent_regularizer": null, "unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "dropout": 0.0, "implementation": 0, "use_bias": true}}, {"class_name": "LSTM", "config": {"activation": "tanh", "go_backwards": false, "kernel_constraint": null, "bias_regularizer": null, "recurrent_constraint": null, "trainable": true, "units": 16, "kernel_regularizer": null, "unroll": false, "name": "lstm_3", "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "activity_regularizer": null, "stateful": false, "recurrent_regularizer": null, "unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "dropout": 0.0, "implementation": 0, "use_bias": true}}, {"class_name": "LSTM", "config": {"activation": "tanh", "go_backwards": false, "kernel_constraint": null, "bias_regularizer": null, "recurrent_constraint": null, "trainable": true, "units": 128, "kernel_regularizer": null, "unroll": false, "name": "lstm_4", "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "activity_regularizer": null, "stateful": false, "recurrent_regularizer": null, "unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "dropout": 0.0, "implementation": 0, "use_bias": true}}, {"class_name": "LSTM", "config": {"activation": "tanh", "go_backwards": false, "kernel_constraint": null, "bias_regularizer": null, "recurrent_constraint": null, "trainable": true, "units": 16, "kernel_regularizer": null, "unroll": false, "name": "lstm_5", "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "activity_regularizer": null, "stateful": false, "recurrent_regularizer": null, "unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "dropout": 0.0, "implementation": 0, "use_bias": true}}, {"class_name": "LSTM", "config": {"activation": "tanh", "go_backwards": false, "kernel_constraint": null, "bias_regularizer": null, "recurrent_constraint": null, "trainable": true, "units": 8, "kernel_regularizer": null, "unroll": false, "name": "lstm_6", "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "activity_regularizer": null, "stateful": false, "recurrent_regularizer": null, "unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "dropout": 0.0, "implementation": 0, "use_bias": true}}, {"class_name": "LSTM", "config": {"activation": "tanh", "go_backwards": false, "kernel_constraint": null, "bias_regularizer": null, "recurrent_constraint": null, "trainable": true, "units": 2, "kernel_regularizer": null, "unroll": false, "name": "lstm_7", "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "activity_regularizer": null, "stateful": false, "recurrent_regularizer": null, "unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "dropout": 0.0, "implementation": 0, "use_bias": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "units": 1, "kernel_regularizer": null, "name": "dense_1", "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}]}