{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "units": 2, "unroll": false, "return_sequences": true, "recurrent_dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "batch_input_shape": [null, 1, 48], "activation": "tanh", "name": "lstm_1", "implementation": 0, "bias_constraint": null, "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "dtype": "float32", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "use_bias": true, "recurrent_constraint": null, "go_backwards": false}}, {"class_name": "LSTM", "config": {"kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "units": 8, "return_sequences": true, "use_bias": true, "recurrent_dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "trainable": true, "name": "lstm_2", "implementation": 0, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "dropout": 0.0, "activation": "tanh", "unroll": false, "recurrent_constraint": null, "go_backwards": false}}, {"class_name": "LSTM", "config": {"kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "units": 32, "return_sequences": true, "use_bias": true, "recurrent_dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "trainable": true, "name": "lstm_3", "implementation": 0, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "dropout": 0.0, "activation": "tanh", "unroll": false, "recurrent_constraint": null, "go_backwards": false}}, {"class_name": "LSTM", "config": {"kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "units": 32, "return_sequences": true, "use_bias": true, "recurrent_dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "trainable": true, "name": "lstm_4", "implementation": 0, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "dropout": 0.0, "activation": "tanh", "unroll": false, "recurrent_constraint": null, "go_backwards": false}}, {"class_name": "LSTM", "config": {"kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "units": 8, "return_sequences": true, "use_bias": true, "recurrent_dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "trainable": true, "name": "lstm_5", "implementation": 0, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "dropout": 0.0, "activation": "tanh", "unroll": false, "recurrent_constraint": null, "go_backwards": false}}, {"class_name": "LSTM", "config": {"kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "units": 2, "return_sequences": true, "use_bias": true, "recurrent_dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "trainable": true, "name": "lstm_6", "implementation": 0, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "dropout": 0.0, "activation": "tanh", "unroll": false, "recurrent_constraint": null, "go_backwards": false}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "name": "dense_1", "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}}}], "keras_version": "2.0.2", "backend": "tensorflow"}