{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.2", "config": [{"class_name": "LSTM", "config": {"dropout": 0.0, "bias_regularizer": null, "dtype": "float32", "unit_forget_bias": true, "use_bias": true, "activity_regularizer": null, "return_sequences": true, "activation": "tanh", "implementation": 0, "units": 2, "batch_input_shape": [null, 1, 52], "recurrent_regularizer": null, "recurrent_dropout": 0.0, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_constraint": null, "kernel_constraint": null, "go_backwards": false, "name": "lstm_1", "bias_constraint": null, "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "trainable": true, "unroll": false}}, {"class_name": "LSTM", "config": {"dropout": 0.0, "bias_regularizer": null, "unit_forget_bias": true, "use_bias": true, "activity_regularizer": null, "return_sequences": true, "unroll": false, "implementation": 0, "units": 4, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_constraint": null, "kernel_constraint": null, "go_backwards": false, "name": "lstm_2", "bias_constraint": null, "stateful": false, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "trainable": true, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"dropout": 0.0, "bias_regularizer": null, "unit_forget_bias": true, "use_bias": true, "activity_regularizer": null, "return_sequences": true, "unroll": false, "implementation": 0, "units": 8, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_constraint": null, "kernel_constraint": null, "go_backwards": false, "name": "lstm_3", "bias_constraint": null, "stateful": false, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "trainable": true, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"dropout": 0.0, "bias_regularizer": null, "unit_forget_bias": true, "use_bias": true, "activity_regularizer": null, "return_sequences": true, "unroll": false, "implementation": 0, "units": 16, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_constraint": null, "kernel_constraint": null, "go_backwards": false, "name": "lstm_4", "bias_constraint": null, "stateful": false, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "trainable": true, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"dropout": 0.0, "bias_regularizer": null, "unit_forget_bias": true, "use_bias": true, "activity_regularizer": null, "return_sequences": true, "unroll": false, "implementation": 0, "units": 128, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_constraint": null, "kernel_constraint": null, "go_backwards": false, "name": "lstm_5", "bias_constraint": null, "stateful": false, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "trainable": true, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"dropout": 0.0, "bias_regularizer": null, "unit_forget_bias": true, "use_bias": true, "activity_regularizer": null, "return_sequences": true, "unroll": false, "implementation": 0, "units": 16, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_constraint": null, "kernel_constraint": null, "go_backwards": false, "name": "lstm_6", "bias_constraint": null, "stateful": false, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "trainable": true, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"dropout": 0.0, "bias_regularizer": null, "unit_forget_bias": true, "use_bias": true, "activity_regularizer": null, "return_sequences": true, "unroll": false, "implementation": 0, "units": 8, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_constraint": null, "kernel_constraint": null, "go_backwards": false, "name": "lstm_7", "bias_constraint": null, "stateful": false, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "trainable": true, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"dropout": 0.0, "bias_regularizer": null, "unit_forget_bias": true, "use_bias": true, "activity_regularizer": null, "return_sequences": true, "unroll": false, "implementation": 0, "units": 4, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_constraint": null, "kernel_constraint": null, "go_backwards": false, "name": "lstm_8", "bias_constraint": null, "stateful": false, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "trainable": true, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"dropout": 0.0, "bias_regularizer": null, "unit_forget_bias": true, "use_bias": true, "activity_regularizer": null, "return_sequences": true, "unroll": false, "implementation": 0, "units": 2, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_constraint": null, "kernel_constraint": null, "go_backwards": false, "name": "lstm_9", "bias_constraint": null, "stateful": false, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "trainable": true, "activation": "tanh"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "name": "dense_1", "bias_constraint": null, "activity_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "trainable": true, "units": 1, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}]}