{"keras_version": "2.0.2", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "recurrent_regularizer": null, "dropout": 0.0, "go_backwards": false, "kernel_constraint": null, "stateful": false, "unroll": false, "recurrent_constraint": null, "unit_forget_bias": true, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "name": "lstm_1", "trainable": true, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "dtype": "float32", "implementation": 0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "bias_regularizer": null, "units": 64, "batch_input_shape": [null, 1, 52]}}, {"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "recurrent_regularizer": null, "dropout": 0.0, "go_backwards": false, "kernel_constraint": null, "stateful": false, "unroll": false, "bias_regularizer": null, "unit_forget_bias": true, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "name": "lstm_2", "trainable": true, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "implementation": 0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "recurrent_constraint": null, "units": 2}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activation": "relu", "bias_constraint": null, "name": "dense_1", "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "bias_regularizer": null, "units": 1}}]}