{"keras_version": "2.0.2", "backend": "tensorflow", "config": [{"config": {"kernel_initializer": {"config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}, "class_name": "VarianceScaling"}, "stateful": false, "recurrent_activation": "hard_sigmoid", "unroll": false, "bias_regularizer": null, "dtype": "float32", "trainable": true, "recurrent_regularizer": null, "kernel_regularizer": null, "go_backwards": false, "recurrent_constraint": null, "recurrent_dropout": 0.0, "batch_input_shape": [null, 1, 52], "unit_forget_bias": true, "name": "lstm_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "return_sequences": true, "units": 128, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "activity_regularizer": null, "activation": "tanh", "dropout": 0.0, "kernel_constraint": null, "use_bias": true, "implementation": 0}, "class_name": "LSTM"}, {"config": {"kernel_initializer": {"config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}, "class_name": "VarianceScaling"}, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "units": 1, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true}, "class_name": "Dense"}], "class_name": "Sequential"}