{"config": [{"config": {"dropout": 0.0, "name": "lstm_1", "recurrent_regularizer": null, "bias_regularizer": null, "units": 2, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "return_sequences": true, "recurrent_constraint": null, "stateful": false, "implementation": 0, "unit_forget_bias": true, "unroll": false, "kernel_constraint": null, "recurrent_dropout": 0.0, "activity_regularizer": null, "batch_input_shape": [null, 1, 48], "dtype": "float32", "bias_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "trainable": true, "go_backwards": false, "use_bias": true}, "class_name": "LSTM"}, {"config": {"dropout": 0.0, "activation": "tanh", "kernel_constraint": null, "bias_regularizer": null, "recurrent_regularizer": null, "units": 8, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "name": "lstm_2", "return_sequences": true, "recurrent_constraint": null, "stateful": false, "implementation": 0, "unit_forget_bias": true, "unroll": false, "recurrent_dropout": 0.0, "activity_regularizer": null, "bias_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "trainable": true, "go_backwards": false, "use_bias": true}, "class_name": "LSTM"}, {"config": {"dropout": 0.0, "activation": "tanh", "kernel_constraint": null, "bias_regularizer": null, "recurrent_regularizer": null, "units": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "name": "lstm_3", "return_sequences": true, "recurrent_constraint": null, "stateful": false, "implementation": 0, "unit_forget_bias": true, "unroll": false, "recurrent_dropout": 0.0, "activity_regularizer": null, "bias_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "trainable": true, "go_backwards": false, "use_bias": true}, "class_name": "LSTM"}, {"config": {"dropout": 0.0, "activation": "tanh", "kernel_constraint": null, "bias_regularizer": null, "recurrent_regularizer": null, "units": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "name": "lstm_4", "return_sequences": true, "recurrent_constraint": null, "stateful": false, "implementation": 0, "unit_forget_bias": true, "unroll": false, "recurrent_dropout": 0.0, "activity_regularizer": null, "bias_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "trainable": true, "go_backwards": false, "use_bias": true}, "class_name": "LSTM"}, {"config": {"dropout": 0.0, "activation": "tanh", "kernel_constraint": null, "bias_regularizer": null, "recurrent_regularizer": null, "units": 8, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "name": "lstm_5", "return_sequences": true, "recurrent_constraint": null, "stateful": false, "implementation": 0, "unit_forget_bias": true, "unroll": false, "recurrent_dropout": 0.0, "activity_regularizer": null, "bias_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "trainable": true, "go_backwards": false, "use_bias": true}, "class_name": "LSTM"}, {"config": {"dropout": 0.0, "activation": "tanh", "kernel_constraint": null, "bias_regularizer": null, "recurrent_regularizer": null, "units": 2, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "name": "lstm_6", "return_sequences": true, "recurrent_constraint": null, "stateful": false, "implementation": 0, "unit_forget_bias": true, "unroll": false, "recurrent_dropout": 0.0, "activity_regularizer": null, "bias_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "trainable": true, "go_backwards": false, "use_bias": true}, "class_name": "LSTM"}, {"config": {"name": "dense_1", "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "trainable": true, "use_bias": true}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.2"}