{"class_name": "Sequential", "keras_version": "2.0.2", "config": [{"class_name": "LSTM", "config": {"bias_regularizer": null, "stateful": false, "dtype": "float32", "recurrent_dropout": 0.0, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "batch_input_shape": [null, 1, 48], "trainable": true, "unroll": false, "dropout": 0.0, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_regularizer": null, "activation": "tanh", "units": 2, "recurrent_activation": "hard_sigmoid", "name": "lstm_1", "recurrent_constraint": null, "bias_constraint": null, "implementation": 0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}}, "unit_forget_bias": true, "go_backwards": false, "kernel_regularizer": null}}, {"class_name": "LSTM", "config": {"bias_regularizer": null, "stateful": false, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}}, "use_bias": true, "implementation": 0, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "dropout": 0.0, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_regularizer": null, "activation": "tanh", "units": 8, "recurrent_activation": "hard_sigmoid", "name": "lstm_2", "recurrent_constraint": null, "bias_constraint": null, "activity_regularizer": null, "go_backwards": false, "unit_forget_bias": true, "unroll": false}}, {"class_name": "LSTM", "config": {"bias_regularizer": null, "stateful": false, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}}, "use_bias": true, "implementation": 0, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "dropout": 0.0, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_regularizer": null, "activation": "tanh", "units": 16, "recurrent_activation": "hard_sigmoid", "name": "lstm_3", "recurrent_constraint": null, "bias_constraint": null, "activity_regularizer": null, "go_backwards": false, "unit_forget_bias": true, "unroll": false}}, {"class_name": "LSTM", "config": {"bias_regularizer": null, "stateful": false, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}}, "use_bias": true, "implementation": 0, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "dropout": 0.0, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_regularizer": null, "activation": "tanh", "units": 64, "recurrent_activation": "hard_sigmoid", "name": "lstm_4", "recurrent_constraint": null, "bias_constraint": null, "activity_regularizer": null, "go_backwards": false, "unit_forget_bias": true, "unroll": false}}, {"class_name": "LSTM", "config": {"bias_regularizer": null, "stateful": false, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}}, "use_bias": true, "implementation": 0, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "dropout": 0.0, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_regularizer": null, "activation": "tanh", "units": 128, "recurrent_activation": "hard_sigmoid", "name": "lstm_5", "recurrent_constraint": null, "bias_constraint": null, "activity_regularizer": null, "go_backwards": false, "unit_forget_bias": true, "unroll": false}}, {"class_name": "LSTM", "config": {"bias_regularizer": null, "stateful": false, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}}, "use_bias": true, "implementation": 0, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "dropout": 0.0, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_regularizer": null, "activation": "tanh", "units": 64, "recurrent_activation": "hard_sigmoid", "name": "lstm_6", "recurrent_constraint": null, "bias_constraint": null, "activity_regularizer": null, "go_backwards": false, "unit_forget_bias": true, "unroll": false}}, {"class_name": "LSTM", "config": {"bias_regularizer": null, "stateful": false, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}}, "use_bias": true, "implementation": 0, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "dropout": 0.0, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_regularizer": null, "activation": "tanh", "units": 16, "recurrent_activation": "hard_sigmoid", "name": "lstm_7", "recurrent_constraint": null, "bias_constraint": null, "activity_regularizer": null, "go_backwards": false, "unit_forget_bias": true, "unroll": false}}, {"class_name": "LSTM", "config": {"bias_regularizer": null, "stateful": false, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}}, "use_bias": true, "implementation": 0, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "dropout": 0.0, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_regularizer": null, "activation": "tanh", "units": 8, "recurrent_activation": "hard_sigmoid", "name": "lstm_8", "recurrent_constraint": null, "bias_constraint": null, "activity_regularizer": null, "go_backwards": false, "unit_forget_bias": true, "unroll": false}}, {"class_name": "LSTM", "config": {"bias_regularizer": null, "stateful": false, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}}, "use_bias": true, "implementation": 0, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "dropout": 0.0, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_regularizer": null, "activation": "tanh", "units": 2, "recurrent_activation": "hard_sigmoid", "name": "lstm_9", "recurrent_constraint": null, "bias_constraint": null, "activity_regularizer": null, "go_backwards": false, "unit_forget_bias": true, "unroll": false}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "activation": "relu", "activity_regularizer": null, "units": 1, "use_bias": true, "name": "dense_1", "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "backend": "tensorflow"}