{"class_name": "Sequential", "keras_version": "2.0.2", "config": [{"class_name": "LSTM", "config": {"name": "lstm_1", "bias_regularizer": null, "return_sequences": true, "use_bias": true, "unroll": false, "go_backwards": false, "dropout": 0.0, "kernel_constraint": null, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "batch_input_shape": [null, 1, 52], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "recurrent_dropout": 0.0, "unit_forget_bias": true, "units": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "activation": "tanh", "implementation": 0, "trainable": true, "activity_regularizer": null, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "stateful": false, "recurrent_regularizer": null, "kernel_regularizer": null}}, {"class_name": "LSTM", "config": {"name": "lstm_2", "bias_regularizer": null, "return_sequences": true, "use_bias": true, "unroll": false, "go_backwards": false, "dropout": 0.0, "stateful": false, "bias_constraint": null, "unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "units": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "activation": "tanh", "implementation": 0, "trainable": true, "activity_regularizer": null, "recurrent_constraint": null, "kernel_constraint": null, "recurrent_regularizer": null, "kernel_regularizer": null}}, {"class_name": "LSTM", "config": {"name": "lstm_3", "bias_regularizer": null, "return_sequences": true, "use_bias": true, "unroll": false, "go_backwards": false, "dropout": 0.0, "stateful": false, "bias_constraint": null, "unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "units": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "activation": "tanh", "implementation": 0, "trainable": true, "activity_regularizer": null, "recurrent_constraint": null, "kernel_constraint": null, "recurrent_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "bias_regularizer": null, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "activation": "relu", "use_bias": true, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "backend": "tensorflow"}