{"backend": "tensorflow", "keras_version": "2.0.2", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"kernel_constraint": null, "dropout": 0.0, "recurrent_constraint": null, "unroll": false, "recurrent_dropout": 0.0, "trainable": true, "stateful": false, "activity_regularizer": null, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "go_backwards": false, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "return_sequences": true, "unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "implementation": 0, "batch_input_shape": [null, 1, 48], "dtype": "float32", "name": "lstm_1", "use_bias": true, "bias_regularizer": null, "bias_constraint": null}}, {"class_name": "LSTM", "config": {"kernel_constraint": null, "dropout": 0.0, "recurrent_constraint": null, "unroll": false, "recurrent_dropout": 0.0, "trainable": true, "stateful": false, "activity_regularizer": null, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "go_backwards": false, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 8, "return_sequences": true, "unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "implementation": 0, "name": "lstm_2", "use_bias": true, "bias_regularizer": null, "bias_constraint": null}}, {"class_name": "LSTM", "config": {"kernel_constraint": null, "dropout": 0.0, "recurrent_constraint": null, "unroll": false, "recurrent_dropout": 0.0, "trainable": true, "stateful": false, "activity_regularizer": null, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "go_backwards": false, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "return_sequences": true, "unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "implementation": 0, "name": "lstm_3", "use_bias": true, "bias_regularizer": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "bias_regularizer": null, "trainable": true, "name": "dense_1", "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}}}]}