{"class_name": "Sequential", "keras_version": "2.0.2", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"unit_forget_bias": true, "bias_regularizer": null, "dtype": "float32", "trainable": true, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "units": 16, "use_bias": true, "return_sequences": true, "kernel_constraint": null, "name": "lstm_1", "dropout": 0.0, "kernel_regularizer": null, "batch_input_shape": [null, 1, 52], "go_backwards": false, "stateful": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}}, "bias_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "implementation": 0, "recurrent_constraint": null, "recurrent_regularizer": null, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"unit_forget_bias": true, "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "trainable": true, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "units": 16, "use_bias": true, "return_sequences": true, "kernel_constraint": null, "dropout": 0.0, "kernel_regularizer": null, "name": "lstm_2", "implementation": 0, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}}, "bias_constraint": null, "go_backwards": false, "stateful": false, "recurrent_constraint": null, "recurrent_regularizer": null, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"unit_forget_bias": true, "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "trainable": true, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "units": 16, "use_bias": true, "return_sequences": true, "kernel_constraint": null, "dropout": 0.0, "kernel_regularizer": null, "name": "lstm_3", "implementation": 0, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}}, "bias_constraint": null, "go_backwards": false, "stateful": false, "recurrent_constraint": null, "recurrent_regularizer": null, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"unit_forget_bias": true, "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "trainable": true, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "units": 16, "use_bias": true, "return_sequences": true, "kernel_constraint": null, "dropout": 0.0, "kernel_regularizer": null, "name": "lstm_4", "implementation": 0, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}}, "bias_constraint": null, "go_backwards": false, "stateful": false, "recurrent_constraint": null, "recurrent_regularizer": null, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"unit_forget_bias": true, "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "trainable": true, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "units": 16, "use_bias": true, "return_sequences": true, "kernel_constraint": null, "dropout": 0.0, "kernel_regularizer": null, "name": "lstm_5", "implementation": 0, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}}, "bias_constraint": null, "go_backwards": false, "stateful": false, "recurrent_constraint": null, "recurrent_regularizer": null, "activation": "tanh"}}, {"class_name": "Dense", "config": {"name": "dense_1", "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}}, "use_bias": true, "units": 1, "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null}}]}