{"backend": "tensorflow", "keras_version": "2.0.2", "config": [{"config": {"recurrent_dropout": 0.0, "units": 2, "activity_regularizer": null, "batch_input_shape": [null, 1, 48], "kernel_regularizer": null, "stateful": false, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "activation": "tanh", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "implementation": 0, "name": "lstm_1", "return_sequences": true, "unroll": false, "unit_forget_bias": true, "dropout": 0.0, "trainable": true, "go_backwards": false, "bias_constraint": null, "dtype": "float32", "bias_regularizer": null, "recurrent_constraint": null, "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"recurrent_dropout": 0.0, "units": 2, "activity_regularizer": null, "kernel_regularizer": null, "stateful": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "activation": "tanh", "kernel_constraint": null, "unit_forget_bias": true, "use_bias": true, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "implementation": 0, "name": "lstm_2", "return_sequences": true, "unroll": false, "dropout": 0.0, "trainable": true, "go_backwards": false, "bias_constraint": null, "bias_regularizer": null, "recurrent_constraint": null, "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"recurrent_dropout": 0.0, "units": 2, "activity_regularizer": null, "kernel_regularizer": null, "stateful": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "activation": "tanh", "kernel_constraint": null, "unit_forget_bias": true, "use_bias": true, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "implementation": 0, "name": "lstm_3", "return_sequences": true, "unroll": false, "dropout": 0.0, "trainable": true, "go_backwards": false, "bias_constraint": null, "bias_regularizer": null, "recurrent_constraint": null, "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"recurrent_dropout": 0.0, "units": 2, "activity_regularizer": null, "kernel_regularizer": null, "stateful": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "activation": "tanh", "kernel_constraint": null, "unit_forget_bias": true, "use_bias": true, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "implementation": 0, "name": "lstm_4", "return_sequences": true, "unroll": false, "dropout": 0.0, "trainable": true, "go_backwards": false, "bias_constraint": null, "bias_regularizer": null, "recurrent_constraint": null, "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"recurrent_dropout": 0.0, "units": 2, "activity_regularizer": null, "kernel_regularizer": null, "stateful": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "activation": "tanh", "kernel_constraint": null, "unit_forget_bias": true, "use_bias": true, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "implementation": 0, "name": "lstm_5", "return_sequences": true, "unroll": false, "dropout": 0.0, "trainable": true, "go_backwards": false, "bias_constraint": null, "bias_regularizer": null, "recurrent_constraint": null, "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"recurrent_dropout": 0.0, "units": 2, "activity_regularizer": null, "kernel_regularizer": null, "stateful": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "activation": "tanh", "kernel_constraint": null, "unit_forget_bias": true, "use_bias": true, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "implementation": 0, "name": "lstm_6", "return_sequences": true, "unroll": false, "dropout": 0.0, "trainable": true, "go_backwards": false, "bias_constraint": null, "bias_regularizer": null, "recurrent_constraint": null, "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"units": 1, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_1", "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "relu", "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true}, "class_name": "Dense"}], "class_name": "Sequential"}