{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "activation": "tanh", "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "unit_forget_bias": true, "recurrent_regularizer": null, "batch_input_shape": [null, 1, 48], "recurrent_constraint": null, "bias_regularizer": null, "unroll": false, "dropout": 0.0, "recurrent_dropout": 0.0, "stateful": false, "use_bias": true, "units": 8, "kernel_regularizer": null, "return_sequences": true, "bias_constraint": null, "activity_regularizer": null, "name": "lstm_1", "implementation": 0, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LSTM", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "activation": "tanh", "go_backwards": false, "bias_constraint": null, "kernel_constraint": null, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "recurrent_constraint": null, "bias_regularizer": null, "dropout": 0.0, "recurrent_dropout": 0.0, "stateful": false, "use_bias": true, "units": 128, "kernel_regularizer": null, "return_sequences": true, "unroll": false, "activity_regularizer": null, "name": "lstm_2", "implementation": 0, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LSTM", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "activation": "tanh", "go_backwards": false, "bias_constraint": null, "kernel_constraint": null, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "recurrent_constraint": null, "bias_regularizer": null, "dropout": 0.0, "recurrent_dropout": 0.0, "stateful": false, "use_bias": true, "units": 8, "kernel_regularizer": null, "return_sequences": true, "unroll": false, "activity_regularizer": null, "name": "lstm_3", "implementation": 0, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "kernel_constraint": null, "activation": "relu", "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "name": "dense_1", "units": 1, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "keras_version": "2.0.2", "backend": "tensorflow"}