{"backend": "tensorflow", "keras_version": "2.0.2", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"recurrent_constraint": null, "batch_input_shape": [null, 1, 48], "units": 2, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "recurrent_regularizer": null, "name": "lstm_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "unroll": false, "dropout": 0.0, "go_backwards": false, "activation": "tanh", "return_sequences": true, "bias_regularizer": null, "unit_forget_bias": true, "stateful": false, "dtype": "float32", "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "mode": "fan_in", "scale": 2.0}}, "use_bias": true, "bias_constraint": null, "implementation": 0}}, {"class_name": "LSTM", "config": {"recurrent_constraint": null, "units": 2, "kernel_regularizer": null, "implementation": 0, "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "recurrent_regularizer": null, "name": "lstm_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "unroll": false, "dropout": 0.0, "go_backwards": false, "activation": "tanh", "bias_regularizer": null, "unit_forget_bias": true, "stateful": false, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "mode": "fan_in", "scale": 2.0}}, "use_bias": true, "bias_constraint": null, "return_sequences": true}}, {"class_name": "LSTM", "config": {"recurrent_constraint": null, "units": 2, "kernel_regularizer": null, "implementation": 0, "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "recurrent_regularizer": null, "name": "lstm_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "unroll": false, "dropout": 0.0, "go_backwards": false, "activation": "tanh", "bias_regularizer": null, "unit_forget_bias": true, "stateful": false, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "mode": "fan_in", "scale": 2.0}}, "use_bias": true, "bias_constraint": null, "return_sequences": true}}, {"class_name": "LSTM", "config": {"recurrent_constraint": null, "units": 2, "kernel_regularizer": null, "implementation": 0, "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "recurrent_regularizer": null, "name": "lstm_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "unroll": false, "dropout": 0.0, "go_backwards": false, "activation": "tanh", "bias_regularizer": null, "unit_forget_bias": true, "stateful": false, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "mode": "fan_in", "scale": 2.0}}, "use_bias": true, "bias_constraint": null, "return_sequences": true}}, {"class_name": "LSTM", "config": {"recurrent_constraint": null, "units": 2, "kernel_regularizer": null, "implementation": 0, "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "recurrent_regularizer": null, "name": "lstm_5", "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "unroll": false, "dropout": 0.0, "go_backwards": false, "activation": "tanh", "bias_regularizer": null, "unit_forget_bias": true, "stateful": false, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "mode": "fan_in", "scale": 2.0}}, "use_bias": true, "bias_constraint": null, "return_sequences": true}}, {"class_name": "LSTM", "config": {"recurrent_constraint": null, "units": 2, "kernel_regularizer": null, "implementation": 0, "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "recurrent_regularizer": null, "name": "lstm_6", "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "unroll": false, "dropout": 0.0, "go_backwards": false, "activation": "tanh", "bias_regularizer": null, "unit_forget_bias": true, "stateful": false, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "mode": "fan_in", "scale": 2.0}}, "use_bias": true, "bias_constraint": null, "return_sequences": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "kernel_regularizer": null, "trainable": true, "activation": "relu", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "mode": "fan_in", "scale": 2.0}}, "use_bias": true, "bias_constraint": null, "name": "dense_1"}}]}