{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"kernel_constraint": null, "use_bias": true, "activation": "tanh", "units": 128, "implementation": 0, "unroll": false, "trainable": true, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "recurrent_activation": "hard_sigmoid", "batch_input_shape": [null, 1, 52], "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true, "recurrent_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "go_backwards": false, "stateful": false, "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}}, "name": "lstm_1", "dropout": 0.0, "bias_constraint": null, "recurrent_dropout": 0.0}}, {"class_name": "Dense", "config": {"activation": "relu", "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}}, "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "kernel_regularizer": null}}], "keras_version": "2.0.2"}