{"config": [{"config": {"unit_forget_bias": true, "units": 2, "stateful": false, "dropout": 0.0, "name": "lstm_1", "go_backwards": false, "kernel_constraint": null, "dtype": "float32", "recurrent_dropout": 0.0, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}, "class_name": "VarianceScaling"}, "recurrent_constraint": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "return_sequences": true, "implementation": 0, "unroll": false, "use_bias": true, "batch_input_shape": [null, 1, 48], "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"unit_forget_bias": true, "units": 2, "stateful": false, "dropout": 0.0, "name": "lstm_2", "go_backwards": false, "implementation": 0, "recurrent_dropout": 0.0, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}, "class_name": "VarianceScaling"}, "recurrent_constraint": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "return_sequences": true, "kernel_constraint": null, "unroll": false, "use_bias": true, "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"unit_forget_bias": true, "units": 2, "stateful": false, "dropout": 0.0, "name": "lstm_3", "go_backwards": false, "implementation": 0, "recurrent_dropout": 0.0, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}, "class_name": "VarianceScaling"}, "recurrent_constraint": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "return_sequences": true, "kernel_constraint": null, "unroll": false, "use_bias": true, "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"unit_forget_bias": true, "units": 2, "stateful": false, "dropout": 0.0, "name": "lstm_4", "go_backwards": false, "implementation": 0, "recurrent_dropout": 0.0, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}, "class_name": "VarianceScaling"}, "recurrent_constraint": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "return_sequences": true, "kernel_constraint": null, "unroll": false, "use_bias": true, "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"unit_forget_bias": true, "units": 2, "stateful": false, "dropout": 0.0, "name": "lstm_5", "go_backwards": false, "implementation": 0, "recurrent_dropout": 0.0, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}, "class_name": "VarianceScaling"}, "recurrent_constraint": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "return_sequences": true, "kernel_constraint": null, "unroll": false, "use_bias": true, "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"unit_forget_bias": true, "units": 2, "stateful": false, "dropout": 0.0, "name": "lstm_6", "go_backwards": false, "implementation": 0, "recurrent_dropout": 0.0, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}, "class_name": "VarianceScaling"}, "recurrent_constraint": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "return_sequences": true, "kernel_constraint": null, "unroll": false, "use_bias": true, "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"activation": "relu", "units": 1, "name": "dense_1", "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.2"}