{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"name": "lstm_1", "units": 16, "go_backwards": false, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "kernel_regularizer": null, "recurrent_constraint": null, "trainable": true, "bias_regularizer": null, "use_bias": true, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "bias_constraint": null, "batch_input_shape": [null, 1, 52], "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "stateful": false, "dropout": 0.0, "return_sequences": true, "implementation": 0, "activation": "tanh", "unroll": false, "kernel_constraint": null, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "LSTM", "config": {"name": "lstm_2", "units": 16, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "kernel_regularizer": null, "recurrent_constraint": null, "trainable": true, "use_bias": true, "recurrent_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "recurrent_dropout": 0.0, "stateful": false, "dropout": 0.0, "return_sequences": true, "implementation": 0, "activation": "tanh", "unroll": false, "kernel_constraint": null, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "LSTM", "config": {"name": "lstm_3", "units": 16, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "kernel_regularizer": null, "recurrent_constraint": null, "trainable": true, "use_bias": true, "recurrent_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "recurrent_dropout": 0.0, "stateful": false, "dropout": 0.0, "return_sequences": true, "implementation": 0, "activation": "tanh", "unroll": false, "kernel_constraint": null, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "LSTM", "config": {"name": "lstm_4", "units": 16, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "kernel_regularizer": null, "recurrent_constraint": null, "trainable": true, "use_bias": true, "recurrent_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "recurrent_dropout": 0.0, "stateful": false, "dropout": 0.0, "return_sequences": true, "implementation": 0, "activation": "tanh", "unroll": false, "kernel_constraint": null, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "LSTM", "config": {"name": "lstm_5", "units": 16, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "kernel_regularizer": null, "recurrent_constraint": null, "trainable": true, "use_bias": true, "recurrent_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "recurrent_dropout": 0.0, "stateful": false, "dropout": 0.0, "return_sequences": true, "implementation": 0, "activation": "tanh", "unroll": false, "kernel_constraint": null, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "LSTM", "config": {"name": "lstm_6", "units": 16, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "kernel_regularizer": null, "recurrent_constraint": null, "trainable": true, "use_bias": true, "recurrent_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "recurrent_dropout": 0.0, "stateful": false, "dropout": 0.0, "return_sequences": true, "implementation": 0, "activation": "tanh", "unroll": false, "kernel_constraint": null, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "LSTM", "config": {"name": "lstm_7", "units": 16, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "kernel_regularizer": null, "recurrent_constraint": null, "trainable": true, "use_bias": true, "recurrent_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "recurrent_dropout": 0.0, "stateful": false, "dropout": 0.0, "return_sequences": true, "implementation": 0, "activation": "tanh", "unroll": false, "kernel_constraint": null, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "Dense", "config": {"name": "dense_1", "bias_constraint": null, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "kernel_regularizer": null, "activation": "relu", "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null}}], "keras_version": "2.0.2", "backend": "tensorflow"}