{"config": [{"config": {"trainable": true, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "stateful": false, "bias_regularizer": null, "kernel_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "name": "lstm_1", "batch_input_shape": [null, 1, 52], "units": 128, "go_backwards": false, "unroll": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unit_forget_bias": true, "return_sequences": true, "dtype": "float32", "activity_regularizer": null, "recurrent_regularizer": null, "kernel_regularizer": null, "implementation": 0, "recurrent_constraint": null, "bias_constraint": null, "use_bias": true, "dropout": 0.0, "recurrent_dropout": 0.0}, "class_name": "LSTM"}, {"config": {"trainable": true, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_1", "kernel_constraint": null, "bias_constraint": null, "units": 1, "use_bias": true}, "class_name": "Dense"}], "keras_version": "2.0.2", "backend": "tensorflow", "class_name": "Sequential"}