{"config": [{"config": {"use_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "implementation": 0, "name": "lstm_1", "go_backwards": false, "activation": "tanh", "recurrent_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "units": 128, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "unroll": false, "return_sequences": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "trainable": true, "recurrent_dropout": 0.0, "unit_forget_bias": true, "kernel_constraint": null, "stateful": false, "batch_input_shape": [null, 1, 52]}, "class_name": "LSTM"}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "name": "dense_1", "units": 1, "activation": "relu", "trainable": true, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}], "keras_version": "2.0.2", "class_name": "Sequential", "backend": "tensorflow"}