{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"trainable": true, "batch_input_shape": [null, 1, 52], "dropout": 0.0, "dtype": "float32", "bias_regularizer": null, "go_backwards": false, "kernel_constraint": null, "activity_regularizer": null, "unit_forget_bias": true, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}}, "kernel_regularizer": null, "return_sequences": true, "name": "lstm_1", "recurrent_dropout": 0.0, "unroll": false, "implementation": 0, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "use_bias": true, "bias_constraint": null, "recurrent_constraint": null}}, {"class_name": "LSTM", "config": {"trainable": true, "dropout": 0.0, "bias_regularizer": null, "go_backwards": false, "kernel_constraint": null, "activity_regularizer": null, "unit_forget_bias": true, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}}, "recurrent_regularizer": null, "return_sequences": true, "name": "lstm_2", "recurrent_dropout": 0.0, "unroll": false, "implementation": 0, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "use_bias": true, "bias_constraint": null, "recurrent_constraint": null}}, {"class_name": "LSTM", "config": {"trainable": true, "dropout": 0.0, "bias_regularizer": null, "go_backwards": false, "kernel_constraint": null, "activity_regularizer": null, "unit_forget_bias": true, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}}, "recurrent_regularizer": null, "return_sequences": true, "name": "lstm_3", "recurrent_dropout": 0.0, "unroll": false, "implementation": 0, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "use_bias": true, "bias_constraint": null, "recurrent_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "bias_regularizer": null, "activation": "relu", "kernel_constraint": null, "activity_regularizer": null, "units": 1, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}}, "kernel_regularizer": null, "use_bias": true}}], "backend": "tensorflow", "keras_version": "2.0.2"}