{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"trainable": true, "unroll": false, "dtype": "float32", "name": "lstm_1", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "use_bias": true, "go_backwards": false, "batch_input_shape": [null, 1, 52], "units": 128, "recurrent_constraint": null, "return_sequences": true, "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "activation": "tanh", "recurrent_regularizer": null, "recurrent_dropout": 0.0, "bias_regularizer": null, "implementation": 0, "kernel_constraint": null, "stateful": false, "bias_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "Dense", "config": {"trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "activation": "relu", "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "units": 1}}], "keras_version": "2.0.2"}