{"config": [{"config": {"recurrent_activation": "hard_sigmoid", "stateful": false, "batch_input_shape": [null, 1, 52], "recurrent_dropout": 0.0, "kernel_regularizer": null, "name": "lstm_1", "activity_regularizer": null, "implementation": 0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_regularizer": null, "trainable": true, "unroll": false, "activation": "tanh", "dropout": 0.0, "unit_forget_bias": true, "return_sequences": true, "use_bias": true, "units": 128, "bias_constraint": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_constraint": null, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "go_backwards": false, "recurrent_regularizer": null, "kernel_constraint": null}, "class_name": "LSTM"}, {"config": {"recurrent_activation": "hard_sigmoid", "stateful": false, "recurrent_dropout": 0.0, "kernel_regularizer": null, "name": "lstm_2", "activity_regularizer": null, "implementation": 0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_regularizer": null, "trainable": true, "unroll": false, "dropout": 0.0, "use_bias": true, "return_sequences": true, "activation": "tanh", "units": 32, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_constraint": null, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "go_backwards": false, "unit_forget_bias": true, "recurrent_regularizer": null, "kernel_constraint": null}, "class_name": "LSTM"}, {"config": {"recurrent_activation": "hard_sigmoid", "stateful": false, "recurrent_dropout": 0.0, "kernel_regularizer": null, "name": "lstm_3", "activity_regularizer": null, "implementation": 0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_regularizer": null, "trainable": true, "unroll": false, "dropout": 0.0, "use_bias": true, "return_sequences": true, "activation": "tanh", "units": 2, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_constraint": null, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "go_backwards": false, "unit_forget_bias": true, "recurrent_regularizer": null, "kernel_constraint": null}, "class_name": "LSTM"}, {"config": {"use_bias": true, "activation": "relu", "kernel_regularizer": null, "units": 1, "name": "dense_1", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.2", "backend": "tensorflow"}