{"config": [{"class_name": "LSTM", "config": {"stateful": false, "activation": "tanh", "go_backwards": false, "trainable": true, "batch_input_shape": [null, 1, 48], "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "use_bias": true, "recurrent_activation": "hard_sigmoid", "unroll": false, "units": 2, "recurrent_constraint": null, "name": "lstm_1", "dtype": "float32", "bias_constraint": null, "unit_forget_bias": true, "kernel_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "implementation": 0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}}}, {"class_name": "LSTM", "config": {"activation": "tanh", "go_backwards": false, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "stateful": false, "recurrent_activation": "hard_sigmoid", "unroll": false, "units": 8, "recurrent_constraint": null, "name": "lstm_2", "use_bias": true, "bias_constraint": null, "unit_forget_bias": true, "kernel_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "implementation": 0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}}}, {"class_name": "LSTM", "config": {"activation": "tanh", "go_backwards": false, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "stateful": false, "recurrent_activation": "hard_sigmoid", "unroll": false, "units": 32, "recurrent_constraint": null, "name": "lstm_3", "use_bias": true, "bias_constraint": null, "unit_forget_bias": true, "kernel_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "implementation": 0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}}}, {"class_name": "LSTM", "config": {"activation": "tanh", "go_backwards": false, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "stateful": false, "recurrent_activation": "hard_sigmoid", "unroll": false, "units": 32, "recurrent_constraint": null, "name": "lstm_4", "use_bias": true, "bias_constraint": null, "unit_forget_bias": true, "kernel_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "implementation": 0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}}}, {"class_name": "LSTM", "config": {"activation": "tanh", "go_backwards": false, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "stateful": false, "recurrent_activation": "hard_sigmoid", "unroll": false, "units": 8, "recurrent_constraint": null, "name": "lstm_5", "use_bias": true, "bias_constraint": null, "unit_forget_bias": true, "kernel_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "implementation": 0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}}}, {"class_name": "LSTM", "config": {"activation": "tanh", "go_backwards": false, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "stateful": false, "recurrent_activation": "hard_sigmoid", "unroll": false, "units": 2, "recurrent_constraint": null, "name": "lstm_6", "use_bias": true, "bias_constraint": null, "unit_forget_bias": true, "kernel_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "implementation": 0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}}}, {"class_name": "Dense", "config": {"name": "dense_1", "activation": "relu", "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "use_bias": true, "units": 1}}], "class_name": "Sequential", "keras_version": "2.0.2", "backend": "tensorflow"}