{"keras_version": "2.0.2", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"dropout": 0.0, "bias_regularizer": null, "recurrent_dropout": 0.0, "unroll": false, "use_bias": true, "dtype": "float32", "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "activity_regularizer": null, "go_backwards": false, "units": 64, "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 1, 48], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "name": "lstm_1", "bias_constraint": null, "trainable": true, "recurrent_constraint": null, "unit_forget_bias": true, "implementation": 0, "kernel_constraint": null, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "activation": "tanh", "recurrent_regularizer": null}}, {"class_name": "LSTM", "config": {"dropout": 0.0, "bias_regularizer": null, "recurrent_dropout": 0.0, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "use_bias": true, "go_backwards": false, "units": 8, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 0, "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "name": "lstm_2", "bias_constraint": null, "trainable": true, "recurrent_constraint": null, "unit_forget_bias": true, "kernel_constraint": null, "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "activation": "tanh", "recurrent_regularizer": null}}, {"class_name": "LSTM", "config": {"dropout": 0.0, "bias_regularizer": null, "recurrent_dropout": 0.0, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "use_bias": true, "go_backwards": false, "units": 2, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 0, "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "name": "lstm_3", "bias_constraint": null, "trainable": true, "recurrent_constraint": null, "unit_forget_bias": true, "kernel_constraint": null, "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "activation": "tanh", "recurrent_regularizer": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "name": "dense_1", "units": 1, "trainable": true, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "backend": "tensorflow"}