{"class_name": "Sequential", "keras_version": "2.0.2", "config": [{"class_name": "LSTM", "config": {"recurrent_constraint": null, "activation": "tanh", "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "unroll": false, "go_backwards": false, "dtype": "float32", "recurrent_regularizer": null, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "recurrent_dropout": 0.0, "stateful": false, "batch_input_shape": [null, 1, 48], "implementation": 0, "kernel_constraint": null, "units": 128, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "name": "lstm_1", "dropout": 0.0, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "seed": null, "mode": "fan_in"}}}}, {"class_name": "LSTM", "config": {"recurrent_constraint": null, "activation": "tanh", "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "unroll": false, "go_backwards": false, "recurrent_regularizer": null, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "recurrent_dropout": 0.0, "stateful": false, "implementation": 0, "kernel_constraint": null, "units": 2, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "name": "lstm_2", "dropout": 0.0, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "seed": null, "mode": "fan_in"}}}}, {"class_name": "LSTM", "config": {"recurrent_constraint": null, "activation": "tanh", "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "unroll": false, "go_backwards": false, "recurrent_regularizer": null, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "recurrent_dropout": 0.0, "stateful": false, "implementation": 0, "kernel_constraint": null, "units": 128, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "name": "lstm_3", "dropout": 0.0, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "seed": null, "mode": "fan_in"}}}}, {"class_name": "LSTM", "config": {"recurrent_constraint": null, "activation": "tanh", "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "unroll": false, "go_backwards": false, "recurrent_regularizer": null, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "recurrent_dropout": 0.0, "stateful": false, "implementation": 0, "kernel_constraint": null, "units": 64, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "name": "lstm_4", "dropout": 0.0, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "seed": null, "mode": "fan_in"}}}}, {"class_name": "LSTM", "config": {"recurrent_constraint": null, "activation": "tanh", "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "unroll": false, "go_backwards": false, "recurrent_regularizer": null, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "recurrent_dropout": 0.0, "stateful": false, "implementation": 0, "kernel_constraint": null, "units": 16, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "name": "lstm_5", "dropout": 0.0, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "seed": null, "mode": "fan_in"}}}}, {"class_name": "Dense", "config": {"use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "units": 1, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "name": "dense_1", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "seed": null, "mode": "fan_in"}}}}], "backend": "tensorflow"}