{"config": [{"config": {"implementation": 0, "batch_input_shape": [null, 1, 52], "name": "lstm_1", "trainable": true, "units": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "recurrent_constraint": null, "bias_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_constraint": null, "kernel_constraint": null, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "dtype": "float32", "activity_regularizer": null, "stateful": false, "return_sequences": true, "kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "dropout": 0.0, "unit_forget_bias": true, "unroll": false, "go_backwards": false, "kernel_regularizer": null}, "class_name": "LSTM"}, {"config": {"kernel_constraint": null, "use_bias": true, "activation": "relu", "name": "dense_1", "units": 1, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.0.2", "class_name": "Sequential"}