{"config": [{"config": {"go_backwards": false, "units": 8, "dtype": "float32", "name": "lstm_1", "implementation": 0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "stateful": false, "batch_input_shape": [null, 1, 48], "trainable": true, "activity_regularizer": null, "unroll": false, "kernel_regularizer": null, "kernel_constraint": null, "activation": "tanh", "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "mode": "fan_in", "scale": 2.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "recurrent_constraint": null, "unit_forget_bias": true, "recurrent_dropout": 0.0, "return_sequences": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "use_bias": true, "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"go_backwards": false, "units": 8, "name": "lstm_2", "implementation": 0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "stateful": false, "trainable": true, "activity_regularizer": null, "unroll": false, "kernel_regularizer": null, "kernel_constraint": null, "activation": "tanh", "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "mode": "fan_in", "scale": 2.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "recurrent_constraint": null, "unit_forget_bias": true, "recurrent_dropout": 0.0, "return_sequences": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "use_bias": true, "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"go_backwards": false, "units": 8, "name": "lstm_3", "implementation": 0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "stateful": false, "trainable": true, "activity_regularizer": null, "unroll": false, "kernel_regularizer": null, "kernel_constraint": null, "activation": "tanh", "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "mode": "fan_in", "scale": 2.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "recurrent_constraint": null, "unit_forget_bias": true, "recurrent_dropout": 0.0, "return_sequences": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "use_bias": true, "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"go_backwards": false, "units": 8, "name": "lstm_4", "implementation": 0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "stateful": false, "trainable": true, "activity_regularizer": null, "unroll": false, "kernel_regularizer": null, "kernel_constraint": null, "activation": "tanh", "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "mode": "fan_in", "scale": 2.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "recurrent_constraint": null, "unit_forget_bias": true, "recurrent_dropout": 0.0, "return_sequences": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "use_bias": true, "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"go_backwards": false, "units": 8, "name": "lstm_5", "implementation": 0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "stateful": false, "trainable": true, "activity_regularizer": null, "unroll": false, "kernel_regularizer": null, "kernel_constraint": null, "activation": "tanh", "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "mode": "fan_in", "scale": 2.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "recurrent_constraint": null, "unit_forget_bias": true, "recurrent_dropout": 0.0, "return_sequences": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "use_bias": true, "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"go_backwards": false, "units": 8, "name": "lstm_6", "implementation": 0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "stateful": false, "trainable": true, "activity_regularizer": null, "unroll": false, "kernel_regularizer": null, "kernel_constraint": null, "activation": "tanh", "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "mode": "fan_in", "scale": 2.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "recurrent_constraint": null, "unit_forget_bias": true, "recurrent_dropout": 0.0, "return_sequences": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "use_bias": true, "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"trainable": true, "units": 1, "name": "dense_1", "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "mode": "fan_in", "scale": 2.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": true}, "class_name": "Dense"}], "keras_version": "2.0.2", "class_name": "Sequential", "backend": "tensorflow"}