{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.2", "config": [{"class_name": "LSTM", "config": {"activation": "tanh", "bias_regularizer": null, "recurrent_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "recurrent_dropout": 0.0, "unroll": false, "implementation": 0, "units": 2, "trainable": true, "bias_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "name": "lstm_1", "dtype": "float32", "return_sequences": true, "kernel_constraint": null, "dropout": 0.0, "batch_input_shape": [null, 1, 48], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "kernel_regularizer": null, "go_backwards": false, "unit_forget_bias": true, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "LSTM", "config": {"activation": "tanh", "bias_regularizer": null, "recurrent_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "recurrent_dropout": 0.0, "unroll": false, "implementation": 0, "units": 4, "trainable": true, "bias_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "name": "lstm_2", "return_sequences": true, "kernel_constraint": null, "dropout": 0.0, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "kernel_regularizer": null, "go_backwards": false, "unit_forget_bias": true, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "LSTM", "config": {"activation": "tanh", "bias_regularizer": null, "recurrent_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "recurrent_dropout": 0.0, "unroll": false, "implementation": 0, "units": 8, "trainable": true, "bias_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "name": "lstm_3", "return_sequences": true, "kernel_constraint": null, "dropout": 0.0, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "kernel_regularizer": null, "go_backwards": false, "unit_forget_bias": true, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "LSTM", "config": {"activation": "tanh", "bias_regularizer": null, "recurrent_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "recurrent_dropout": 0.0, "unroll": false, "implementation": 0, "units": 16, "trainable": true, "bias_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "name": "lstm_4", "return_sequences": true, "kernel_constraint": null, "dropout": 0.0, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "kernel_regularizer": null, "go_backwards": false, "unit_forget_bias": true, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "LSTM", "config": {"activation": "tanh", "bias_regularizer": null, "recurrent_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "recurrent_dropout": 0.0, "unroll": false, "implementation": 0, "units": 8, "trainable": true, "bias_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "name": "lstm_5", "return_sequences": true, "kernel_constraint": null, "dropout": 0.0, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "kernel_regularizer": null, "go_backwards": false, "unit_forget_bias": true, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "LSTM", "config": {"activation": "tanh", "bias_regularizer": null, "recurrent_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "recurrent_dropout": 0.0, "unroll": false, "implementation": 0, "units": 4, "trainable": true, "bias_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "name": "lstm_6", "return_sequences": true, "kernel_constraint": null, "dropout": 0.0, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "kernel_regularizer": null, "go_backwards": false, "unit_forget_bias": true, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "LSTM", "config": {"activation": "tanh", "bias_regularizer": null, "recurrent_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "recurrent_dropout": 0.0, "unroll": false, "implementation": 0, "units": 2, "trainable": true, "bias_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "name": "lstm_7", "return_sequences": true, "kernel_constraint": null, "dropout": 0.0, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "kernel_regularizer": null, "go_backwards": false, "unit_forget_bias": true, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "Dense", "config": {"activation": "relu", "name": "dense_1", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "units": 1, "trainable": true, "bias_constraint": null}}]}