{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.2", "config": [{"class_name": "LSTM", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null, "recurrent_regularizer": null, "use_bias": true, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "recurrent_dropout": 0.0, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "uniform"}}, "unit_forget_bias": true, "go_backwards": false, "activation": "tanh", "kernel_constraint": null, "return_sequences": true, "stateful": false, "name": "lstm_1", "unroll": false, "bias_regularizer": null, "batch_input_shape": [null, 1, 48], "implementation": 0, "dropout": 0.0, "dtype": "float32", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2}}, {"class_name": "LSTM", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null, "recurrent_regularizer": null, "use_bias": true, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "uniform"}}, "units": 8, "go_backwards": false, "activation": "tanh", "kernel_constraint": null, "return_sequences": true, "stateful": false, "name": "lstm_2", "unroll": false, "bias_regularizer": null, "kernel_regularizer": null, "implementation": 0, "dropout": 0.0, "unit_forget_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LSTM", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null, "recurrent_regularizer": null, "use_bias": true, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "uniform"}}, "units": 16, "go_backwards": false, "activation": "tanh", "kernel_constraint": null, "return_sequences": true, "stateful": false, "name": "lstm_3", "unroll": false, "bias_regularizer": null, "kernel_regularizer": null, "implementation": 0, "dropout": 0.0, "unit_forget_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LSTM", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null, "recurrent_regularizer": null, "use_bias": true, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "uniform"}}, "units": 128, "go_backwards": false, "activation": "tanh", "kernel_constraint": null, "return_sequences": true, "stateful": false, "name": "lstm_4", "unroll": false, "bias_regularizer": null, "kernel_regularizer": null, "implementation": 0, "dropout": 0.0, "unit_forget_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LSTM", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null, "recurrent_regularizer": null, "use_bias": true, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "uniform"}}, "units": 16, "go_backwards": false, "activation": "tanh", "kernel_constraint": null, "return_sequences": true, "stateful": false, "name": "lstm_5", "unroll": false, "bias_regularizer": null, "kernel_regularizer": null, "implementation": 0, "dropout": 0.0, "unit_forget_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LSTM", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null, "recurrent_regularizer": null, "use_bias": true, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "uniform"}}, "units": 8, "go_backwards": false, "activation": "tanh", "kernel_constraint": null, "return_sequences": true, "stateful": false, "name": "lstm_6", "unroll": false, "bias_regularizer": null, "kernel_regularizer": null, "implementation": 0, "dropout": 0.0, "unit_forget_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LSTM", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null, "recurrent_regularizer": null, "use_bias": true, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "uniform"}}, "units": 2, "go_backwards": false, "activation": "tanh", "kernel_constraint": null, "return_sequences": true, "stateful": false, "name": "lstm_7", "unroll": false, "bias_regularizer": null, "kernel_regularizer": null, "implementation": 0, "dropout": 0.0, "unit_forget_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activation": "relu", "name": "dense_1", "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "uniform"}}, "units": 1, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}]}