{"backend": "tensorflow", "config": [{"config": {"trainable": true, "dropout": 0.0, "stateful": false, "return_sequences": true, "bias_constraint": null, "activity_regularizer": null, "dtype": "float32", "unit_forget_bias": true, "recurrent_constraint": null, "recurrent_regularizer": null, "use_bias": true, "kernel_regularizer": null, "name": "lstm_1", "implementation": 0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.0, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 1, 48], "bias_regularizer": null, "go_backwards": false, "kernel_constraint": null, "activation": "tanh", "units": 64, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unroll": false}, "class_name": "LSTM"}, {"config": {"trainable": true, "dropout": 0.0, "stateful": false, "return_sequences": true, "bias_constraint": null, "activity_regularizer": null, "unit_forget_bias": true, "recurrent_constraint": null, "recurrent_regularizer": null, "use_bias": true, "kernel_regularizer": null, "name": "lstm_2", "implementation": 0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.0, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "go_backwards": false, "kernel_constraint": null, "activation": "tanh", "units": 32, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unroll": false}, "class_name": "LSTM"}, {"config": {"trainable": true, "dropout": 0.0, "stateful": false, "return_sequences": true, "bias_constraint": null, "activity_regularizer": null, "unit_forget_bias": true, "recurrent_constraint": null, "recurrent_regularizer": null, "use_bias": true, "kernel_regularizer": null, "name": "lstm_3", "implementation": 0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.0, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "go_backwards": false, "kernel_constraint": null, "activation": "tanh", "units": 2, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unroll": false}, "class_name": "LSTM"}, {"config": {"use_bias": true, "trainable": true, "name": "dense_1", "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.2"}