{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"bias_regularizer": null, "kernel_constraint": null, "units": 128, "unit_forget_bias": true, "activation": "tanh", "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_regularizer": null, "dropout": 0.0, "kernel_regularizer": null, "name": "lstm_2", "recurrent_dropout": 0.0, "recurrent_constraint": null, "stateful": false, "unroll": false, "activity_regularizer": null, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "dtype": "float32", "batch_input_shape": [null, 1, 52], "return_sequences": true, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "implementation": 0}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "units": 1, "kernel_regularizer": null, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}}}], "keras_version": "2.0.2"}