{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "name": "lstm_1", "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "activity_regularizer": null, "use_bias": true, "return_sequences": true, "bias_constraint": null, "activation": "tanh", "recurrent_constraint": null, "units": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false, "bias_regularizer": null, "unroll": false, "implementation": 0, "unit_forget_bias": true, "batch_input_shape": [null, 1, 52], "dtype": "float32", "dropout": 0.0, "kernel_regularizer": null, "recurrent_dropout": 0.0, "trainable": true, "kernel_constraint": null, "recurrent_regularizer": null}}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "name": "lstm_2", "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "activity_regularizer": null, "use_bias": true, "return_sequences": true, "bias_constraint": null, "activation": "tanh", "recurrent_constraint": null, "units": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false, "bias_regularizer": null, "unroll": false, "implementation": 0, "unit_forget_bias": true, "dropout": 0.0, "kernel_regularizer": null, "recurrent_dropout": 0.0, "trainable": true, "kernel_constraint": null, "recurrent_regularizer": null}}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "name": "lstm_3", "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "activity_regularizer": null, "use_bias": true, "return_sequences": true, "bias_constraint": null, "activation": "tanh", "recurrent_constraint": null, "units": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false, "bias_regularizer": null, "unroll": false, "implementation": 0, "unit_forget_bias": true, "dropout": 0.0, "kernel_regularizer": null, "recurrent_dropout": 0.0, "trainable": true, "kernel_constraint": null, "recurrent_regularizer": null}}, {"class_name": "Dense", "config": {"units": 1, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_constraint": null, "activation": "relu"}}], "backend": "tensorflow", "keras_version": "2.0.2"}