{"keras_version": "2.0.2", "config": [{"config": {"unroll": false, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "batch_input_shape": [null, 1, 48], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 64, "unit_forget_bias": true, "recurrent_regularizer": null, "activity_regularizer": null, "activation": "tanh", "kernel_constraint": null, "implementation": 0, "recurrent_dropout": 0.0, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "distribution": "normal", "scale": 2.0, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "return_sequences": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "trainable": true, "dropout": 0.0, "name": "lstm_1", "stateful": false, "recurrent_constraint": null, "bias_regularizer": null, "use_bias": true, "dtype": "float32"}, "class_name": "LSTM"}, {"config": {"unroll": false, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 8, "unit_forget_bias": true, "recurrent_regularizer": null, "activity_regularizer": null, "implementation": 0, "kernel_constraint": null, "name": "lstm_2", "recurrent_dropout": 0.0, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "distribution": "normal", "scale": 2.0, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "return_sequences": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "trainable": true, "dropout": 0.0, "stateful": false, "activation": "tanh", "recurrent_constraint": null, "bias_regularizer": null, "use_bias": true}, "class_name": "LSTM"}, {"config": {"unroll": false, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 2, "unit_forget_bias": true, "recurrent_regularizer": null, "activity_regularizer": null, "implementation": 0, "kernel_constraint": null, "name": "lstm_3", "recurrent_dropout": 0.0, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "distribution": "normal", "scale": 2.0, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "return_sequences": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "trainable": true, "dropout": 0.0, "stateful": false, "activation": "tanh", "recurrent_constraint": null, "bias_regularizer": null, "use_bias": true}, "class_name": "LSTM"}, {"config": {"bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "distribution": "normal", "scale": 2.0, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1, "activation": "relu", "bias_regularizer": null, "kernel_constraint": null, "name": "dense_1", "use_bias": true}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow"}