{"keras_version": "2.0.2", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"return_sequences": true, "stateful": false, "bias_constraint": null, "activity_regularizer": null, "batch_input_shape": [null, 1, 48], "recurrent_constraint": null, "name": "lstm_1", "unroll": false, "unit_forget_bias": true, "activation": "tanh", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dropout": 0.0, "bias_regularizer": null, "go_backwards": false, "dtype": "float32", "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "implementation": 0, "trainable": true, "units": 64, "use_bias": true, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "seed": null, "mode": "fan_in"}}, "recurrent_regularizer": null}}, {"class_name": "LSTM", "config": {"return_sequences": true, "bias_constraint": null, "activity_regularizer": null, "stateful": false, "recurrent_constraint": null, "unroll": false, "name": "lstm_2", "activation": "tanh", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dropout": 0.0, "bias_regularizer": null, "go_backwards": false, "unit_forget_bias": true, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "implementation": 0, "trainable": true, "units": 8, "use_bias": true, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "seed": null, "mode": "fan_in"}}, "recurrent_regularizer": null}}, {"class_name": "LSTM", "config": {"return_sequences": true, "bias_constraint": null, "activity_regularizer": null, "stateful": false, "recurrent_constraint": null, "unroll": false, "name": "lstm_3", "activation": "tanh", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dropout": 0.0, "bias_regularizer": null, "go_backwards": false, "unit_forget_bias": true, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "implementation": 0, "trainable": true, "units": 2, "use_bias": true, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "seed": null, "mode": "fan_in"}}, "recurrent_regularizer": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "activation": "relu", "units": 1, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "seed": null, "mode": "fan_in"}}}}], "backend": "tensorflow"}