{"config": [{"config": {"stateful": false, "bias_regularizer": null, "go_backwards": false, "implementation": 0, "recurrent_regularizer": null, "bias_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_constraint": null, "units": 8, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dropout": 0.0, "recurrent_dropout": 0.0, "return_sequences": true, "batch_input_shape": [null, 1, 48], "use_bias": true, "name": "lstm_1", "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "dtype": "float32", "trainable": true, "unroll": false, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}, "class_name": "VarianceScaling"}, "activation": "tanh", "activity_regularizer": null}, "class_name": "LSTM"}, {"config": {"stateful": false, "go_backwards": false, "bias_regularizer": null, "implementation": 0, "recurrent_regularizer": null, "bias_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_constraint": null, "units": 8, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dropout": 0.0, "recurrent_dropout": 0.0, "return_sequences": true, "use_bias": true, "name": "lstm_2", "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "trainable": true, "unroll": false, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}, "class_name": "VarianceScaling"}, "activation": "tanh", "activity_regularizer": null}, "class_name": "LSTM"}, {"config": {"stateful": false, "go_backwards": false, "bias_regularizer": null, "implementation": 0, "recurrent_regularizer": null, "bias_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_constraint": null, "units": 8, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dropout": 0.0, "recurrent_dropout": 0.0, "return_sequences": true, "use_bias": true, "name": "lstm_3", "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "trainable": true, "unroll": false, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}, "class_name": "VarianceScaling"}, "activation": "tanh", "activity_regularizer": null}, "class_name": "LSTM"}, {"config": {"stateful": false, "go_backwards": false, "bias_regularizer": null, "implementation": 0, "recurrent_regularizer": null, "bias_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_constraint": null, "units": 8, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dropout": 0.0, "recurrent_dropout": 0.0, "return_sequences": true, "use_bias": true, "name": "lstm_4", "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "trainable": true, "unroll": false, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}, "class_name": "VarianceScaling"}, "activation": "tanh", "activity_regularizer": null}, "class_name": "LSTM"}, {"config": {"stateful": false, "go_backwards": false, "bias_regularizer": null, "implementation": 0, "recurrent_regularizer": null, "bias_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_constraint": null, "units": 8, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dropout": 0.0, "recurrent_dropout": 0.0, "return_sequences": true, "use_bias": true, "name": "lstm_5", "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "trainable": true, "unroll": false, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}, "class_name": "VarianceScaling"}, "activation": "tanh", "activity_regularizer": null}, "class_name": "LSTM"}, {"config": {"stateful": false, "go_backwards": false, "bias_regularizer": null, "implementation": 0, "recurrent_regularizer": null, "bias_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_constraint": null, "units": 8, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dropout": 0.0, "recurrent_dropout": 0.0, "return_sequences": true, "use_bias": true, "name": "lstm_6", "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "trainable": true, "unroll": false, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}, "class_name": "VarianceScaling"}, "activation": "tanh", "activity_regularizer": null}, "class_name": "LSTM"}, {"config": {"use_bias": true, "trainable": true, "name": "dense_1", "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null, "units": 1, "kernel_initializer": {"config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}, "class_name": "VarianceScaling"}, "activation": "relu", "activity_regularizer": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.2"}