{"backend": "tensorflow", "config": [{"config": {"unroll": false, "kernel_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dtype": "float32", "recurrent_activation": "hard_sigmoid", "batch_input_shape": [null, 1, 48], "trainable": true, "dropout": 0.0, "recurrent_dropout": 0.0, "activation": "tanh", "units": 64, "stateful": false, "use_bias": true, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "return_sequences": true, "activity_regularizer": null, "bias_constraint": null, "implementation": 0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "recurrent_regularizer": null, "bias_regularizer": null, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_constraint": null, "name": "lstm_1"}, "class_name": "LSTM"}, {"config": {"unroll": false, "kernel_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_activation": "hard_sigmoid", "trainable": true, "dropout": 0.0, "recurrent_dropout": 0.0, "activation": "tanh", "units": 16, "stateful": false, "use_bias": true, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "return_sequences": true, "activity_regularizer": null, "bias_constraint": null, "implementation": 0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "recurrent_regularizer": null, "bias_regularizer": null, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_constraint": null, "name": "lstm_2"}, "class_name": "LSTM"}, {"config": {"unroll": false, "kernel_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_activation": "hard_sigmoid", "trainable": true, "dropout": 0.0, "recurrent_dropout": 0.0, "activation": "tanh", "units": 2, "stateful": false, "use_bias": true, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "return_sequences": true, "activity_regularizer": null, "bias_constraint": null, "implementation": 0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "recurrent_regularizer": null, "bias_regularizer": null, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_constraint": null, "name": "lstm_3"}, "class_name": "LSTM"}, {"config": {"kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "units": 1}, "class_name": "Dense"}], "keras_version": "2.0.2", "class_name": "Sequential"}