{"keras_version": "2.0.2", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"dropout": 0.0, "stateful": false, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "recurrent_constraint": null, "kernel_constraint": null, "units": 64, "recurrent_dropout": 0.0, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_1", "unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "implementation": 0, "unroll": false, "return_sequences": true, "recurrent_regularizer": null, "activity_regularizer": null, "dtype": "float32", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}}, "batch_input_shape": [null, 1, 48], "use_bias": true, "bias_regularizer": null, "bias_constraint": null}}, {"class_name": "LSTM", "config": {"dropout": 0.0, "stateful": false, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "recurrent_constraint": null, "kernel_constraint": null, "units": 8, "recurrent_dropout": 0.0, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 0, "unit_forget_bias": true, "use_bias": true, "name": "lstm_2", "unroll": false, "return_sequences": true, "recurrent_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_regularizer": null, "bias_constraint": null}}, {"class_name": "LSTM", "config": {"dropout": 0.0, "stateful": false, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "recurrent_constraint": null, "kernel_constraint": null, "units": 2, "recurrent_dropout": 0.0, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 0, "unit_forget_bias": true, "use_bias": true, "name": "lstm_3", "unroll": false, "return_sequences": true, "recurrent_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_regularizer": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}}, "units": 1, "kernel_constraint": null, "use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}]}