{"backend": "tensorflow", "keras_version": "2.0.2", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"dropout": 0.0, "activation": "tanh", "activity_regularizer": null, "bias_regularizer": null, "stateful": false, "implementation": 0, "recurrent_dropout": 0.0, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false, "units": 2, "unit_forget_bias": true, "bias_constraint": null, "recurrent_constraint": null, "trainable": true, "recurrent_regularizer": null, "name": "lstm_1", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_constraint": null, "return_sequences": true, "batch_input_shape": [null, 1, 48], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}}, "dtype": "float32", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_regularizer": null}}, {"class_name": "LSTM", "config": {"dropout": 0.0, "activation": "tanh", "activity_regularizer": null, "bias_regularizer": null, "stateful": false, "implementation": 0, "recurrent_dropout": 0.0, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false, "kernel_regularizer": null, "units": 8, "unit_forget_bias": true, "bias_constraint": null, "recurrent_constraint": null, "trainable": true, "recurrent_regularizer": null, "name": "lstm_2", "recurrent_activation": "hard_sigmoid", "use_bias": true, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}}, "kernel_constraint": null}}, {"class_name": "LSTM", "config": {"dropout": 0.0, "activation": "tanh", "activity_regularizer": null, "bias_regularizer": null, "stateful": false, "implementation": 0, "recurrent_dropout": 0.0, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false, "kernel_regularizer": null, "units": 32, "unit_forget_bias": true, "bias_constraint": null, "recurrent_constraint": null, "trainable": true, "recurrent_regularizer": null, "name": "lstm_3", "recurrent_activation": "hard_sigmoid", "use_bias": true, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}}, "kernel_constraint": null}}, {"class_name": "LSTM", "config": {"dropout": 0.0, "activation": "tanh", "activity_regularizer": null, "bias_regularizer": null, "stateful": false, "implementation": 0, "recurrent_dropout": 0.0, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false, "kernel_regularizer": null, "units": 32, "unit_forget_bias": true, "bias_constraint": null, "recurrent_constraint": null, "trainable": true, "recurrent_regularizer": null, "name": "lstm_4", "recurrent_activation": "hard_sigmoid", "use_bias": true, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}}, "kernel_constraint": null}}, {"class_name": "LSTM", "config": {"dropout": 0.0, "activation": "tanh", "activity_regularizer": null, "bias_regularizer": null, "stateful": false, "implementation": 0, "recurrent_dropout": 0.0, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false, "kernel_regularizer": null, "units": 8, "unit_forget_bias": true, "bias_constraint": null, "recurrent_constraint": null, "trainable": true, "recurrent_regularizer": null, "name": "lstm_5", "recurrent_activation": "hard_sigmoid", "use_bias": true, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}}, "kernel_constraint": null}}, {"class_name": "LSTM", "config": {"dropout": 0.0, "activation": "tanh", "activity_regularizer": null, "bias_regularizer": null, "stateful": false, "implementation": 0, "recurrent_dropout": 0.0, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false, "kernel_regularizer": null, "units": 2, "unit_forget_bias": true, "bias_constraint": null, "recurrent_constraint": null, "trainable": true, "recurrent_regularizer": null, "name": "lstm_6", "recurrent_activation": "hard_sigmoid", "use_bias": true, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}}, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"trainable": true, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_1", "activation": "relu", "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "kernel_regularizer": null, "bias_constraint": null}}]}