{"class_name": "Sequential", "keras_version": "2.0.2", "config": [{"class_name": "LSTM", "config": {"use_bias": true, "dtype": "float32", "recurrent_activation": "hard_sigmoid", "stateful": false, "trainable": true, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "unit_forget_bias": true, "dropout": 0.0, "bias_regularizer": null, "implementation": 0, "name": "lstm_1", "units": 128, "return_sequences": true, "go_backwards": false, "activation": "tanh", "recurrent_dropout": 0.0, "recurrent_constraint": null, "bias_constraint": null, "batch_input_shape": [null, 1, 48], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_constraint": null}}, {"class_name": "LSTM", "config": {"use_bias": true, "recurrent_activation": "hard_sigmoid", "stateful": false, "trainable": true, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "unit_forget_bias": true, "dropout": 0.0, "bias_regularizer": null, "implementation": 0, "name": "lstm_2", "units": 2, "return_sequences": true, "go_backwards": false, "activation": "tanh", "recurrent_dropout": 0.0, "recurrent_constraint": null, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_constraint": null}}, {"class_name": "LSTM", "config": {"use_bias": true, "recurrent_activation": "hard_sigmoid", "stateful": false, "trainable": true, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "unit_forget_bias": true, "dropout": 0.0, "bias_regularizer": null, "implementation": 0, "name": "lstm_3", "units": 128, "return_sequences": true, "go_backwards": false, "activation": "tanh", "recurrent_dropout": 0.0, "recurrent_constraint": null, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_constraint": null}}, {"class_name": "LSTM", "config": {"use_bias": true, "recurrent_activation": "hard_sigmoid", "stateful": false, "trainable": true, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "unit_forget_bias": true, "dropout": 0.0, "bias_regularizer": null, "implementation": 0, "name": "lstm_4", "units": 64, "return_sequences": true, "go_backwards": false, "activation": "tanh", "recurrent_dropout": 0.0, "recurrent_constraint": null, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_constraint": null}}, {"class_name": "LSTM", "config": {"use_bias": true, "recurrent_activation": "hard_sigmoid", "stateful": false, "trainable": true, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "unit_forget_bias": true, "dropout": 0.0, "bias_regularizer": null, "implementation": 0, "name": "lstm_5", "units": 16, "return_sequences": true, "go_backwards": false, "activation": "tanh", "recurrent_dropout": 0.0, "recurrent_constraint": null, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_constraint": null}}, {"class_name": "LSTM", "config": {"use_bias": true, "recurrent_activation": "hard_sigmoid", "stateful": false, "trainable": true, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "unit_forget_bias": true, "dropout": 0.0, "bias_regularizer": null, "implementation": 0, "name": "lstm_6", "units": 2, "return_sequences": true, "go_backwards": false, "activation": "tanh", "recurrent_dropout": 0.0, "recurrent_constraint": null, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"use_bias": true, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_1", "units": 1, "kernel_constraint": null}}], "backend": "tensorflow"}