{"backend": "tensorflow", "config": [{"config": {"activity_regularizer": null, "kernel_constraint": null, "recurrent_regularizer": null, "return_sequences": true, "recurrent_dropout": 0.0, "dtype": "float32", "units": 64, "go_backwards": false, "unroll": false, "trainable": true, "bias_constraint": null, "unit_forget_bias": true, "stateful": false, "kernel_regularizer": null, "batch_input_shape": [null, 1, 48], "name": "lstm_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dropout": 0.0, "recurrent_constraint": null, "activation": "tanh", "use_bias": true, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_initializer": {"config": {"seed": null, "distribution": "normal", "scale": 2.0, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "implementation": 0}, "class_name": "LSTM"}, {"config": {"activity_regularizer": null, "kernel_constraint": null, "recurrent_regularizer": null, "go_backwards": false, "recurrent_dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 8, "return_sequences": true, "activation": "tanh", "unroll": false, "trainable": true, "bias_constraint": null, "unit_forget_bias": true, "stateful": false, "kernel_regularizer": null, "name": "lstm_2", "dropout": 0.0, "recurrent_constraint": null, "use_bias": true, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_initializer": {"config": {"seed": null, "distribution": "normal", "scale": 2.0, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "implementation": 0}, "class_name": "LSTM"}, {"config": {"kernel_regularizer": null, "name": "dense_1", "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "normal", "scale": 2.0, "mode": "fan_in"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "keras_version": "2.0.2", "class_name": "Sequential"}