{"config": [{"class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "unroll": false, "recurrent_dropout": 0.0, "batch_input_shape": [null, 1, 48], "name": "lstm_1", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "go_backwards": false, "trainable": true, "units": 64, "use_bias": true, "bias_constraint": null, "unit_forget_bias": true, "stateful": false, "return_sequences": true, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "implementation": 0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_regularizer": null, "dtype": "float32", "recurrent_constraint": null}}, {"class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "unroll": false, "recurrent_dropout": 0.0, "name": "lstm_2", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "go_backwards": false, "trainable": true, "units": 8, "use_bias": true, "bias_constraint": null, "unit_forget_bias": true, "stateful": false, "return_sequences": true, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "implementation": 0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_regularizer": null, "recurrent_constraint": null}}, {"class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "unroll": false, "recurrent_dropout": 0.0, "name": "lstm_3", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "go_backwards": false, "trainable": true, "units": 2, "use_bias": true, "bias_constraint": null, "unit_forget_bias": true, "stateful": false, "return_sequences": true, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "implementation": 0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_regularizer": null, "recurrent_constraint": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "use_bias": true, "units": 1, "name": "dense_1", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "activity_regularizer": null, "trainable": true, "bias_constraint": null}}], "class_name": "Sequential", "keras_version": "2.0.2", "backend": "tensorflow"}