{"class_name": "Sequential", "keras_version": "2.0.2", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"activity_regularizer": null, "kernel_regularizer": null, "recurrent_constraint": null, "trainable": true, "dropout": 0.0, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}}, "bias_constraint": null, "use_bias": true, "go_backwards": false, "kernel_constraint": null, "dtype": "float32", "recurrent_dropout": 0.0, "batch_input_shape": [null, 1, 48], "unit_forget_bias": true, "name": "lstm_1", "implementation": 0, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_sequences": true, "unroll": false, "stateful": false, "recurrent_regularizer": null, "units": 8, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "LSTM", "config": {"activity_regularizer": null, "kernel_regularizer": null, "recurrent_constraint": null, "trainable": true, "dropout": 0.0, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}}, "bias_constraint": null, "use_bias": true, "go_backwards": false, "kernel_constraint": null, "recurrent_regularizer": null, "unit_forget_bias": true, "name": "lstm_2", "implementation": 0, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_sequences": true, "unroll": false, "stateful": false, "recurrent_dropout": 0.0, "units": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "LSTM", "config": {"activity_regularizer": null, "kernel_regularizer": null, "recurrent_constraint": null, "trainable": true, "dropout": 0.0, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}}, "bias_constraint": null, "use_bias": true, "go_backwards": false, "kernel_constraint": null, "recurrent_regularizer": null, "unit_forget_bias": true, "name": "lstm_3", "implementation": 0, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_sequences": true, "unroll": false, "stateful": false, "recurrent_dropout": 0.0, "units": 8, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "Dense", "config": {"name": "dense_1", "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}}, "bias_constraint": null, "use_bias": true, "activation": "relu", "kernel_constraint": null, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}}}]}