{"keras_version": "2.0.2", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "stateful": false, "implementation": 0, "unroll": false, "activity_regularizer": null, "activation": "tanh", "kernel_constraint": null, "recurrent_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "batch_input_shape": [null, 1, 52], "recurrent_constraint": null, "bias_regularizer": null, "use_bias": true, "return_sequences": true, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "units": 128, "name": "lstm_1", "bias_constraint": null, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "dtype": "float32", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "use_bias": true, "units": 1, "activity_regularizer": null, "name": "dense_1", "bias_constraint": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "trainable": true}}], "backend": "tensorflow"}