{"backend": "tensorflow", "keras_version": "2.0.2", "config": [{"config": {"kernel_regularizer": null, "name": "lstm_1", "dropout": 0.0, "trainable": true, "implementation": 0, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "unroll": false, "return_sequences": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_constraint": null, "stateful": false, "recurrent_dropout": 0.0, "activity_regularizer": null, "units": 128, "unit_forget_bias": true, "go_backwards": false, "kernel_constraint": null, "recurrent_constraint": null, "batch_input_shape": [null, 1, 52], "dtype": "float32", "recurrent_regularizer": null, "use_bias": true}, "class_name": "LSTM"}, {"config": {"kernel_regularizer": null, "name": "lstm_2", "return_sequences": true, "trainable": true, "implementation": 0, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "unroll": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "dropout": 0.0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_constraint": null, "stateful": false, "recurrent_dropout": 0.0, "activity_regularizer": null, "units": 32, "unit_forget_bias": true, "go_backwards": false, "kernel_constraint": null, "recurrent_constraint": null, "bias_regularizer": null, "recurrent_regularizer": null, "use_bias": true}, "class_name": "LSTM"}, {"config": {"kernel_regularizer": null, "name": "lstm_3", "return_sequences": true, "trainable": true, "implementation": 0, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "unroll": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "dropout": 0.0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_constraint": null, "stateful": false, "recurrent_dropout": 0.0, "activity_regularizer": null, "units": 64, "unit_forget_bias": true, "go_backwards": false, "kernel_constraint": null, "recurrent_constraint": null, "bias_regularizer": null, "recurrent_regularizer": null, "use_bias": true}, "class_name": "LSTM"}, {"config": {"kernel_regularizer": null, "name": "lstm_4", "return_sequences": true, "trainable": true, "implementation": 0, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "unroll": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "dropout": 0.0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_constraint": null, "stateful": false, "recurrent_dropout": 0.0, "activity_regularizer": null, "units": 2, "unit_forget_bias": true, "go_backwards": false, "kernel_constraint": null, "recurrent_constraint": null, "bias_regularizer": null, "recurrent_regularizer": null, "use_bias": true}, "class_name": "LSTM"}, {"config": {"kernel_regularizer": null, "name": "dense_1", "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "units": 1, "activation": "relu", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}