{"config": [{"config": {"name": "lstm_1", "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "go_backwards": false, "units": 8, "recurrent_activation": "hard_sigmoid", "batch_input_shape": [null, 1, 48], "recurrent_regularizer": null, "dtype": "float32", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dropout": 0.0, "stateful": false, "activation": "tanh", "recurrent_dropout": 0.0, "bias_constraint": null, "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unroll": false, "bias_regularizer": null, "trainable": true, "return_sequences": true, "implementation": 0, "activity_regularizer": null, "recurrent_constraint": null, "kernel_regularizer": null, "use_bias": true}, "class_name": "LSTM"}, {"config": {"name": "lstm_2", "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "go_backwards": false, "units": 128, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dropout": 0.0, "stateful": false, "activation": "tanh", "recurrent_dropout": 0.0, "bias_constraint": null, "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unroll": false, "bias_regularizer": null, "trainable": true, "return_sequences": true, "implementation": 0, "activity_regularizer": null, "recurrent_constraint": null, "kernel_regularizer": null, "use_bias": true}, "class_name": "LSTM"}, {"config": {"name": "lstm_3", "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "go_backwards": false, "units": 8, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dropout": 0.0, "stateful": false, "activation": "tanh", "recurrent_dropout": 0.0, "bias_constraint": null, "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unroll": false, "bias_regularizer": null, "trainable": true, "return_sequences": true, "implementation": 0, "activity_regularizer": null, "recurrent_constraint": null, "kernel_regularizer": null, "use_bias": true}, "class_name": "LSTM"}, {"config": {"activation": "relu", "name": "dense_1", "kernel_constraint": null, "bias_constraint": null, "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.0.2", "class_name": "Sequential"}