{"backend": "tensorflow", "config": [{"config": {"recurrent_activation": "hard_sigmoid", "units": 8, "trainable": true, "recurrent_dropout": 0.0, "kernel_regularizer": null, "batch_input_shape": [null, 1, 48], "unroll": false, "recurrent_constraint": null, "unit_forget_bias": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "dropout": 0.0, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "return_sequences": true, "use_bias": true, "name": "lstm_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "bias_regularizer": null, "dtype": "float32", "go_backwards": false, "activity_regularizer": null, "recurrent_regularizer": null, "implementation": 0, "bias_constraint": null, "stateful": false, "kernel_constraint": null}, "class_name": "LSTM"}, {"config": {"recurrent_activation": "hard_sigmoid", "units": 128, "trainable": true, "recurrent_dropout": 0.0, "kernel_regularizer": null, "unroll": false, "kernel_constraint": null, "unit_forget_bias": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "dropout": 0.0, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "return_sequences": true, "use_bias": true, "name": "lstm_2", "activation": "tanh", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "activity_regularizer": null, "recurrent_constraint": null, "implementation": 0, "bias_constraint": null, "stateful": false, "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"recurrent_activation": "hard_sigmoid", "units": 8, "trainable": true, "recurrent_dropout": 0.0, "kernel_regularizer": null, "unroll": false, "kernel_constraint": null, "unit_forget_bias": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "dropout": 0.0, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "return_sequences": true, "use_bias": true, "name": "lstm_3", "activation": "tanh", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "activity_regularizer": null, "recurrent_constraint": null, "implementation": 0, "bias_constraint": null, "stateful": false, "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"activation": "relu", "units": 1, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "name": "dense_1"}, "class_name": "Dense"}], "keras_version": "2.0.2", "class_name": "Sequential"}