{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "stateful": false, "use_bias": true, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "kernel_constraint": null, "bias_constraint": null, "unit_forget_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "implementation": 0, "recurrent_dropout": 0.0, "name": "lstm_1", "batch_input_shape": [null, 1, 52], "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "units": 2, "recurrent_regularizer": null, "go_backwards": false, "dtype": "float32", "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "stateful": false, "use_bias": true, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "kernel_constraint": null, "bias_constraint": null, "unit_forget_bias": true, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "implementation": 0, "recurrent_dropout": 0.0, "name": "lstm_2", "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "units": 8, "activity_regularizer": null, "go_backwards": false, "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "stateful": false, "use_bias": true, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "kernel_constraint": null, "bias_constraint": null, "unit_forget_bias": true, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "implementation": 0, "recurrent_dropout": 0.0, "name": "lstm_3", "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "units": 16, "activity_regularizer": null, "go_backwards": false, "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "stateful": false, "use_bias": true, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "kernel_constraint": null, "bias_constraint": null, "unit_forget_bias": true, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "implementation": 0, "recurrent_dropout": 0.0, "name": "lstm_4", "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "units": 128, "activity_regularizer": null, "go_backwards": false, "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "stateful": false, "use_bias": true, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "kernel_constraint": null, "bias_constraint": null, "unit_forget_bias": true, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "implementation": 0, "recurrent_dropout": 0.0, "name": "lstm_5", "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "units": 16, "activity_regularizer": null, "go_backwards": false, "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "stateful": false, "use_bias": true, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "kernel_constraint": null, "bias_constraint": null, "unit_forget_bias": true, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "implementation": 0, "recurrent_dropout": 0.0, "name": "lstm_6", "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "units": 8, "activity_regularizer": null, "go_backwards": false, "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "stateful": false, "use_bias": true, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "kernel_constraint": null, "bias_constraint": null, "unit_forget_bias": true, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "implementation": 0, "recurrent_dropout": 0.0, "name": "lstm_7", "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "units": 2, "activity_regularizer": null, "go_backwards": false, "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "activation": "tanh"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": true, "name": "dense_1", "bias_constraint": null, "kernel_constraint": null, "units": 1, "activation": "relu", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}}}], "backend": "tensorflow", "keras_version": "2.0.2"}