{"keras_version": "2.0.2", "backend": "tensorflow", "config": [{"config": {"name": "lstm_1", "kernel_constraint": null, "unroll": false, "activation": "tanh", "recurrent_dropout": 0.0, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "recurrent_constraint": null, "batch_input_shape": [null, 1, 52], "go_backwards": false, "kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "use_bias": true, "dropout": 0.0, "stateful": false, "units": 128, "trainable": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "return_sequences": true, "dtype": "float32", "activity_regularizer": null, "bias_constraint": null, "recurrent_regularizer": null, "implementation": 0}, "class_name": "LSTM"}, {"config": {"name": "lstm_2", "kernel_constraint": null, "unroll": false, "activation": "tanh", "recurrent_dropout": 0.0, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "recurrent_constraint": null, "go_backwards": false, "kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "use_bias": true, "dropout": 0.0, "stateful": false, "units": 64, "trainable": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "return_sequences": true, "activity_regularizer": null, "bias_constraint": null, "recurrent_regularizer": null, "implementation": 0}, "class_name": "LSTM"}, {"config": {"name": "lstm_3", "kernel_constraint": null, "unroll": false, "activation": "tanh", "recurrent_dropout": 0.0, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "recurrent_constraint": null, "go_backwards": false, "kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "use_bias": true, "dropout": 0.0, "stateful": false, "units": 2, "trainable": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "return_sequences": true, "activity_regularizer": null, "bias_constraint": null, "recurrent_regularizer": null, "implementation": 0}, "class_name": "LSTM"}, {"config": {"name": "dense_1", "kernel_constraint": null, "activation": "relu", "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1, "use_bias": true}, "class_name": "Dense"}], "class_name": "Sequential"}