{"backend": "tensorflow", "keras_version": "2.0.2", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"recurrent_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "mode": "fan_in", "scale": 2.0}}, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_constraint": null, "kernel_regularizer": null, "use_bias": true, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "kernel_constraint": null, "stateful": false, "unroll": false, "implementation": 0, "go_backwards": false, "dtype": "float32", "units": 2, "bias_regularizer": null, "return_sequences": true, "dropout": 0.0, "name": "lstm_1", "bias_constraint": null, "batch_input_shape": [null, 1, 48], "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "recurrent_dropout": 0.0}}, {"class_name": "LSTM", "config": {"recurrent_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "mode": "fan_in", "scale": 2.0}}, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_constraint": null, "kernel_regularizer": null, "use_bias": true, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "kernel_constraint": null, "stateful": false, "unroll": false, "implementation": 0, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 8, "bias_regularizer": null, "return_sequences": true, "dropout": 0.0, "name": "lstm_2", "bias_constraint": null, "recurrent_dropout": 0.0, "unit_forget_bias": true}}, {"class_name": "LSTM", "config": {"recurrent_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "mode": "fan_in", "scale": 2.0}}, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_constraint": null, "kernel_regularizer": null, "use_bias": true, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "kernel_constraint": null, "stateful": false, "unroll": false, "implementation": 0, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 32, "bias_regularizer": null, "return_sequences": true, "dropout": 0.0, "name": "lstm_3", "bias_constraint": null, "recurrent_dropout": 0.0, "unit_forget_bias": true}}, {"class_name": "LSTM", "config": {"recurrent_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "mode": "fan_in", "scale": 2.0}}, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_constraint": null, "kernel_regularizer": null, "use_bias": true, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "kernel_constraint": null, "stateful": false, "unroll": false, "implementation": 0, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 32, "bias_regularizer": null, "return_sequences": true, "dropout": 0.0, "name": "lstm_4", "bias_constraint": null, "recurrent_dropout": 0.0, "unit_forget_bias": true}}, {"class_name": "LSTM", "config": {"recurrent_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "mode": "fan_in", "scale": 2.0}}, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_constraint": null, "kernel_regularizer": null, "use_bias": true, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "kernel_constraint": null, "stateful": false, "unroll": false, "implementation": 0, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 8, "bias_regularizer": null, "return_sequences": true, "dropout": 0.0, "name": "lstm_5", "bias_constraint": null, "recurrent_dropout": 0.0, "unit_forget_bias": true}}, {"class_name": "LSTM", "config": {"recurrent_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "mode": "fan_in", "scale": 2.0}}, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_constraint": null, "kernel_regularizer": null, "use_bias": true, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "kernel_constraint": null, "stateful": false, "unroll": false, "implementation": 0, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "bias_regularizer": null, "return_sequences": true, "dropout": 0.0, "name": "lstm_6", "bias_constraint": null, "recurrent_dropout": 0.0, "unit_forget_bias": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "mode": "fan_in", "scale": 2.0}}, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "name": "dense_1", "bias_constraint": null}}]}