{"backend": "tensorflow", "keras_version": "2.0.2", "config": [{"config": {"name": "lstm_1", "recurrent_activation": "hard_sigmoid", "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "implementation": 0, "go_backwards": false, "recurrent_regularizer": null, "unit_forget_bias": true, "units": 128, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_regularizer": null, "dtype": "float32", "recurrent_dropout": 0.0, "batch_input_shape": [null, 1, 52], "stateful": false, "return_sequences": true, "activation": "tanh", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unroll": false, "bias_constraint": null, "dropout": 0.0, "kernel_initializer": {"config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "recurrent_constraint": null}, "class_name": "LSTM"}, {"config": {"name": "lstm_2", "recurrent_activation": "hard_sigmoid", "use_bias": true, "trainable": true, "activity_regularizer": null, "dropout": 0.0, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "implementation": 0, "go_backwards": false, "recurrent_regularizer": null, "unit_forget_bias": true, "units": 64, "bias_regularizer": null, "stateful": false, "return_sequences": true, "activation": "tanh", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unroll": false, "bias_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.0, "kernel_regularizer": null, "recurrent_constraint": null}, "class_name": "LSTM"}, {"config": {"name": "lstm_3", "recurrent_activation": "hard_sigmoid", "use_bias": true, "trainable": true, "activity_regularizer": null, "dropout": 0.0, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "implementation": 0, "go_backwards": false, "recurrent_regularizer": null, "unit_forget_bias": true, "units": 2, "bias_regularizer": null, "stateful": false, "return_sequences": true, "activation": "tanh", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unroll": false, "bias_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.0, "kernel_regularizer": null, "recurrent_constraint": null}, "class_name": "LSTM"}, {"config": {"name": "dense_1", "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "units": 1, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}