{"keras_version": "2.0.2", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"name": "lstm_1", "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "mode": "fan_in", "scale": 2.0}}, "go_backwards": false, "dtype": "float32", "dropout": 0.0, "return_sequences": true, "trainable": true, "stateful": false, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "use_bias": true, "implementation": 0, "unroll": false, "activation": "tanh", "units": 32, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 1, 48], "bias_regularizer": null, "activity_regularizer": null, "unit_forget_bias": true, "recurrent_dropout": 0.0}}, {"class_name": "LSTM", "config": {"name": "lstm_2", "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "mode": "fan_in", "scale": 2.0}}, "go_backwards": false, "unroll": false, "return_sequences": true, "trainable": true, "stateful": false, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "use_bias": true, "implementation": 0, "activation": "tanh", "units": 32, "recurrent_constraint": null, "dropout": 0.0, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "recurrent_dropout": 0.0}}, {"class_name": "LSTM", "config": {"name": "lstm_3", "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "mode": "fan_in", "scale": 2.0}}, "go_backwards": false, "unroll": false, "return_sequences": true, "trainable": true, "stateful": false, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "use_bias": true, "implementation": 0, "activation": "tanh", "units": 32, "recurrent_constraint": null, "dropout": 0.0, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "recurrent_dropout": 0.0}}, {"class_name": "Dense", "config": {"name": "dense_1", "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "activation": "relu", "bias_constraint": null, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "mode": "fan_in", "scale": 2.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "trainable": true}}]}