{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.2", "config": [{"class_name": "LSTM", "config": {"bias_regularizer": null, "name": "lstm_1", "dtype": "float32", "batch_input_shape": [null, 1, 48], "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_dropout": 0.0, "use_bias": true, "unroll": false, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "trainable": true, "recurrent_regularizer": null, "stateful": false, "dropout": 0.0, "implementation": 0, "units": 64, "return_sequences": true, "activity_regularizer": null, "recurrent_constraint": null, "go_backwards": false, "activation": "tanh", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LSTM", "config": {"bias_regularizer": null, "name": "lstm_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_dropout": 0.0, "use_bias": true, "unroll": false, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "unit_forget_bias": true, "activation": "tanh", "recurrent_regularizer": null, "stateful": false, "dropout": 0.0, "implementation": 0, "units": 2, "return_sequences": true, "activity_regularizer": null, "recurrent_constraint": null, "go_backwards": false, "trainable": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LSTM", "config": {"bias_regularizer": null, "name": "lstm_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_dropout": 0.0, "use_bias": true, "unroll": false, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "unit_forget_bias": true, "activation": "tanh", "recurrent_regularizer": null, "stateful": false, "dropout": 0.0, "implementation": 0, "units": 2, "return_sequences": true, "activity_regularizer": null, "recurrent_constraint": null, "go_backwards": false, "trainable": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "activation": "relu", "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "kernel_regularizer": null, "trainable": true, "units": 1, "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}]}