{"backend": "tensorflow", "keras_version": "2.0.2", "config": [{"config": {"recurrent_activation": "hard_sigmoid", "activation": "tanh", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "dtype": "float32", "go_backwards": false, "batch_input_shape": [null, 1, 48], "kernel_regularizer": null, "dropout": 0.0, "unroll": false, "bias_constraint": null, "stateful": false, "recurrent_constraint": null, "kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "trainable": true, "recurrent_dropout": 0.0, "units": 64, "return_sequences": true, "name": "lstm_1", "unit_forget_bias": true, "activity_regularizer": null, "recurrent_regularizer": null, "implementation": 0, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null}, "class_name": "LSTM"}, {"config": {"recurrent_activation": "hard_sigmoid", "use_bias": true, "activation": "tanh", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "units": 8, "go_backwards": false, "implementation": 0, "kernel_regularizer": null, "dropout": 0.0, "unroll": false, "bias_constraint": null, "stateful": false, "recurrent_constraint": null, "kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "trainable": true, "return_sequences": true, "name": "lstm_2", "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "bias_regularizer": null, "kernel_constraint": null}, "class_name": "LSTM"}, {"config": {"recurrent_activation": "hard_sigmoid", "use_bias": true, "activation": "tanh", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "units": 2, "go_backwards": false, "implementation": 0, "kernel_regularizer": null, "dropout": 0.0, "unroll": false, "bias_constraint": null, "stateful": false, "recurrent_constraint": null, "kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "trainable": true, "return_sequences": true, "name": "lstm_3", "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "bias_regularizer": null, "kernel_constraint": null}, "class_name": "LSTM"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "units": 1, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}