{"config": [{"config": {"unit_forget_bias": true, "activity_regularizer": null, "batch_input_shape": [null, 1, 52], "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "dtype": "float32", "stateful": false, "units": 128, "recurrent_regularizer": null, "name": "lstm_1", "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "go_backwards": false, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "implementation": 0, "kernel_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "unroll": false, "trainable": true, "recurrent_constraint": null, "activation": "tanh"}, "class_name": "LSTM"}, {"config": {"activity_regularizer": null, "kernel_constraint": null, "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "trainable": true, "activation": "relu", "bias_constraint": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.2"}