{"config": [{"class_name": "LSTM", "config": {"stateful": false, "trainable": true, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "name": "lstm_1", "unroll": false, "recurrent_constraint": null, "return_sequences": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "kernel_constraint": null, "implementation": 0, "go_backwards": false, "recurrent_regularizer": null, "batch_input_shape": [null, 1, 48], "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_regularizer": null, "use_bias": true, "unit_forget_bias": true, "dropout": 0.0, "bias_constraint": null, "recurrent_dropout": 0.0, "units": 2, "activity_regularizer": null}}, {"class_name": "LSTM", "config": {"stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "name": "lstm_2", "unroll": false, "recurrent_constraint": null, "return_sequences": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "kernel_constraint": null, "implementation": 0, "go_backwards": false, "recurrent_regularizer": null, "trainable": true, "bias_regularizer": null, "use_bias": true, "unit_forget_bias": true, "dropout": 0.0, "bias_constraint": null, "recurrent_dropout": 0.0, "units": 2, "activity_regularizer": null}}, {"class_name": "LSTM", "config": {"stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "name": "lstm_3", "unroll": false, "recurrent_constraint": null, "return_sequences": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "kernel_constraint": null, "implementation": 0, "go_backwards": false, "recurrent_regularizer": null, "trainable": true, "bias_regularizer": null, "use_bias": true, "unit_forget_bias": true, "dropout": 0.0, "bias_constraint": null, "recurrent_dropout": 0.0, "units": 2, "activity_regularizer": null}}, {"class_name": "LSTM", "config": {"stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "name": "lstm_4", "unroll": false, "recurrent_constraint": null, "return_sequences": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "kernel_constraint": null, "implementation": 0, "go_backwards": false, "recurrent_regularizer": null, "trainable": true, "bias_regularizer": null, "use_bias": true, "unit_forget_bias": true, "dropout": 0.0, "bias_constraint": null, "recurrent_dropout": 0.0, "units": 2, "activity_regularizer": null}}, {"class_name": "LSTM", "config": {"stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "name": "lstm_5", "unroll": false, "recurrent_constraint": null, "return_sequences": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "kernel_constraint": null, "implementation": 0, "go_backwards": false, "recurrent_regularizer": null, "trainable": true, "bias_regularizer": null, "use_bias": true, "unit_forget_bias": true, "dropout": 0.0, "bias_constraint": null, "recurrent_dropout": 0.0, "units": 2, "activity_regularizer": null}}, {"class_name": "LSTM", "config": {"stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "name": "lstm_6", "unroll": false, "recurrent_constraint": null, "return_sequences": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "kernel_constraint": null, "implementation": 0, "go_backwards": false, "recurrent_regularizer": null, "trainable": true, "bias_regularizer": null, "use_bias": true, "unit_forget_bias": true, "dropout": 0.0, "bias_constraint": null, "recurrent_dropout": 0.0, "units": 2, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "activation": "relu", "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "units": 1, "activity_regularizer": null}}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.2"}