{"keras_version": "2.0.2", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_regularizer": null, "implementation": 0, "name": "lstm_1", "recurrent_constraint": null, "dropout": 0.0, "unit_forget_bias": true, "units": 8, "activity_regularizer": null, "bias_constraint": null, "stateful": false, "dtype": "float32", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_constraint": null, "recurrent_dropout": 0.0, "return_sequences": true, "bias_regularizer": null, "use_bias": true, "trainable": true, "batch_input_shape": [null, 1, 48], "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "go_backwards": false, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null}}, {"class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_regularizer": null, "implementation": 0, "name": "lstm_2", "recurrent_constraint": null, "dropout": 0.0, "unit_forget_bias": true, "units": 256, "activity_regularizer": null, "bias_constraint": null, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_constraint": null, "recurrent_dropout": 0.0, "return_sequences": true, "bias_regularizer": null, "use_bias": true, "trainable": true, "go_backwards": false, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null}}, {"class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_regularizer": null, "implementation": 0, "name": "lstm_3", "recurrent_constraint": null, "dropout": 0.0, "unit_forget_bias": true, "units": 8, "activity_regularizer": null, "bias_constraint": null, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_constraint": null, "recurrent_dropout": 0.0, "return_sequences": true, "bias_regularizer": null, "use_bias": true, "trainable": true, "go_backwards": false, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "units": 1, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "name": "dense_1", "activation": "relu", "trainable": true, "activity_regularizer": null}}]}