{"keras_version": "2.0.2", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"batch_input_shape": [null, 1, 48], "recurrent_activation": "hard_sigmoid", "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "go_backwards": false, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null, "kernel_regularizer": null, "recurrent_dropout": 0.0, "units": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "dtype": "float32", "activity_regularizer": null, "activation": "tanh", "kernel_constraint": null, "recurrent_regularizer": null, "unroll": false, "dropout": 0.0, "return_sequences": true, "implementation": 0, "name": "lstm_1", "recurrent_constraint": null, "use_bias": true}}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "go_backwards": false, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null, "kernel_regularizer": null, "recurrent_dropout": 0.0, "units": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "activity_regularizer": null, "activation": "tanh", "kernel_constraint": null, "recurrent_regularizer": null, "unroll": false, "dropout": 0.0, "return_sequences": true, "implementation": 0, "name": "lstm_2", "recurrent_constraint": null, "use_bias": true}}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "go_backwards": false, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null, "kernel_regularizer": null, "recurrent_dropout": 0.0, "units": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "activity_regularizer": null, "activation": "tanh", "kernel_constraint": null, "recurrent_regularizer": null, "unroll": false, "dropout": 0.0, "return_sequences": true, "implementation": 0, "name": "lstm_3", "recurrent_constraint": null, "use_bias": true}}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "go_backwards": false, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null, "kernel_regularizer": null, "recurrent_dropout": 0.0, "units": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "activity_regularizer": null, "activation": "tanh", "kernel_constraint": null, "recurrent_regularizer": null, "unroll": false, "dropout": 0.0, "return_sequences": true, "implementation": 0, "name": "lstm_4", "recurrent_constraint": null, "use_bias": true}}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "go_backwards": false, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null, "kernel_regularizer": null, "recurrent_dropout": 0.0, "units": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "activity_regularizer": null, "activation": "tanh", "kernel_constraint": null, "recurrent_regularizer": null, "unroll": false, "dropout": 0.0, "return_sequences": true, "implementation": 0, "name": "lstm_5", "recurrent_constraint": null, "use_bias": true}}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "go_backwards": false, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null, "kernel_regularizer": null, "recurrent_dropout": 0.0, "units": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "activity_regularizer": null, "activation": "tanh", "kernel_constraint": null, "recurrent_regularizer": null, "unroll": false, "dropout": 0.0, "return_sequences": true, "implementation": 0, "name": "lstm_6", "recurrent_constraint": null, "use_bias": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "activation": "relu", "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_1", "bias_constraint": null, "use_bias": true}}], "backend": "tensorflow"}