{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"go_backwards": false, "stateful": false, "unroll": false, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "bias_regularizer": null, "batch_input_shape": [null, 1, 52], "activation": "tanh", "activity_regularizer": null, "trainable": true, "use_bias": true, "bias_constraint": null, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_regularizer": null, "implementation": 0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "recurrent_constraint": null, "recurrent_dropout": 0.0, "kernel_constraint": null, "units": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "return_sequences": true, "kernel_regularizer": null, "name": "lstm_1"}}, {"class_name": "LSTM", "config": {"stateful": false, "unroll": false, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "activation": "tanh", "activity_regularizer": null, "trainable": true, "use_bias": true, "bias_constraint": null, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_regularizer": null, "implementation": 0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "recurrent_dropout": 0.0, "kernel_constraint": null, "units": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "return_sequences": true, "go_backwards": false, "name": "lstm_2"}}, {"class_name": "LSTM", "config": {"stateful": false, "unroll": false, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "activation": "tanh", "activity_regularizer": null, "trainable": true, "use_bias": true, "bias_constraint": null, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_regularizer": null, "implementation": 0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "recurrent_dropout": 0.0, "kernel_constraint": null, "units": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "return_sequences": true, "go_backwards": false, "name": "lstm_3"}}, {"class_name": "LSTM", "config": {"stateful": false, "unroll": false, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "activation": "tanh", "activity_regularizer": null, "trainable": true, "use_bias": true, "bias_constraint": null, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_regularizer": null, "implementation": 0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "recurrent_dropout": 0.0, "kernel_constraint": null, "units": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "return_sequences": true, "go_backwards": false, "name": "lstm_4"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "units": 1, "bias_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "use_bias": true}}], "keras_version": "2.0.2"}