{"config": [{"config": {"recurrent_activation": "hard_sigmoid", "name": "lstm_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_constraint": null, "units": 128, "use_bias": true, "batch_input_shape": [null, 1, 48], "return_sequences": true, "recurrent_dropout": 0.0, "bias_regularizer": null, "kernel_regularizer": null, "dtype": "float32", "activation": "tanh", "bias_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "implementation": 0, "unroll": false, "unit_forget_bias": true, "dropout": 0.0, "recurrent_regularizer": null, "stateful": false, "activity_regularizer": null, "recurrent_constraint": null, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "go_backwards": false}, "class_name": "LSTM"}, {"config": {"recurrent_activation": "hard_sigmoid", "name": "lstm_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "units": 2, "use_bias": true, "return_sequences": true, "recurrent_dropout": 0.0, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "activation": "tanh", "bias_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "implementation": 0, "unroll": false, "unit_forget_bias": true, "dropout": 0.0, "recurrent_regularizer": null, "stateful": false, "activity_regularizer": null, "recurrent_constraint": null, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "go_backwards": false}, "class_name": "LSTM"}, {"config": {"recurrent_activation": "hard_sigmoid", "name": "lstm_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "units": 64, "use_bias": true, "return_sequences": true, "recurrent_dropout": 0.0, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "activation": "tanh", "bias_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "implementation": 0, "unroll": false, "unit_forget_bias": true, "dropout": 0.0, "recurrent_regularizer": null, "stateful": false, "activity_regularizer": null, "recurrent_constraint": null, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "go_backwards": false}, "class_name": "LSTM"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "activation": "relu", "trainable": true, "activity_regularizer": null, "units": 1, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.0.2", "class_name": "Sequential"}