{"config": [{"config": {"trainable": true, "dropout": 0.0, "activity_regularizer": null, "unroll": false, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "normal", "scale": 2.0, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "lstm_1", "stateful": false, "units": 2, "implementation": 0, "activation": "tanh", "batch_input_shape": [null, 1, 48], "bias_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "return_sequences": true, "go_backwards": false, "recurrent_regularizer": null, "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "bias_regularizer": null, "recurrent_constraint": null, "dtype": "float32"}, "class_name": "LSTM"}, {"config": {"trainable": true, "dropout": 0.0, "activity_regularizer": null, "unroll": false, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "normal", "scale": 2.0, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "lstm_2", "stateful": false, "units": 2, "implementation": 0, "activation": "tanh", "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "go_backwards": false, "recurrent_regularizer": null, "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 0.0, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_constraint": null, "bias_regularizer": null, "recurrent_constraint": null}, "class_name": "LSTM"}, {"config": {"trainable": true, "dropout": 0.0, "activity_regularizer": null, "unroll": false, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "normal", "scale": 2.0, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "lstm_3", "stateful": false, "units": 2, "implementation": 0, "activation": "tanh", "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "go_backwards": false, "recurrent_regularizer": null, "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 0.0, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_constraint": null, "bias_regularizer": null, "recurrent_constraint": null}, "class_name": "LSTM"}, {"config": {"trainable": true, "dropout": 0.0, "activity_regularizer": null, "unroll": false, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "normal", "scale": 2.0, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "lstm_4", "stateful": false, "units": 2, "implementation": 0, "activation": "tanh", "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "go_backwards": false, "recurrent_regularizer": null, "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 0.0, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_constraint": null, "bias_regularizer": null, "recurrent_constraint": null}, "class_name": "LSTM"}, {"config": {"trainable": true, "dropout": 0.0, "activity_regularizer": null, "unroll": false, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "normal", "scale": 2.0, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "lstm_5", "stateful": false, "units": 2, "implementation": 0, "activation": "tanh", "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "go_backwards": false, "recurrent_regularizer": null, "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 0.0, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_constraint": null, "bias_regularizer": null, "recurrent_constraint": null}, "class_name": "LSTM"}, {"config": {"trainable": true, "dropout": 0.0, "activity_regularizer": null, "unroll": false, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "normal", "scale": 2.0, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "lstm_6", "stateful": false, "units": 2, "implementation": 0, "activation": "tanh", "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "go_backwards": false, "recurrent_regularizer": null, "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 0.0, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_constraint": null, "bias_regularizer": null, "recurrent_constraint": null}, "class_name": "LSTM"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "normal", "scale": 2.0, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "dense_1", "units": 1, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "bias_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.2"}