{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.2", "config": [{"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "implementation": 0, "bias_constraint": null, "dropout": 0.0, "units": 8, "kernel_constraint": null, "name": "lstm_1", "recurrent_regularizer": null, "recurrent_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "seed": null, "mode": "fan_in"}}, "trainable": true, "go_backwards": false, "stateful": false, "bias_regularizer": null, "dtype": "float32", "recurrent_dropout": 0.0, "return_sequences": true, "batch_input_shape": [null, 1, 48], "unroll": false, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true}}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "implementation": 0, "bias_constraint": null, "kernel_regularizer": null, "units": 8, "kernel_constraint": null, "recurrent_constraint": null, "recurrent_regularizer": null, "name": "lstm_2", "dropout": 0.0, "trainable": true, "go_backwards": false, "stateful": false, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "seed": null, "mode": "fan_in"}}, "bias_regularizer": null, "activity_regularizer": null, "return_sequences": true, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true}}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "implementation": 0, "bias_constraint": null, "kernel_regularizer": null, "units": 8, "kernel_constraint": null, "recurrent_constraint": null, "recurrent_regularizer": null, "name": "lstm_3", "dropout": 0.0, "trainable": true, "go_backwards": false, "stateful": false, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "seed": null, "mode": "fan_in"}}, "bias_regularizer": null, "activity_regularizer": null, "return_sequences": true, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true}}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "implementation": 0, "bias_constraint": null, "kernel_regularizer": null, "units": 8, "kernel_constraint": null, "recurrent_constraint": null, "recurrent_regularizer": null, "name": "lstm_4", "dropout": 0.0, "trainable": true, "go_backwards": false, "stateful": false, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "seed": null, "mode": "fan_in"}}, "bias_regularizer": null, "activity_regularizer": null, "return_sequences": true, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true}}, {"class_name": "Dense", "config": {"units": 1, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "seed": null, "mode": "fan_in"}}, "kernel_constraint": null, "name": "dense_1", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "trainable": true, "bias_regularizer": null}}]}