{"config": [{"config": {"units": 128, "recurrent_regularizer": null, "return_sequences": true, "recurrent_activation": "hard_sigmoid", "stateful": false, "kernel_regularizer": null, "name": "lstm_1", "unit_forget_bias": true, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "activation": "tanh", "unroll": false, "trainable": true, "implementation": 0, "recurrent_constraint": null, "dtype": "float32", "go_backwards": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "dropout": 0.0, "batch_input_shape": [null, 1, 52], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "recurrent_dropout": 0.0, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null}, "class_name": "LSTM"}, {"config": {"units": 32, "recurrent_regularizer": null, "return_sequences": true, "recurrent_activation": "hard_sigmoid", "stateful": false, "kernel_regularizer": null, "name": "lstm_2", "unit_forget_bias": true, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "activation": "tanh", "unroll": false, "trainable": true, "implementation": 0, "recurrent_constraint": null, "go_backwards": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "recurrent_dropout": 0.0, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null}, "class_name": "LSTM"}, {"config": {"units": 2, "recurrent_regularizer": null, "return_sequences": true, "recurrent_activation": "hard_sigmoid", "stateful": false, "kernel_regularizer": null, "name": "lstm_3", "unit_forget_bias": true, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "activation": "tanh", "unroll": false, "trainable": true, "implementation": 0, "recurrent_constraint": null, "go_backwards": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "recurrent_dropout": 0.0, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null}, "class_name": "LSTM"}, {"config": {"trainable": true, "units": 1, "activation": "relu", "kernel_regularizer": null, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}], "keras_version": "2.0.2", "class_name": "Sequential", "backend": "tensorflow"}