{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "recurrent_constraint": null, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "return_sequences": true, "kernel_constraint": null, "implementation": 0, "recurrent_regularizer": null, "name": "lstm_1", "unroll": false, "batch_input_shape": [null, 1, 52], "kernel_regularizer": null, "trainable": true, "go_backwards": false, "stateful": false, "dropout": 0.0, "units": 128, "unit_forget_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "recurrent_constraint": null, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "return_sequences": true, "kernel_constraint": null, "implementation": 0, "recurrent_regularizer": null, "name": "lstm_2", "unroll": false, "kernel_regularizer": null, "trainable": true, "go_backwards": false, "stateful": false, "dropout": 0.0, "units": 64, "unit_forget_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "recurrent_constraint": null, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "return_sequences": true, "kernel_constraint": null, "implementation": 0, "recurrent_regularizer": null, "name": "lstm_3", "unroll": false, "kernel_regularizer": null, "trainable": true, "go_backwards": false, "stateful": false, "dropout": 0.0, "units": 2, "unit_forget_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "units": 1, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "activation": "relu"}}], "keras_version": "2.0.2"}