{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 1, 48], "recurrent_regularizer": null, "go_backwards": false, "dropout": 0.0, "return_sequences": true, "use_bias": true, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "dtype": "float32", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "name": "lstm_1", "activity_regularizer": null, "activation": "tanh", "trainable": true, "unit_forget_bias": true, "recurrent_constraint": null, "units": 2, "implementation": 0, "unroll": false, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null}}, {"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "recurrent_regularizer": null, "go_backwards": false, "dropout": 0.0, "return_sequences": true, "use_bias": true, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "name": "lstm_2", "activity_regularizer": null, "activation": "tanh", "trainable": true, "unit_forget_bias": true, "recurrent_constraint": null, "implementation": 0, "unroll": false, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null}}, {"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "recurrent_regularizer": null, "go_backwards": false, "dropout": 0.0, "return_sequences": true, "use_bias": true, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "name": "lstm_3", "activity_regularizer": null, "activation": "tanh", "trainable": true, "unit_forget_bias": true, "recurrent_constraint": null, "implementation": 0, "unroll": false, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null}}, {"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "recurrent_regularizer": null, "go_backwards": false, "dropout": 0.0, "return_sequences": true, "use_bias": true, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "name": "lstm_4", "activity_regularizer": null, "activation": "tanh", "trainable": true, "unit_forget_bias": true, "recurrent_constraint": null, "implementation": 0, "unroll": false, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null}}, {"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "recurrent_regularizer": null, "go_backwards": false, "dropout": 0.0, "return_sequences": true, "use_bias": true, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "name": "lstm_5", "activity_regularizer": null, "activation": "tanh", "trainable": true, "unit_forget_bias": true, "recurrent_constraint": null, "implementation": 0, "unroll": false, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null}}, {"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "recurrent_regularizer": null, "go_backwards": false, "dropout": 0.0, "return_sequences": true, "use_bias": true, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "name": "lstm_6", "activity_regularizer": null, "activation": "tanh", "trainable": true, "unit_forget_bias": true, "recurrent_constraint": null, "implementation": 0, "unroll": false, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "activity_regularizer": null, "units": 1, "activation": "relu", "trainable": true, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "bias_regularizer": null, "kernel_regularizer": null}}], "keras_version": "2.0.2", "backend": "tensorflow"}