{"keras_version": "2.0.2", "config": [{"config": {"stateful": false, "name": "lstm_1", "units": 64, "unit_forget_bias": true, "trainable": true, "recurrent_constraint": null, "dropout": 0.0, "bias_constraint": null, "dtype": "float32", "batch_input_shape": [null, 1, 48], "return_sequences": true, "go_backwards": false, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "recurrent_dropout": 0.0, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "bias_regularizer": null, "activation": "tanh", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "implementation": 0, "recurrent_activation": "hard_sigmoid", "unroll": false}, "class_name": "LSTM"}, {"config": {"stateful": false, "name": "lstm_2", "units": 16, "unit_forget_bias": true, "trainable": true, "recurrent_constraint": null, "dropout": 0.0, "bias_constraint": null, "return_sequences": true, "go_backwards": false, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "recurrent_dropout": 0.0, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "bias_regularizer": null, "activation": "tanh", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "implementation": 0, "recurrent_activation": "hard_sigmoid", "unroll": false}, "class_name": "LSTM"}, {"config": {"stateful": false, "name": "lstm_3", "units": 2, "unit_forget_bias": true, "trainable": true, "recurrent_constraint": null, "dropout": 0.0, "bias_constraint": null, "return_sequences": true, "go_backwards": false, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "recurrent_dropout": 0.0, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "bias_regularizer": null, "activation": "tanh", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "implementation": 0, "recurrent_activation": "hard_sigmoid", "unroll": false}, "class_name": "LSTM"}, {"config": {"activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_1", "units": 1, "bias_regularizer": null, "trainable": true, "activation": "relu", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow"}