{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "batch_input_shape": [null, 1, 52], "recurrent_constraint": null, "implementation": 0, "name": "lstm_1", "recurrent_dropout": 0.0, "trainable": true, "recurrent_regularizer": null, "unroll": false, "units": 128, "unit_forget_bias": true, "kernel_regularizer": null, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "stateful": false}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "name": "dense_1", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "activation": "relu", "units": 1}}], "backend": "tensorflow", "keras_version": "2.0.2"}