{"keras_version": "2.0.2", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"kernel_regularizer": null, "units": 128, "implementation": 0, "activity_regularizer": null, "name": "lstm_1", "trainable": true, "kernel_constraint": null, "use_bias": true, "return_sequences": true, "batch_input_shape": [null, 1, 52], "unroll": false, "bias_regularizer": null, "go_backwards": false, "bias_constraint": null, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "dtype": "float32", "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_dropout": 0.0, "dropout": 0.0, "recurrent_constraint": null, "unit_forget_bias": true}}, {"class_name": "LSTM", "config": {"kernel_regularizer": null, "units": 32, "implementation": 0, "activity_regularizer": null, "name": "lstm_2", "trainable": true, "kernel_constraint": null, "use_bias": true, "return_sequences": true, "unroll": false, "bias_regularizer": null, "go_backwards": false, "bias_constraint": null, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_dropout": 0.0, "dropout": 0.0, "recurrent_constraint": null, "unit_forget_bias": true}}, {"class_name": "LSTM", "config": {"kernel_regularizer": null, "units": 2, "implementation": 0, "activity_regularizer": null, "name": "lstm_3", "trainable": true, "kernel_constraint": null, "use_bias": true, "return_sequences": true, "unroll": false, "bias_regularizer": null, "go_backwards": false, "bias_constraint": null, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_dropout": 0.0, "dropout": 0.0, "recurrent_constraint": null, "unit_forget_bias": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "units": 1, "activation": "relu", "kernel_regularizer": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "bias_regularizer": null, "bias_constraint": null}}], "backend": "tensorflow"}