{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"activity_regularizer": null, "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "normal", "scale": 2.0}}, "recurrent_regularizer": null, "unit_forget_bias": true, "kernel_constraint": null, "trainable": true, "bias_constraint": null, "unroll": false, "batch_input_shape": [null, 1, 52], "units": 2, "bias_regularizer": null, "implementation": 0, "name": "lstm_1", "recurrent_activation": "hard_sigmoid", "activation": "tanh", "go_backwards": false, "dtype": "float32", "return_sequences": true, "kernel_regularizer": null, "dropout": 0.0, "recurrent_constraint": null, "use_bias": true, "recurrent_dropout": 0.0}}, {"class_name": "LSTM", "config": {"activity_regularizer": null, "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "normal", "scale": 2.0}}, "recurrent_regularizer": null, "unit_forget_bias": true, "kernel_constraint": null, "trainable": true, "bias_constraint": null, "unroll": false, "units": 8, "bias_regularizer": null, "implementation": 0, "name": "lstm_2", "recurrent_activation": "hard_sigmoid", "activation": "tanh", "go_backwards": false, "return_sequences": true, "kernel_regularizer": null, "dropout": 0.0, "recurrent_constraint": null, "use_bias": true, "recurrent_dropout": 0.0}}, {"class_name": "LSTM", "config": {"activity_regularizer": null, "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "normal", "scale": 2.0}}, "recurrent_regularizer": null, "unit_forget_bias": true, "kernel_constraint": null, "trainable": true, "bias_constraint": null, "unroll": false, "units": 16, "bias_regularizer": null, "implementation": 0, "name": "lstm_3", "recurrent_activation": "hard_sigmoid", "activation": "tanh", "go_backwards": false, "return_sequences": true, "kernel_regularizer": null, "dropout": 0.0, "recurrent_constraint": null, "use_bias": true, "recurrent_dropout": 0.0}}, {"class_name": "LSTM", "config": {"activity_regularizer": null, "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "normal", "scale": 2.0}}, "recurrent_regularizer": null, "unit_forget_bias": true, "kernel_constraint": null, "trainable": true, "bias_constraint": null, "unroll": false, "units": 32, "bias_regularizer": null, "implementation": 0, "name": "lstm_4", "recurrent_activation": "hard_sigmoid", "activation": "tanh", "go_backwards": false, "return_sequences": true, "kernel_regularizer": null, "dropout": 0.0, "recurrent_constraint": null, "use_bias": true, "recurrent_dropout": 0.0}}, {"class_name": "LSTM", "config": {"activity_regularizer": null, "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "normal", "scale": 2.0}}, "recurrent_regularizer": null, "unit_forget_bias": true, "kernel_constraint": null, "trainable": true, "bias_constraint": null, "unroll": false, "units": 128, "bias_regularizer": null, "implementation": 0, "name": "lstm_5", "recurrent_activation": "hard_sigmoid", "activation": "tanh", "go_backwards": false, "return_sequences": true, "kernel_regularizer": null, "dropout": 0.0, "recurrent_constraint": null, "use_bias": true, "recurrent_dropout": 0.0}}, {"class_name": "LSTM", "config": {"activity_regularizer": null, "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "normal", "scale": 2.0}}, "recurrent_regularizer": null, "unit_forget_bias": true, "kernel_constraint": null, "trainable": true, "bias_constraint": null, "unroll": false, "units": 32, "bias_regularizer": null, "implementation": 0, "name": "lstm_6", "recurrent_activation": "hard_sigmoid", "activation": "tanh", "go_backwards": false, "return_sequences": true, "kernel_regularizer": null, "dropout": 0.0, "recurrent_constraint": null, "use_bias": true, "recurrent_dropout": 0.0}}, {"class_name": "LSTM", "config": {"activity_regularizer": null, "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "normal", "scale": 2.0}}, "recurrent_regularizer": null, "unit_forget_bias": true, "kernel_constraint": null, "trainable": true, "bias_constraint": null, "unroll": false, "units": 16, "bias_regularizer": null, "implementation": 0, "name": "lstm_7", "recurrent_activation": "hard_sigmoid", "activation": "tanh", "go_backwards": false, "return_sequences": true, "kernel_regularizer": null, "dropout": 0.0, "recurrent_constraint": null, "use_bias": true, "recurrent_dropout": 0.0}}, {"class_name": "LSTM", "config": {"activity_regularizer": null, "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "normal", "scale": 2.0}}, "recurrent_regularizer": null, "unit_forget_bias": true, "kernel_constraint": null, "trainable": true, "bias_constraint": null, "unroll": false, "units": 8, "bias_regularizer": null, "implementation": 0, "name": "lstm_8", "recurrent_activation": "hard_sigmoid", "activation": "tanh", "go_backwards": false, "return_sequences": true, "kernel_regularizer": null, "dropout": 0.0, "recurrent_constraint": null, "use_bias": true, "recurrent_dropout": 0.0}}, {"class_name": "LSTM", "config": {"activity_regularizer": null, "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "normal", "scale": 2.0}}, "recurrent_regularizer": null, "unit_forget_bias": true, "kernel_constraint": null, "trainable": true, "bias_constraint": null, "unroll": false, "units": 2, "bias_regularizer": null, "implementation": 0, "name": "lstm_9", "recurrent_activation": "hard_sigmoid", "activation": "tanh", "go_backwards": false, "return_sequences": true, "kernel_regularizer": null, "dropout": 0.0, "recurrent_constraint": null, "use_bias": true, "recurrent_dropout": 0.0}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "activity_regularizer": null, "name": "dense_1", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "normal", "scale": 2.0}}, "use_bias": true, "units": 1}}], "backend": "tensorflow", "keras_version": "2.0.2"}