{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "dropout": 0.0, "implementation": 0, "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "recurrent_activation": "hard_sigmoid", "name": "lstm_1", "dtype": "float32", "bias_constraint": null, "recurrent_dropout": 0.0, "unroll": false, "activation": "tanh", "unit_forget_bias": true, "return_sequences": true, "activity_regularizer": null, "trainable": true, "recurrent_regularizer": null, "batch_input_shape": [null, 1, 48], "kernel_regularizer": null, "stateful": false, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null}}, {"class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "dropout": 0.0, "implementation": 0, "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 8, "recurrent_activation": "hard_sigmoid", "name": "lstm_2", "kernel_regularizer": null, "bias_constraint": null, "recurrent_dropout": 0.0, "recurrent_constraint": null, "activation": "tanh", "unit_forget_bias": true, "activity_regularizer": null, "trainable": true, "recurrent_regularizer": null, "return_sequences": true, "stateful": false, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null}}, {"class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "dropout": 0.0, "implementation": 0, "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "recurrent_activation": "hard_sigmoid", "name": "lstm_3", "kernel_regularizer": null, "bias_constraint": null, "recurrent_dropout": 0.0, "recurrent_constraint": null, "activation": "tanh", "unit_forget_bias": true, "activity_regularizer": null, "trainable": true, "recurrent_regularizer": null, "return_sequences": true, "stateful": false, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "units": 1, "name": "dense_1", "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null}}], "backend": "tensorflow", "keras_version": "2.0.2"}