{"config": [{"config": {"recurrent_dropout": 0.0, "batch_input_shape": [null, 1, 48], "bias_constraint": null, "activity_regularizer": null, "activation": "tanh", "unroll": false, "recurrent_constraint": null, "return_sequences": true, "name": "lstm_1", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "distribution": "normal", "scale": 2.0}, "class_name": "VarianceScaling"}, "unit_forget_bias": true, "stateful": false, "kernel_regularizer": null, "recurrent_regularizer": null, "units": 2, "trainable": true, "implementation": 0, "bias_regularizer": null, "go_backwards": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dropout": 0.0, "use_bias": true, "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM"}, {"config": {"recurrent_dropout": 0.0, "unroll": false, "bias_constraint": null, "activity_regularizer": null, "activation": "tanh", "kernel_constraint": null, "recurrent_constraint": null, "return_sequences": true, "name": "lstm_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "distribution": "normal", "scale": 2.0}, "class_name": "VarianceScaling"}, "unit_forget_bias": true, "stateful": false, "kernel_regularizer": null, "recurrent_regularizer": null, "units": 8, "trainable": true, "implementation": 0, "bias_regularizer": null, "go_backwards": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dropout": 0.0, "use_bias": true, "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM"}, {"config": {"recurrent_dropout": 0.0, "unroll": false, "bias_constraint": null, "activity_regularizer": null, "activation": "tanh", "kernel_constraint": null, "recurrent_constraint": null, "return_sequences": true, "name": "lstm_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "distribution": "normal", "scale": 2.0}, "class_name": "VarianceScaling"}, "unit_forget_bias": true, "stateful": false, "kernel_regularizer": null, "recurrent_regularizer": null, "units": 32, "trainable": true, "implementation": 0, "bias_regularizer": null, "go_backwards": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dropout": 0.0, "use_bias": true, "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM"}, {"config": {"recurrent_dropout": 0.0, "unroll": false, "bias_constraint": null, "activity_regularizer": null, "activation": "tanh", "kernel_constraint": null, "recurrent_constraint": null, "return_sequences": true, "name": "lstm_4", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "distribution": "normal", "scale": 2.0}, "class_name": "VarianceScaling"}, "unit_forget_bias": true, "stateful": false, "kernel_regularizer": null, "recurrent_regularizer": null, "units": 32, "trainable": true, "implementation": 0, "bias_regularizer": null, "go_backwards": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dropout": 0.0, "use_bias": true, "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM"}, {"config": {"recurrent_dropout": 0.0, "unroll": false, "bias_constraint": null, "activity_regularizer": null, "activation": "tanh", "kernel_constraint": null, "recurrent_constraint": null, "return_sequences": true, "name": "lstm_5", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "distribution": "normal", "scale": 2.0}, "class_name": "VarianceScaling"}, "unit_forget_bias": true, "stateful": false, "kernel_regularizer": null, "recurrent_regularizer": null, "units": 8, "trainable": true, "implementation": 0, "bias_regularizer": null, "go_backwards": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dropout": 0.0, "use_bias": true, "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM"}, {"config": {"recurrent_dropout": 0.0, "unroll": false, "bias_constraint": null, "activity_regularizer": null, "activation": "tanh", "kernel_constraint": null, "recurrent_constraint": null, "return_sequences": true, "name": "lstm_6", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "distribution": "normal", "scale": 2.0}, "class_name": "VarianceScaling"}, "unit_forget_bias": true, "stateful": false, "kernel_regularizer": null, "recurrent_regularizer": null, "units": 2, "trainable": true, "implementation": 0, "bias_regularizer": null, "go_backwards": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dropout": 0.0, "use_bias": true, "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM"}, {"config": {"bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "activation": "relu", "use_bias": true, "units": 1, "bias_regularizer": null, "name": "dense_1", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "distribution": "normal", "scale": 2.0}, "class_name": "VarianceScaling"}, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.2", "backend": "tensorflow"}