{"class_name": "Sequential", "keras_version": "2.0.2", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"activity_regularizer": null, "recurrent_regularizer": null, "unit_forget_bias": true, "activation": "tanh", "recurrent_constraint": null, "unroll": false, "name": "lstm_1", "units": 8, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "stateful": false, "batch_input_shape": [null, 1, 48], "dtype": "float32", "bias_constraint": null, "recurrent_dropout": 0.0, "bias_regularizer": null, "go_backwards": false, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "trainable": true, "dropout": 0.0, "implementation": 0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "return_sequences": true, "kernel_regularizer": null}}, {"class_name": "LSTM", "config": {"activity_regularizer": null, "recurrent_regularizer": null, "unit_forget_bias": true, "activation": "tanh", "recurrent_constraint": null, "unroll": false, "name": "lstm_2", "units": 8, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "stateful": false, "bias_regularizer": null, "recurrent_dropout": 0.0, "bias_constraint": null, "go_backwards": false, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "trainable": true, "dropout": 0.0, "implementation": 0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "return_sequences": true, "kernel_regularizer": null}}, {"class_name": "LSTM", "config": {"activity_regularizer": null, "recurrent_regularizer": null, "unit_forget_bias": true, "activation": "tanh", "recurrent_constraint": null, "unroll": false, "name": "lstm_3", "units": 8, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "stateful": false, "bias_regularizer": null, "recurrent_dropout": 0.0, "bias_constraint": null, "go_backwards": false, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "trainable": true, "dropout": 0.0, "implementation": 0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "return_sequences": true, "kernel_regularizer": null}}, {"class_name": "LSTM", "config": {"activity_regularizer": null, "recurrent_regularizer": null, "unit_forget_bias": true, "activation": "tanh", "recurrent_constraint": null, "unroll": false, "name": "lstm_4", "units": 8, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "stateful": false, "bias_regularizer": null, "recurrent_dropout": 0.0, "bias_constraint": null, "go_backwards": false, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "trainable": true, "dropout": 0.0, "implementation": 0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "return_sequences": true, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias_constraint": null, "activation": "relu", "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "name": "dense_1", "kernel_regularizer": null}}]}