{"config": [{"class_name": "LSTM", "config": {"batch_input_shape": [null, 1, 48], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_1", "bias_regularizer": null, "go_backwards": false, "return_sequences": true, "dropout": 0.0, "kernel_regularizer": null, "dtype": "float32", "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "activity_regularizer": null, "units": 2, "kernel_constraint": null, "unroll": false, "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "normal"}}, "activation": "tanh", "recurrent_constraint": null, "stateful": false, "implementation": 0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "trainable": true, "use_bias": true}}, {"class_name": "LSTM", "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_2", "bias_regularizer": null, "go_backwards": false, "return_sequences": true, "dropout": 0.0, "kernel_regularizer": null, "implementation": 0, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "activity_regularizer": null, "units": 8, "kernel_constraint": null, "unroll": false, "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "normal"}}, "activation": "tanh", "recurrent_constraint": null, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "trainable": true, "use_bias": true}}, {"class_name": "LSTM", "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_3", "bias_regularizer": null, "go_backwards": false, "return_sequences": true, "dropout": 0.0, "kernel_regularizer": null, "implementation": 0, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "activity_regularizer": null, "units": 16, "kernel_constraint": null, "unroll": false, "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "normal"}}, "activation": "tanh", "recurrent_constraint": null, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "trainable": true, "use_bias": true}}, {"class_name": "LSTM", "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_4", "bias_regularizer": null, "go_backwards": false, "return_sequences": true, "dropout": 0.0, "kernel_regularizer": null, "implementation": 0, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "activity_regularizer": null, "units": 128, "kernel_constraint": null, "unroll": false, "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "normal"}}, "activation": "tanh", "recurrent_constraint": null, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "trainable": true, "use_bias": true}}, {"class_name": "LSTM", "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_5", "bias_regularizer": null, "go_backwards": false, "return_sequences": true, "dropout": 0.0, "kernel_regularizer": null, "implementation": 0, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "activity_regularizer": null, "units": 16, "kernel_constraint": null, "unroll": false, "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "normal"}}, "activation": "tanh", "recurrent_constraint": null, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "trainable": true, "use_bias": true}}, {"class_name": "LSTM", "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_6", "bias_regularizer": null, "go_backwards": false, "return_sequences": true, "dropout": 0.0, "kernel_regularizer": null, "implementation": 0, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "activity_regularizer": null, "units": 8, "kernel_constraint": null, "unroll": false, "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "normal"}}, "activation": "tanh", "recurrent_constraint": null, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "trainable": true, "use_bias": true}}, {"class_name": "LSTM", "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_7", "bias_regularizer": null, "go_backwards": false, "return_sequences": true, "dropout": 0.0, "kernel_regularizer": null, "implementation": 0, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "activity_regularizer": null, "units": 2, "kernel_constraint": null, "unroll": false, "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "normal"}}, "activation": "tanh", "recurrent_constraint": null, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "trainable": true, "use_bias": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "normal"}}, "trainable": true, "units": 1}}], "class_name": "Sequential", "keras_version": "2.0.2", "backend": "tensorflow"}