{"class_name": "Sequential", "keras_version": "2.0.2", "config": [{"class_name": "LSTM", "config": {"dtype": "float32", "go_backwards": false, "dropout": 0.0, "kernel_constraint": null, "stateful": false, "batch_input_shape": [null, 1, 48], "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}}, "name": "lstm_1", "return_sequences": true, "implementation": 0, "recurrent_dropout": 0.0, "activation": "tanh", "use_bias": true, "units": 8, "activity_regularizer": null, "kernel_regularizer": null, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "recurrent_regularizer": null, "bias_constraint": null}}, {"class_name": "LSTM", "config": {"name": "lstm_2", "go_backwards": false, "dropout": 0.0, "kernel_constraint": null, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": true, "implementation": 0, "recurrent_dropout": 0.0, "activation": "tanh", "use_bias": true, "units": 4, "activity_regularizer": null, "kernel_regularizer": null, "unroll": false, "trainable": true, "recurrent_regularizer": null, "bias_constraint": null}}, {"class_name": "LSTM", "config": {"name": "lstm_3", "go_backwards": false, "dropout": 0.0, "kernel_constraint": null, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": true, "implementation": 0, "recurrent_dropout": 0.0, "activation": "tanh", "use_bias": true, "units": 2, "activity_regularizer": null, "kernel_regularizer": null, "unroll": false, "trainable": true, "recurrent_regularizer": null, "bias_constraint": null}}, {"class_name": "LSTM", "config": {"name": "lstm_4", "go_backwards": false, "dropout": 0.0, "kernel_constraint": null, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": true, "implementation": 0, "recurrent_dropout": 0.0, "activation": "tanh", "use_bias": true, "units": 8, "activity_regularizer": null, "kernel_regularizer": null, "unroll": false, "trainable": true, "recurrent_regularizer": null, "bias_constraint": null}}, {"class_name": "LSTM", "config": {"name": "lstm_5", "go_backwards": false, "dropout": 0.0, "kernel_constraint": null, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": true, "implementation": 0, "recurrent_dropout": 0.0, "activation": "tanh", "use_bias": true, "units": 4, "activity_regularizer": null, "kernel_regularizer": null, "unroll": false, "trainable": true, "recurrent_regularizer": null, "bias_constraint": null}}, {"class_name": "LSTM", "config": {"name": "lstm_6", "go_backwards": false, "dropout": 0.0, "kernel_constraint": null, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": true, "implementation": 0, "recurrent_dropout": 0.0, "activation": "tanh", "use_bias": true, "units": 2, "activity_regularizer": null, "kernel_regularizer": null, "unroll": false, "trainable": true, "recurrent_regularizer": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "relu", "use_bias": true, "units": 1, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}}}}], "backend": "tensorflow"}