{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "unroll": false, "units": 2, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "implementation": 0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "dtype": "float32", "return_sequences": true, "dropout": 0.0, "recurrent_constraint": null, "kernel_constraint": null, "batch_input_shape": [null, 1, 48], "activation": "tanh", "go_backwards": false, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_1", "trainable": true, "stateful": false, "recurrent_regularizer": null}}, {"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "unroll": false, "units": 2, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "implementation": 0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "return_sequences": true, "dropout": 0.0, "recurrent_constraint": null, "kernel_constraint": null, "activation": "tanh", "go_backwards": false, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_2", "trainable": true, "stateful": false, "recurrent_regularizer": null}}, {"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "unroll": false, "units": 2, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "implementation": 0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "return_sequences": true, "dropout": 0.0, "recurrent_constraint": null, "kernel_constraint": null, "activation": "tanh", "go_backwards": false, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_3", "trainable": true, "stateful": false, "recurrent_regularizer": null}}, {"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "unroll": false, "units": 2, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "implementation": 0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "return_sequences": true, "dropout": 0.0, "recurrent_constraint": null, "kernel_constraint": null, "activation": "tanh", "go_backwards": false, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_4", "trainable": true, "stateful": false, "recurrent_regularizer": null}}, {"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "unroll": false, "units": 2, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "implementation": 0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "return_sequences": true, "dropout": 0.0, "recurrent_constraint": null, "kernel_constraint": null, "activation": "tanh", "go_backwards": false, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_5", "trainable": true, "stateful": false, "recurrent_regularizer": null}}, {"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "unroll": false, "units": 2, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "implementation": 0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "return_sequences": true, "dropout": 0.0, "recurrent_constraint": null, "kernel_constraint": null, "activation": "tanh", "go_backwards": false, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_6", "trainable": true, "stateful": false, "recurrent_regularizer": null}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "activation": "relu", "units": 1, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "trainable": true}}], "backend": "tensorflow", "keras_version": "2.0.2"}