{"config": [{"config": {"recurrent_constraint": null, "kernel_constraint": null, "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "units": 4, "activation": "tanh", "stateful": false, "use_bias": true, "recurrent_dropout": 0.0, "unit_forget_bias": true, "bias_regularizer": null, "implementation": 0, "trainable": true, "activity_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "name": "lstm_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_sequences": true, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "unroll": false, "recurrent_regularizer": null, "batch_input_shape": [null, 1, 52], "go_backwards": false}, "class_name": "LSTM"}, {"config": {"recurrent_constraint": null, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "units": 4, "activation": "tanh", "stateful": false, "use_bias": true, "recurrent_dropout": 0.0, "unit_forget_bias": true, "bias_regularizer": null, "implementation": 0, "trainable": true, "activity_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "name": "lstm_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_sequences": true, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "unroll": false, "recurrent_regularizer": null, "go_backwards": false}, "class_name": "LSTM"}, {"config": {"recurrent_constraint": null, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "units": 4, "activation": "tanh", "stateful": false, "use_bias": true, "recurrent_dropout": 0.0, "unit_forget_bias": true, "bias_regularizer": null, "implementation": 0, "trainable": true, "activity_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "name": "lstm_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_sequences": true, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "unroll": false, "recurrent_regularizer": null, "go_backwards": false}, "class_name": "LSTM"}, {"config": {"recurrent_constraint": null, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "units": 4, "activation": "tanh", "stateful": false, "use_bias": true, "recurrent_dropout": 0.0, "unit_forget_bias": true, "bias_regularizer": null, "implementation": 0, "trainable": true, "activity_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "name": "lstm_4", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_sequences": true, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "unroll": false, "recurrent_regularizer": null, "go_backwards": false}, "class_name": "LSTM"}, {"config": {"recurrent_constraint": null, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "units": 4, "activation": "tanh", "stateful": false, "use_bias": true, "recurrent_dropout": 0.0, "unit_forget_bias": true, "bias_regularizer": null, "implementation": 0, "trainable": true, "activity_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "name": "lstm_5", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_sequences": true, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "unroll": false, "recurrent_regularizer": null, "go_backwards": false}, "class_name": "LSTM"}, {"config": {"bias_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "name": "dense_1", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1, "use_bias": true}, "class_name": "Dense"}], "keras_version": "2.0.2", "class_name": "Sequential", "backend": "tensorflow"}