{"keras_version": "2.0.2", "config": [{"config": {"name": "lstm_1", "kernel_constraint": null, "units": 4, "unit_forget_bias": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "unroll": false, "bias_regularizer": null, "stateful": true, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "implementation": 0, "batch_input_shape": [1, 1, 52], "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "return_sequences": true, "recurrent_regularizer": null, "trainable": true, "recurrent_dropout": 0.0, "go_backwards": false, "kernel_regularizer": null, "dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "bias_constraint": null, "activation": "tanh"}, "class_name": "LSTM"}, {"config": {"name": "lstm_2", "kernel_constraint": null, "trainable": true, "unit_forget_bias": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "unroll": false, "bias_regularizer": null, "stateful": true, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "implementation": 0, "units": 4, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "return_sequences": true, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "go_backwards": false, "kernel_regularizer": null, "dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "tanh"}, "class_name": "LSTM"}, {"config": {"name": "lstm_3", "kernel_constraint": null, "trainable": true, "unit_forget_bias": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "unroll": false, "bias_regularizer": null, "stateful": true, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "implementation": 0, "units": 4, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "return_sequences": true, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "go_backwards": false, "kernel_regularizer": null, "dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "tanh"}, "class_name": "LSTM"}, {"config": {"name": "lstm_4", "kernel_constraint": null, "trainable": true, "unit_forget_bias": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "unroll": false, "bias_regularizer": null, "stateful": true, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "implementation": 0, "units": 4, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "return_sequences": true, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "go_backwards": false, "kernel_regularizer": null, "dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "tanh"}, "class_name": "LSTM"}, {"config": {"kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_1", "kernel_constraint": null, "use_bias": true, "units": 1, "activation": "relu", "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow"}