{"class_name": "Sequential", "keras_version": "2.0.2", "config": [{"class_name": "LSTM", "config": {"trainable": true, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "distribution": "normal", "scale": 2.0}}, "unroll": false, "return_sequences": true, "use_bias": true, "dtype": "float32", "name": "lstm_1", "bias_constraint": null, "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "dropout": 0.0, "units": 128, "kernel_regularizer": null, "go_backwards": false, "implementation": 0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "activity_regularizer": null, "kernel_constraint": null, "unit_forget_bias": true, "recurrent_constraint": null, "batch_input_shape": [null, 1, 52], "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "stateful": false}}, {"class_name": "LSTM", "config": {"trainable": true, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "distribution": "normal", "scale": 2.0}}, "unroll": false, "return_sequences": true, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "lstm_2", "bias_constraint": null, "bias_regularizer": null, "stateful": false, "dropout": 0.0, "units": 32, "kernel_regularizer": null, "go_backwards": false, "implementation": 0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "activity_regularizer": null, "kernel_constraint": null, "unit_forget_bias": true, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null}}, {"class_name": "LSTM", "config": {"trainable": true, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "distribution": "normal", "scale": 2.0}}, "unroll": false, "return_sequences": true, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "lstm_3", "bias_constraint": null, "bias_regularizer": null, "stateful": false, "dropout": 0.0, "units": 2, "kernel_regularizer": null, "go_backwards": false, "implementation": 0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "activity_regularizer": null, "kernel_constraint": null, "unit_forget_bias": true, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_1", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "distribution": "normal", "scale": 2.0}}, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "units": 1, "bias_regularizer": null}}], "backend": "tensorflow"}