{"config": [{"config": {"stateful": false, "return_sequences": true, "dtype": "float32", "recurrent_regularizer": null, "activity_regularizer": null, "recurrent_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "recurrent_dropout": 0.0, "kernel_regularizer": null, "implementation": 0, "unroll": false, "trainable": true, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 64, "name": "lstm_1", "bias_constraint": null, "activation": "tanh", "batch_input_shape": [null, 1, 48], "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "go_backwards": false, "kernel_constraint": null}, "class_name": "LSTM"}, {"config": {"return_sequences": true, "recurrent_regularizer": null, "activity_regularizer": null, "recurrent_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "recurrent_dropout": 0.0, "kernel_regularizer": null, "implementation": 0, "unroll": false, "trainable": true, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 8, "name": "lstm_2", "bias_constraint": null, "activation": "tanh", "stateful": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "go_backwards": false, "kernel_constraint": null}, "class_name": "LSTM"}, {"config": {"return_sequences": true, "recurrent_regularizer": null, "activity_regularizer": null, "recurrent_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "recurrent_dropout": 0.0, "kernel_regularizer": null, "implementation": 0, "unroll": false, "trainable": true, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 2, "name": "lstm_3", "bias_constraint": null, "activation": "tanh", "stateful": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "go_backwards": false, "kernel_constraint": null}, "class_name": "LSTM"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1, "name": "dense_1", "kernel_regularizer": null, "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "kernel_constraint": null, "use_bias": true}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.0.2", "class_name": "Sequential"}