{"keras_version": "2.0.2", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"recurrent_constraint": null, "go_backwards": false, "dtype": "float32", "use_bias": true, "return_sequences": true, "batch_input_shape": [null, 1, 52], "unroll": false, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "dropout": 0.0, "units": 128, "trainable": true, "unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "activity_regularizer": null, "kernel_constraint": null, "activation": "tanh", "kernel_regularizer": null, "name": "lstm_2", "stateful": false, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "implementation": 0}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "activation": "relu", "kernel_regularizer": null, "name": "dense_2", "activity_regularizer": null, "bias_constraint": null, "units": 1, "trainable": true}}]}