{"class_name": "Sequential", "keras_version": "2.0.2", "config": [{"class_name": "LSTM", "config": {"dtype": "float32", "recurrent_dropout": 0.0, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "batch_input_shape": [null, 1, 52], "stateful": false, "dropout": 0.0, "bias_constraint": null, "use_bias": true, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "unroll": false, "trainable": true, "activation": "tanh", "kernel_constraint": null, "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}}, "recurrent_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "return_sequences": true, "implementation": 0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "go_backwards": false, "name": "lstm_1"}}, {"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "kernel_regularizer": null, "stateful": false, "dropout": 0.0, "bias_constraint": null, "use_bias": true, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "unroll": false, "trainable": true, "activation": "tanh", "kernel_constraint": null, "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}}, "recurrent_constraint": null, "bias_regularizer": null, "return_sequences": true, "implementation": 0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "go_backwards": false, "name": "lstm_2"}}, {"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "kernel_regularizer": null, "stateful": false, "dropout": 0.0, "bias_constraint": null, "use_bias": true, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "unroll": false, "trainable": true, "activation": "tanh", "kernel_constraint": null, "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}}, "recurrent_constraint": null, "bias_regularizer": null, "return_sequences": true, "implementation": 0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "go_backwards": false, "name": "lstm_3"}}, {"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "kernel_regularizer": null, "stateful": false, "dropout": 0.0, "bias_constraint": null, "use_bias": true, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "unroll": false, "trainable": true, "activation": "tanh", "kernel_constraint": null, "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}}, "recurrent_constraint": null, "bias_regularizer": null, "return_sequences": true, "implementation": 0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "go_backwards": false, "name": "lstm_4"}}, {"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "kernel_regularizer": null, "stateful": false, "dropout": 0.0, "bias_constraint": null, "use_bias": true, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "unroll": false, "trainable": true, "activation": "tanh", "kernel_constraint": null, "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}}, "recurrent_constraint": null, "bias_regularizer": null, "return_sequences": true, "implementation": 0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "go_backwards": false, "name": "lstm_5"}}, {"class_name": "Dense", "config": {"activation": "relu", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}}, "kernel_regularizer": null, "units": 1, "bias_constraint": null, "trainable": true, "name": "dense_1", "use_bias": true, "kernel_constraint": null, "bias_regularizer": null}}], "backend": "tensorflow"}