{"keras_version": "2.0.2", "config": [{"config": {"kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "implementation": 0, "recurrent_regularizer": null, "return_sequences": true, "name": "lstm_4", "unit_forget_bias": true, "dropout": 0.0, "unroll": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "batch_input_shape": [null, 1, 52], "go_backwards": false, "bias_regularizer": null, "dtype": "float32", "stateful": false, "trainable": true, "recurrent_dropout": 0.0, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "units": 128, "use_bias": true, "activation": "tanh", "recurrent_constraint": null}, "class_name": "LSTM"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "trainable": true, "name": "dense_4", "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1, "use_bias": true, "activation": "relu", "bias_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow"}