{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "unroll": false, "units": 16, "kernel_constraint": null, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_sequences": true, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "unit_forget_bias": true, "batch_input_shape": [null, 1, 52], "bias_regularizer": null, "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "implementation": 0, "activation": "tanh", "recurrent_dropout": 0.0, "dtype": "float32", "kernel_regularizer": null, "use_bias": true, "recurrent_regularizer": null, "name": "lstm_1", "activity_regularizer": null, "bias_constraint": null}}, {"class_name": "LSTM", "config": {"dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "unroll": false, "units": 16, "kernel_constraint": null, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_sequences": true, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "unit_forget_bias": true, "bias_regularizer": null, "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "implementation": 0, "activation": "tanh", "recurrent_dropout": 0.0, "kernel_regularizer": null, "use_bias": true, "recurrent_regularizer": null, "name": "lstm_2", "activity_regularizer": null, "bias_constraint": null}}, {"class_name": "LSTM", "config": {"dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "unroll": false, "units": 16, "kernel_constraint": null, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_sequences": true, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "unit_forget_bias": true, "bias_regularizer": null, "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "implementation": 0, "activation": "tanh", "recurrent_dropout": 0.0, "kernel_regularizer": null, "use_bias": true, "recurrent_regularizer": null, "name": "lstm_3", "activity_regularizer": null, "bias_constraint": null}}, {"class_name": "LSTM", "config": {"dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "unroll": false, "units": 16, "kernel_constraint": null, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_sequences": true, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "unit_forget_bias": true, "bias_regularizer": null, "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "implementation": 0, "activation": "tanh", "recurrent_dropout": 0.0, "kernel_regularizer": null, "use_bias": true, "recurrent_regularizer": null, "name": "lstm_4", "activity_regularizer": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "units": 1, "activation": "relu", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "name": "dense_1", "bias_constraint": null}}], "keras_version": "2.0.2"}