{"keras_version": "2.0.2", "config": [{"config": {"bias_regularizer": null, "kernel_regularizer": null, "unit_forget_bias": true, "recurrent_dropout": 0.0, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "stateful": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "unroll": false, "activity_regularizer": null, "bias_constraint": null, "batch_input_shape": [null, 1, 48], "recurrent_activation": "hard_sigmoid", "dtype": "float32", "implementation": 0, "kernel_constraint": null, "trainable": true, "return_sequences": true, "name": "lstm_1", "recurrent_constraint": null, "go_backwards": false, "dropout": 0.0, "recurrent_regularizer": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "units": 2}, "class_name": "LSTM"}, {"config": {"bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 0.0, "use_bias": true, "unit_forget_bias": true, "activation": "tanh", "stateful": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "go_backwards": false, "activity_regularizer": null, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "implementation": 0, "kernel_constraint": null, "trainable": true, "return_sequences": true, "unroll": false, "name": "lstm_2", "recurrent_constraint": null, "dropout": 0.0, "recurrent_regularizer": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "units": 8}, "class_name": "LSTM"}, {"config": {"bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 0.0, "use_bias": true, "unit_forget_bias": true, "activation": "tanh", "stateful": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "go_backwards": false, "activity_regularizer": null, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "implementation": 0, "kernel_constraint": null, "trainable": true, "return_sequences": true, "unroll": false, "name": "lstm_3", "recurrent_constraint": null, "dropout": 0.0, "recurrent_regularizer": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "units": 32}, "class_name": "LSTM"}, {"config": {"bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 0.0, "use_bias": true, "unit_forget_bias": true, "activation": "tanh", "stateful": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "go_backwards": false, "activity_regularizer": null, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "implementation": 0, "kernel_constraint": null, "trainable": true, "return_sequences": true, "unroll": false, "name": "lstm_4", "recurrent_constraint": null, "dropout": 0.0, "recurrent_regularizer": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "units": 32}, "class_name": "LSTM"}, {"config": {"bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 0.0, "use_bias": true, "unit_forget_bias": true, "activation": "tanh", "stateful": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "go_backwards": false, "activity_regularizer": null, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "implementation": 0, "kernel_constraint": null, "trainable": true, "return_sequences": true, "unroll": false, "name": "lstm_5", "recurrent_constraint": null, "dropout": 0.0, "recurrent_regularizer": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "units": 8}, "class_name": "LSTM"}, {"config": {"bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 0.0, "use_bias": true, "unit_forget_bias": true, "activation": "tanh", "stateful": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "go_backwards": false, "activity_regularizer": null, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "implementation": 0, "kernel_constraint": null, "trainable": true, "return_sequences": true, "unroll": false, "name": "lstm_6", "recurrent_constraint": null, "dropout": 0.0, "recurrent_regularizer": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "units": 2}, "class_name": "LSTM"}, {"config": {"bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "trainable": true, "name": "dense_1", "activation": "relu", "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "units": 1}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential"}