{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.2", "config": [{"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "normal", "scale": 2.0}}, "dropout": 0.0, "kernel_constraint": null, "go_backwards": false, "unroll": false, "return_sequences": true, "recurrent_dropout": 0.0, "unit_forget_bias": true, "bias_regularizer": null, "units": 128, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "implementation": 0, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "recurrent_constraint": null, "activity_regularizer": null, "name": "lstm_1", "stateful": false, "batch_input_shape": [null, 1, 52], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32"}}, {"class_name": "LSTM", "config": {"unit_forget_bias": true, "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "normal", "scale": 2.0}}, "dropout": 0.0, "kernel_constraint": null, "go_backwards": false, "unroll": false, "return_sequences": true, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "bias_regularizer": null, "units": 64, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "implementation": 0, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "recurrent_constraint": null, "activity_regularizer": null, "name": "lstm_2", "stateful": false, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LSTM", "config": {"unit_forget_bias": true, "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "normal", "scale": 2.0}}, "dropout": 0.0, "kernel_constraint": null, "go_backwards": false, "unroll": false, "return_sequences": true, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "bias_regularizer": null, "units": 4, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "implementation": 0, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "recurrent_constraint": null, "activity_regularizer": null, "name": "lstm_3", "stateful": false, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LSTM", "config": {"unit_forget_bias": true, "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "normal", "scale": 2.0}}, "dropout": 0.0, "kernel_constraint": null, "go_backwards": false, "unroll": false, "return_sequences": true, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "bias_regularizer": null, "units": 2, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "implementation": 0, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "recurrent_constraint": null, "activity_regularizer": null, "name": "lstm_4", "stateful": false, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"activation": "relu", "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "normal", "scale": 2.0}}, "activity_regularizer": null, "kernel_constraint": null, "name": "dense_1", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1}}]}