{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "go_backwards": false, "return_sequences": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "name": "lstm_1", "use_bias": true, "batch_input_shape": [null, 1, 52], "bias_regularizer": null, "implementation": 0, "stateful": false, "unit_forget_bias": true, "recurrent_dropout": 0.0, "recurrent_constraint": null, "activity_regularizer": null, "unroll": false, "activation": "tanh", "dropout": 0.0, "units": 128, "trainable": true, "dtype": "float32"}}, {"class_name": "LSTM", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "name": "lstm_2", "use_bias": true, "bias_regularizer": null, "implementation": 0, "stateful": false, "unit_forget_bias": true, "recurrent_dropout": 0.0, "recurrent_constraint": null, "activity_regularizer": null, "unroll": false, "activation": "tanh", "dropout": 0.0, "units": 64, "trainable": true, "go_backwards": false}}, {"class_name": "LSTM", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "name": "lstm_3", "use_bias": true, "bias_regularizer": null, "implementation": 0, "stateful": false, "unit_forget_bias": true, "recurrent_dropout": 0.0, "recurrent_constraint": null, "activity_regularizer": null, "unroll": false, "activation": "tanh", "dropout": 0.0, "units": 2, "trainable": true, "go_backwards": false}}, {"class_name": "Dense", "config": {"name": "dense_1", "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "activity_regularizer": null, "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "trainable": true, "kernel_constraint": null}}], "keras_version": "2.0.2"}