{"config": [{"config": {"activation": "tanh", "units": 128, "unroll": false, "go_backwards": false, "implementation": 0, "kernel_constraint": null, "batch_input_shape": [null, 1, 52], "activity_regularizer": null, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "stateful": false, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "dtype": "float32", "name": "lstm_1", "kernel_initializer": {"config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "bias_regularizer": null, "unit_forget_bias": true, "trainable": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "use_bias": true, "dropout": 0.0}, "class_name": "LSTM"}, {"config": {"activation": "tanh", "units": 64, "unroll": false, "go_backwards": false, "implementation": 0, "kernel_constraint": null, "activity_regularizer": null, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "stateful": false, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "name": "lstm_2", "kernel_initializer": {"config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "bias_regularizer": null, "unit_forget_bias": true, "trainable": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "use_bias": true, "dropout": 0.0}, "class_name": "LSTM"}, {"config": {"activation": "tanh", "units": 2, "unroll": false, "go_backwards": false, "implementation": 0, "kernel_constraint": null, "activity_regularizer": null, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "stateful": false, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "name": "lstm_3", "kernel_initializer": {"config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "bias_regularizer": null, "unit_forget_bias": true, "trainable": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "use_bias": true, "dropout": 0.0}, "class_name": "LSTM"}, {"config": {"activation": "relu", "bias_constraint": null, "units": 1, "name": "dense_1", "kernel_initializer": {"config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.2"}