{"config": [{"config": {"return_sequences": true, "dtype": "float32", "batch_input_shape": [null, 1, 48], "recurrent_dropout": 0.0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "name": "lstm_1", "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "activation": "tanh", "activity_regularizer": null, "implementation": 0, "dropout": 0.0, "go_backwards": false, "stateful": false, "recurrent_constraint": null, "trainable": true, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "unroll": false, "kernel_initializer": {"config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "units": 64, "bias_regularizer": null}, "class_name": "LSTM"}, {"config": {"return_sequences": true, "kernel_constraint": null, "recurrent_dropout": 0.0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "activation": "tanh", "activity_regularizer": null, "implementation": 0, "dropout": 0.0, "go_backwards": false, "stateful": false, "name": "lstm_2", "trainable": true, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "unroll": false, "kernel_initializer": {"config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_constraint": null, "units": 32, "bias_regularizer": null}, "class_name": "LSTM"}, {"config": {"return_sequences": true, "kernel_constraint": null, "recurrent_dropout": 0.0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "activation": "tanh", "activity_regularizer": null, "implementation": 0, "dropout": 0.0, "go_backwards": false, "stateful": false, "name": "lstm_3", "trainable": true, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "unroll": false, "kernel_initializer": {"config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_constraint": null, "units": 8, "bias_regularizer": null}, "class_name": "LSTM"}, {"config": {"return_sequences": true, "kernel_constraint": null, "recurrent_dropout": 0.0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "activation": "tanh", "activity_regularizer": null, "implementation": 0, "dropout": 0.0, "go_backwards": false, "stateful": false, "name": "lstm_4", "trainable": true, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "unroll": false, "kernel_initializer": {"config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_constraint": null, "units": 2, "bias_regularizer": null}, "class_name": "LSTM"}, {"config": {"name": "dense_1", "trainable": true, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "units": 1}, "class_name": "Dense"}], "keras_version": "2.0.2", "backend": "tensorflow", "class_name": "Sequential"}