{"class_name": "Sequential", "keras_version": "2.0.2", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "dtype": "float32", "name": "lstm_1", "bias_regularizer": null, "unroll": false, "activation": "tanh", "return_sequences": true, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "dropout": 0.0, "trainable": true, "recurrent_constraint": null, "kernel_constraint": null, "stateful": false, "bias_constraint": null, "implementation": 0, "recurrent_dropout": 0.0, "units": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 1, 48], "unit_forget_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "go_backwards": false, "recurrent_regularizer": null}}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "use_bias": true, "name": "lstm_2", "bias_regularizer": null, "activation": "tanh", "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unroll": false, "dropout": 0.0, "trainable": true, "recurrent_constraint": null, "kernel_constraint": null, "stateful": false, "bias_constraint": null, "implementation": 0, "recurrent_dropout": 0.0, "units": 8, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "go_backwards": false, "recurrent_regularizer": null}}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "use_bias": true, "name": "lstm_3", "bias_regularizer": null, "activation": "tanh", "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unroll": false, "dropout": 0.0, "trainable": true, "recurrent_constraint": null, "kernel_constraint": null, "stateful": false, "bias_constraint": null, "implementation": 0, "recurrent_dropout": 0.0, "units": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "go_backwards": false, "recurrent_regularizer": null}}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "use_bias": true, "name": "lstm_4", "bias_regularizer": null, "activation": "tanh", "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unroll": false, "dropout": 0.0, "trainable": true, "recurrent_constraint": null, "kernel_constraint": null, "stateful": false, "bias_constraint": null, "implementation": 0, "recurrent_dropout": 0.0, "units": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "go_backwards": false, "recurrent_regularizer": null}}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "use_bias": true, "name": "lstm_5", "bias_regularizer": null, "activation": "tanh", "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unroll": false, "dropout": 0.0, "trainable": true, "recurrent_constraint": null, "kernel_constraint": null, "stateful": false, "bias_constraint": null, "implementation": 0, "recurrent_dropout": 0.0, "units": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "go_backwards": false, "recurrent_regularizer": null}}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "use_bias": true, "name": "lstm_6", "bias_regularizer": null, "activation": "tanh", "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unroll": false, "dropout": 0.0, "trainable": true, "recurrent_constraint": null, "kernel_constraint": null, "stateful": false, "bias_constraint": null, "implementation": 0, "recurrent_dropout": 0.0, "units": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "go_backwards": false, "recurrent_regularizer": null}}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "use_bias": true, "name": "lstm_7", "bias_regularizer": null, "activation": "tanh", "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unroll": false, "dropout": 0.0, "trainable": true, "recurrent_constraint": null, "kernel_constraint": null, "stateful": false, "bias_constraint": null, "implementation": 0, "recurrent_dropout": 0.0, "units": 8, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "go_backwards": false, "recurrent_regularizer": null}}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "use_bias": true, "name": "lstm_8", "bias_regularizer": null, "activation": "tanh", "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unroll": false, "dropout": 0.0, "trainable": true, "recurrent_constraint": null, "kernel_constraint": null, "stateful": false, "bias_constraint": null, "implementation": 0, "recurrent_dropout": 0.0, "units": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "go_backwards": false, "recurrent_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "kernel_regularizer": null, "units": 1, "name": "dense_1", "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "trainable": true}}]}