{"backend": "tensorflow", "keras_version": "2.0.2", "config": [{"config": {"batch_input_shape": [null, 1, 48], "go_backwards": false, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "name": "lstm_1", "use_bias": true, "activity_regularizer": null, "trainable": true, "return_sequences": true, "dropout": 0.0, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "units": 8, "stateful": false, "dtype": "float32", "unroll": false, "recurrent_constraint": null, "implementation": 0, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh"}, "class_name": "LSTM"}, {"config": {"go_backwards": false, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "name": "lstm_2", "use_bias": true, "activity_regularizer": null, "trainable": true, "return_sequences": true, "dropout": 0.0, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "units": 8, "stateful": false, "recurrent_constraint": null, "implementation": 0, "bias_constraint": null, "kernel_regularizer": null, "unroll": false, "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh"}, "class_name": "LSTM"}, {"config": {"go_backwards": false, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "name": "lstm_3", "use_bias": true, "activity_regularizer": null, "trainable": true, "return_sequences": true, "dropout": 0.0, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "units": 8, "stateful": false, "recurrent_constraint": null, "implementation": 0, "bias_constraint": null, "kernel_regularizer": null, "unroll": false, "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh"}, "class_name": "LSTM"}, {"config": {"go_backwards": false, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "name": "lstm_4", "use_bias": true, "activity_regularizer": null, "trainable": true, "return_sequences": true, "dropout": 0.0, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "units": 8, "stateful": false, "recurrent_constraint": null, "implementation": 0, "bias_constraint": null, "kernel_regularizer": null, "unroll": false, "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh"}, "class_name": "LSTM"}, {"config": {"go_backwards": false, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "name": "lstm_5", "use_bias": true, "activity_regularizer": null, "trainable": true, "return_sequences": true, "dropout": 0.0, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "units": 8, "stateful": false, "recurrent_constraint": null, "implementation": 0, "bias_constraint": null, "kernel_regularizer": null, "unroll": false, "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh"}, "class_name": "LSTM"}, {"config": {"go_backwards": false, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "name": "lstm_6", "use_bias": true, "activity_regularizer": null, "trainable": true, "return_sequences": true, "dropout": 0.0, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "units": 8, "stateful": false, "recurrent_constraint": null, "implementation": 0, "bias_constraint": null, "kernel_regularizer": null, "unroll": false, "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh"}, "class_name": "LSTM"}, {"config": {"kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "units": 1, "bias_regularizer": null, "kernel_regularizer": null, "name": "dense_1", "use_bias": true, "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu"}, "class_name": "Dense"}], "class_name": "Sequential"}