{"keras_version": "2.0.2", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"use_bias": true, "return_sequences": true, "activity_regularizer": null, "recurrent_constraint": null, "activation": "tanh", "unroll": false, "recurrent_dropout": 0.0, "dtype": "float32", "implementation": 0, "recurrent_regularizer": null, "stateful": false, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "kernel_regularizer": null, "bias_constraint": null, "name": "lstm_1", "kernel_constraint": null, "bias_regularizer": null, "batch_input_shape": [null, 1, 48], "go_backwards": false, "unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "units": 2, "dropout": 0.0, "trainable": true}}, {"class_name": "LSTM", "config": {"use_bias": true, "return_sequences": true, "activity_regularizer": null, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unroll": false, "recurrent_dropout": 0.0, "stateful": false, "implementation": 0, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "kernel_regularizer": null, "bias_constraint": null, "name": "lstm_2", "kernel_constraint": null, "bias_regularizer": null, "go_backwards": false, "unit_forget_bias": true, "activation": "tanh", "units": 8, "dropout": 0.0, "trainable": true}}, {"class_name": "LSTM", "config": {"use_bias": true, "return_sequences": true, "activity_regularizer": null, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unroll": false, "recurrent_dropout": 0.0, "stateful": false, "implementation": 0, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "kernel_regularizer": null, "bias_constraint": null, "name": "lstm_3", "kernel_constraint": null, "bias_regularizer": null, "go_backwards": false, "unit_forget_bias": true, "activation": "tanh", "units": 64, "dropout": 0.0, "trainable": true}}, {"class_name": "LSTM", "config": {"use_bias": true, "return_sequences": true, "activity_regularizer": null, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unroll": false, "recurrent_dropout": 0.0, "stateful": false, "implementation": 0, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "kernel_regularizer": null, "bias_constraint": null, "name": "lstm_4", "kernel_constraint": null, "bias_regularizer": null, "go_backwards": false, "unit_forget_bias": true, "activation": "tanh", "units": 64, "dropout": 0.0, "trainable": true}}, {"class_name": "LSTM", "config": {"use_bias": true, "return_sequences": true, "activity_regularizer": null, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unroll": false, "recurrent_dropout": 0.0, "stateful": false, "implementation": 0, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "kernel_regularizer": null, "bias_constraint": null, "name": "lstm_5", "kernel_constraint": null, "bias_regularizer": null, "go_backwards": false, "unit_forget_bias": true, "activation": "tanh", "units": 8, "dropout": 0.0, "trainable": true}}, {"class_name": "LSTM", "config": {"use_bias": true, "return_sequences": true, "activity_regularizer": null, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unroll": false, "recurrent_dropout": 0.0, "stateful": false, "implementation": 0, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "kernel_regularizer": null, "bias_constraint": null, "name": "lstm_6", "kernel_constraint": null, "bias_regularizer": null, "go_backwards": false, "unit_forget_bias": true, "activation": "tanh", "units": 2, "dropout": 0.0, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "units": 1, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "trainable": true, "bias_constraint": null}}]}