{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"units": 128, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "bias_regularizer": null, "unit_forget_bias": true, "recurrent_dropout": 0.0, "bias_constraint": null, "dropout": 0.0, "recurrent_constraint": null, "go_backwards": false, "return_sequences": true, "unroll": false, "batch_input_shape": [null, 1, 52], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "name": "lstm_1", "kernel_regularizer": null, "recurrent_regularizer": null, "kernel_constraint": null, "trainable": true, "dtype": "float32", "implementation": 0, "stateful": false}}, {"class_name": "LSTM", "config": {"units": 64, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "use_bias": true, "bias_regularizer": null, "unit_forget_bias": true, "recurrent_dropout": 0.0, "activation": "tanh", "dropout": 0.0, "recurrent_constraint": null, "go_backwards": false, "return_sequences": true, "unroll": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "name": "lstm_2", "kernel_regularizer": null, "recurrent_regularizer": null, "kernel_constraint": null, "trainable": true, "implementation": 0, "stateful": false}}, {"class_name": "LSTM", "config": {"units": 32, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "use_bias": true, "bias_regularizer": null, "unit_forget_bias": true, "recurrent_dropout": 0.0, "activation": "tanh", "dropout": 0.0, "recurrent_constraint": null, "go_backwards": false, "return_sequences": true, "unroll": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "name": "lstm_3", "kernel_regularizer": null, "recurrent_regularizer": null, "kernel_constraint": null, "trainable": true, "implementation": 0, "stateful": false}}, {"class_name": "LSTM", "config": {"units": 2, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "use_bias": true, "bias_regularizer": null, "unit_forget_bias": true, "recurrent_dropout": 0.0, "activation": "tanh", "dropout": 0.0, "recurrent_constraint": null, "go_backwards": false, "return_sequences": true, "unroll": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "name": "lstm_4", "kernel_regularizer": null, "recurrent_regularizer": null, "kernel_constraint": null, "trainable": true, "implementation": 0, "stateful": false}}, {"class_name": "Dense", "config": {"units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "name": "dense_1", "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "activity_regularizer": null}}], "keras_version": "2.0.2", "backend": "tensorflow"}