{"backend": "tensorflow", "keras_version": "2.0.2", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "recurrent_constraint": null, "bias_constraint": null, "trainable": true, "recurrent_dropout": 0.0, "name": "lstm_1", "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "batch_input_shape": [null, 1, 48], "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "recurrent_regularizer": null, "units": 8, "dtype": "float32", "activation": "tanh", "recurrent_activation": "hard_sigmoid", "return_sequences": true, "go_backwards": false, "implementation": 0, "kernel_regularizer": null, "dropout": 0.0, "use_bias": true, "unroll": false}}, {"class_name": "LSTM", "config": {"stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "recurrent_constraint": null, "bias_constraint": null, "trainable": true, "recurrent_dropout": 0.0, "name": "lstm_2", "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "recurrent_regularizer": null, "units": 8, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "return_sequences": true, "go_backwards": false, "implementation": 0, "kernel_regularizer": null, "dropout": 0.0, "use_bias": true, "unroll": false}}, {"class_name": "LSTM", "config": {"stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "recurrent_constraint": null, "bias_constraint": null, "trainable": true, "recurrent_dropout": 0.0, "name": "lstm_3", "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "recurrent_regularizer": null, "units": 8, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "return_sequences": true, "go_backwards": false, "implementation": 0, "kernel_regularizer": null, "dropout": 0.0, "use_bias": true, "unroll": false}}, {"class_name": "LSTM", "config": {"stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "recurrent_constraint": null, "bias_constraint": null, "trainable": true, "recurrent_dropout": 0.0, "name": "lstm_4", "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "recurrent_regularizer": null, "units": 8, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "return_sequences": true, "go_backwards": false, "implementation": 0, "kernel_regularizer": null, "dropout": 0.0, "use_bias": true, "unroll": false}}, {"class_name": "LSTM", "config": {"stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "recurrent_constraint": null, "bias_constraint": null, "trainable": true, "recurrent_dropout": 0.0, "name": "lstm_5", "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "recurrent_regularizer": null, "units": 8, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "return_sequences": true, "go_backwards": false, "implementation": 0, "kernel_regularizer": null, "dropout": 0.0, "use_bias": true, "unroll": false}}, {"class_name": "LSTM", "config": {"stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "recurrent_constraint": null, "bias_constraint": null, "trainable": true, "recurrent_dropout": 0.0, "name": "lstm_6", "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "recurrent_regularizer": null, "units": 8, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "return_sequences": true, "go_backwards": false, "implementation": 0, "kernel_regularizer": null, "dropout": 0.0, "use_bias": true, "unroll": false}}, {"class_name": "Dense", "config": {"units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "trainable": true, "name": "dense_1", "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}}}]}