{"backend": "tensorflow", "config": [{"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "activation": "tanh", "unroll": false, "go_backwards": false, "name": "lstm_1", "use_bias": true, "trainable": true, "recurrent_constraint": null, "kernel_initializer": {"config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}, "class_name": "VarianceScaling"}, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "units": 128, "bias_constraint": null, "implementation": 0, "batch_input_shape": [null, 1, 52], "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "activity_regularizer": null, "kernel_regularizer": null, "stateful": false, "return_sequences": true, "recurrent_regularizer": null, "bias_regularizer": null, "recurrent_dropout": 0.0, "kernel_constraint": null}, "class_name": "LSTM"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "name": "dense_1", "use_bias": true, "trainable": true, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_regularizer": null, "units": 1, "kernel_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}], "keras_version": "2.0.2", "class_name": "Sequential"}