{"keras_version": "2.0.2", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"batch_input_shape": [null, 1, 52], "go_backwards": false, "units": 128, "kernel_constraint": null, "recurrent_regularizer": null, "trainable": true, "recurrent_constraint": null, "dtype": "float32", "kernel_regularizer": null, "unit_forget_bias": true, "stateful": false, "dropout": 0.0, "unroll": false, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "implementation": 0, "activation": "tanh", "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "name": "lstm_2"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "units": 1, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "name": "dense_2"}}], "class_name": "Sequential"}