{"keras_version": "2.0.2", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"unroll": false, "batch_input_shape": [null, 1, 52], "bias_regularizer": null, "activity_regularizer": null, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "dropout": 0.0, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_regularizer": null, "name": "lstm_1", "bias_constraint": null, "dtype": "float32", "recurrent_dropout": 0.0, "use_bias": true, "units": 128, "implementation": 0, "unit_forget_bias": true, "kernel_constraint": null, "go_backwards": false, "activation": "tanh", "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "return_sequences": true, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "LSTM", "config": {"unroll": false, "dropout": 0.0, "bias_regularizer": null, "activity_regularizer": null, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "trainable": true, "kernel_regularizer": null, "name": "lstm_2", "bias_constraint": null, "recurrent_dropout": 0.0, "use_bias": true, "units": 32, "implementation": 0, "unit_forget_bias": true, "kernel_constraint": null, "go_backwards": false, "activation": "tanh", "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "return_sequences": true, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "LSTM", "config": {"unroll": false, "dropout": 0.0, "bias_regularizer": null, "activity_regularizer": null, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "trainable": true, "kernel_regularizer": null, "name": "lstm_3", "bias_constraint": null, "recurrent_dropout": 0.0, "use_bias": true, "units": 2, "implementation": 0, "unit_forget_bias": true, "kernel_constraint": null, "go_backwards": false, "activation": "tanh", "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "return_sequences": true, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "name": "dense_1", "activation": "relu", "trainable": true}}]}