{"class_name": "Sequential", "keras_version": "2.0.2", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"unroll": false, "activity_regularizer": null, "bias_regularizer": null, "recurrent_constraint": null, "dtype": "float32", "stateful": false, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "trainable": true, "use_bias": true, "dropout": 0.0, "go_backwards": false, "unit_forget_bias": true, "name": "lstm_1", "batch_input_shape": [null, 1, 48], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_regularizer": null, "activation": "tanh", "units": 64, "recurrent_regularizer": null, "kernel_constraint": null, "return_sequences": true}}, {"class_name": "LSTM", "config": {"unroll": false, "activity_regularizer": null, "bias_regularizer": null, "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "stateful": false, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "trainable": true, "use_bias": true, "dropout": 0.0, "go_backwards": false, "unit_forget_bias": true, "name": "lstm_2", "recurrent_regularizer": null, "recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_regularizer": null, "activation": "tanh", "units": 8, "kernel_constraint": null, "return_sequences": true}}, {"class_name": "LSTM", "config": {"unroll": false, "activity_regularizer": null, "bias_regularizer": null, "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "stateful": false, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "trainable": true, "use_bias": true, "dropout": 0.0, "go_backwards": false, "unit_forget_bias": true, "name": "lstm_3", "recurrent_regularizer": null, "recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_regularizer": null, "activation": "tanh", "units": 2, "kernel_constraint": null, "return_sequences": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias_regularizer": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "kernel_regularizer": null, "activation": "relu", "units": 1, "kernel_constraint": null}}]}