{"config": [{"config": {"kernel_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "recurrent_constraint": null, "stateful": false, "unit_forget_bias": true, "use_bias": true, "bias_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_regularizer": null, "activity_regularizer": null, "name": "lstm_1", "batch_input_shape": [null, 1, 52], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "dtype": "float32", "unroll": false, "go_backwards": false, "implementation": 0, "return_sequences": true, "units": 4, "activation": "tanh", "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_regularizer": null}, "class_name": "LSTM"}, {"config": {"kernel_constraint": null, "dropout": 0.0, "activity_regularizer": null, "recurrent_constraint": null, "stateful": false, "unit_forget_bias": true, "use_bias": true, "bias_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_regularizer": null, "name": "lstm_2", "recurrent_dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "unroll": false, "go_backwards": false, "implementation": 0, "return_sequences": true, "units": 4, "activation": "tanh", "trainable": true, "kernel_regularizer": null}, "class_name": "LSTM"}, {"config": {"kernel_constraint": null, "dropout": 0.0, "activity_regularizer": null, "recurrent_constraint": null, "stateful": false, "unit_forget_bias": true, "use_bias": true, "bias_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_regularizer": null, "name": "lstm_3", "recurrent_dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "unroll": false, "go_backwards": false, "implementation": 0, "return_sequences": true, "units": 4, "activation": "tanh", "trainable": true, "kernel_regularizer": null}, "class_name": "LSTM"}, {"config": {"kernel_constraint": null, "dropout": 0.0, "activity_regularizer": null, "recurrent_constraint": null, "stateful": false, "unit_forget_bias": true, "use_bias": true, "bias_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_regularizer": null, "name": "lstm_4", "recurrent_dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "unroll": false, "go_backwards": false, "implementation": 0, "return_sequences": true, "units": 4, "activation": "tanh", "trainable": true, "kernel_regularizer": null}, "class_name": "LSTM"}, {"config": {"kernel_constraint": null, "dropout": 0.0, "activity_regularizer": null, "recurrent_constraint": null, "stateful": false, "unit_forget_bias": true, "use_bias": true, "bias_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_regularizer": null, "name": "lstm_5", "recurrent_dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "unroll": false, "go_backwards": false, "implementation": 0, "return_sequences": true, "units": 4, "activation": "tanh", "trainable": true, "kernel_regularizer": null}, "class_name": "LSTM"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "units": 1, "bias_regularizer": null, "activation": "relu", "name": "dense_1", "trainable": true, "kernel_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.2", "backend": "tensorflow"}