{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"unroll": false, "dropout": 0.0, "recurrent_constraint": null, "go_backwards": false, "stateful": false, "return_sequences": true, "implementation": 0, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "name": "lstm_1", "batch_input_shape": [null, 1, 52], "bias_constraint": null, "dtype": "float32", "kernel_constraint": null, "trainable": true, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "units": 2, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "recurrent_regularizer": null, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true}}, {"class_name": "LSTM", "config": {"unroll": false, "dropout": 0.0, "recurrent_constraint": null, "go_backwards": false, "stateful": false, "return_sequences": true, "implementation": 0, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "name": "lstm_2", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "units": 128, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "recurrent_regularizer": null, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true}}, {"class_name": "LSTM", "config": {"unroll": false, "dropout": 0.0, "recurrent_constraint": null, "go_backwards": false, "stateful": false, "return_sequences": true, "implementation": 0, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "name": "lstm_3", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "units": 128, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "recurrent_regularizer": null, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true}}, {"class_name": "LSTM", "config": {"unroll": false, "dropout": 0.0, "recurrent_constraint": null, "go_backwards": false, "stateful": false, "return_sequences": true, "implementation": 0, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "name": "lstm_4", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "units": 2, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "recurrent_regularizer": null, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "units": 1, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "name": "dense_1", "activation": "relu", "bias_constraint": null}}], "keras_version": "2.0.2", "backend": "tensorflow"}