{"config": [{"config": {"recurrent_dropout": 0.0, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "implementation": 0, "bias_constraint": null, "name": "lstm_2", "use_bias": true, "return_sequences": true, "batch_input_shape": [null, 1, 52], "stateful": false, "unroll": false, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "go_backwards": false, "recurrent_constraint": null, "unit_forget_bias": true, "activation": "tanh", "activity_regularizer": null, "recurrent_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "units": 128, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dtype": "float32"}, "class_name": "LSTM"}, {"config": {"bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "trainable": true, "kernel_initializer": {"config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "use_bias": true, "units": 1}, "class_name": "Dense"}], "keras_version": "2.0.2", "class_name": "Sequential", "backend": "tensorflow"}