{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"batch_input_shape": [null, 1, 48], "unroll": false, "kernel_regularizer": null, "go_backwards": false, "recurrent_dropout": 0.0, "name": "lstm_1", "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "dropout": 0.0, "bias_constraint": null, "units": 16, "use_bias": true, "kernel_constraint": null, "return_sequences": true, "recurrent_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "dtype": "float32", "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "trainable": true, "implementation": 0, "recurrent_regularizer": null}}, {"class_name": "LSTM", "config": {"dropout": 0.0, "unroll": false, "kernel_regularizer": null, "go_backwards": false, "bias_constraint": null, "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "recurrent_dropout": 0.0, "units": 16, "use_bias": true, "kernel_constraint": null, "return_sequences": true, "recurrent_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "name": "lstm_2", "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "trainable": true, "implementation": 0, "recurrent_regularizer": null}}, {"class_name": "LSTM", "config": {"dropout": 0.0, "unroll": false, "kernel_regularizer": null, "go_backwards": false, "bias_constraint": null, "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "recurrent_dropout": 0.0, "units": 16, "use_bias": true, "kernel_constraint": null, "return_sequences": true, "recurrent_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "name": "lstm_3", "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "trainable": true, "implementation": 0, "recurrent_regularizer": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "units": 1, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "trainable": true}}], "keras_version": "2.0.2"}