{"backend": "tensorflow", "keras_version": "2.0.2", "config": [{"config": {"batch_input_shape": [null, 1, 52], "use_bias": true, "trainable": true, "dtype": "float32", "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "bias_constraint": null, "unroll": false, "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "go_backwards": false, "recurrent_dropout": 0.0, "recurrent_constraint": null, "unit_forget_bias": true, "implementation": 0, "return_sequences": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "stateful": false, "dropout": 0.0, "recurrent_regularizer": null, "name": "lstm_1", "units": 128, "activation": "tanh", "kernel_regularizer": null, "kernel_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}}, "class_name": "LSTM"}, {"config": {"use_bias": true, "units": 1, "trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "dense_1"}, "class_name": "Dense"}], "class_name": "Sequential"}