{"backend": "tensorflow", "keras_version": "2.0.2", "config": [{"class_name": "LSTM", "config": {"dropout": 0.0, "use_bias": true, "implementation": 0, "recurrent_dropout": 0.0, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "activity_regularizer": null, "unit_forget_bias": true, "units": 2, "bias_regularizer": null, "recurrent_regularizer": null, "trainable": true, "kernel_regularizer": null, "dtype": "float32", "stateful": false, "unroll": false, "batch_input_shape": [null, 1, 48], "name": "lstm_1", "go_backwards": false, "kernel_constraint": null, "activation": "tanh", "recurrent_constraint": null, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "LSTM", "config": {"dropout": 0.0, "use_bias": true, "implementation": 0, "recurrent_dropout": 0.0, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "activity_regularizer": null, "unit_forget_bias": true, "units": 8, "bias_regularizer": null, "recurrent_regularizer": null, "trainable": true, "kernel_regularizer": null, "stateful": false, "unroll": false, "name": "lstm_2", "return_sequences": true, "kernel_constraint": null, "activation": "tanh", "recurrent_constraint": null, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "LSTM", "config": {"dropout": 0.0, "use_bias": true, "implementation": 0, "recurrent_dropout": 0.0, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "activity_regularizer": null, "unit_forget_bias": true, "units": 16, "bias_regularizer": null, "recurrent_regularizer": null, "trainable": true, "kernel_regularizer": null, "stateful": false, "unroll": false, "name": "lstm_3", "return_sequences": true, "kernel_constraint": null, "activation": "tanh", "recurrent_constraint": null, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "LSTM", "config": {"dropout": 0.0, "use_bias": true, "implementation": 0, "recurrent_dropout": 0.0, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "activity_regularizer": null, "unit_forget_bias": true, "units": 128, "bias_regularizer": null, "recurrent_regularizer": null, "trainable": true, "kernel_regularizer": null, "stateful": false, "unroll": false, "name": "lstm_4", "return_sequences": true, "kernel_constraint": null, "activation": "tanh", "recurrent_constraint": null, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "LSTM", "config": {"dropout": 0.0, "use_bias": true, "implementation": 0, "recurrent_dropout": 0.0, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "activity_regularizer": null, "unit_forget_bias": true, "units": 16, "bias_regularizer": null, "recurrent_regularizer": null, "trainable": true, "kernel_regularizer": null, "stateful": false, "unroll": false, "name": "lstm_5", "return_sequences": true, "kernel_constraint": null, "activation": "tanh", "recurrent_constraint": null, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "LSTM", "config": {"dropout": 0.0, "use_bias": true, "implementation": 0, "recurrent_dropout": 0.0, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "activity_regularizer": null, "unit_forget_bias": true, "units": 8, "bias_regularizer": null, "recurrent_regularizer": null, "trainable": true, "kernel_regularizer": null, "stateful": false, "unroll": false, "name": "lstm_6", "return_sequences": true, "kernel_constraint": null, "activation": "tanh", "recurrent_constraint": null, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "LSTM", "config": {"dropout": 0.0, "use_bias": true, "implementation": 0, "recurrent_dropout": 0.0, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "activity_regularizer": null, "unit_forget_bias": true, "units": 2, "bias_regularizer": null, "recurrent_regularizer": null, "trainable": true, "kernel_regularizer": null, "stateful": false, "unroll": false, "name": "lstm_7", "return_sequences": true, "kernel_constraint": null, "activation": "tanh", "recurrent_constraint": null, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "Dense", "config": {"use_bias": true, "name": "dense_1", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "activity_regularizer": null, "units": 1, "bias_regularizer": null, "activation": "relu", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_constraint": null}}], "class_name": "Sequential"}