{"keras_version": "2.0.2", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"name": "lstm_1", "stateful": false, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "recurrent_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "go_backwards": false, "return_sequences": true, "batch_input_shape": [null, 1, 52], "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 0, "bias_constraint": null, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "unit_forget_bias": true, "recurrent_dropout": 0.0, "units": 64, "recurrent_regularizer": null, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"name": "lstm_2", "stateful": false, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true, "recurrent_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "use_bias": true, "return_sequences": true, "dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 0, "go_backwards": false, "bias_constraint": null, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "recurrent_dropout": 0.0, "units": 32, "recurrent_regularizer": null, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"name": "lstm_3", "stateful": false, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true, "recurrent_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "use_bias": true, "return_sequences": true, "dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 0, "go_backwards": false, "bias_constraint": null, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "recurrent_dropout": 0.0, "units": 2, "recurrent_regularizer": null, "activation": "tanh"}}, {"class_name": "Dense", "config": {"name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "trainable": true, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "units": 1, "activation": "relu"}}]}