{"keras_version": "2.0.2", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"activity_regularizer": null, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "mode": "fan_in", "scale": 2.0}}, "dtype": "float32", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_activation": "hard_sigmoid", "trainable": true, "unroll": false, "use_bias": true, "bias_constraint": null, "units": 128, "implementation": 0, "kernel_regularizer": null, "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null, "kernel_constraint": null, "go_backwards": false, "dropout": 0.0, "batch_input_shape": [null, 1, 52], "recurrent_constraint": null, "name": "lstm_1", "return_sequences": true, "activation": "tanh", "unit_forget_bias": true, "bias_regularizer": null}}, {"class_name": "LSTM", "config": {"activity_regularizer": null, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "mode": "fan_in", "scale": 2.0}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_activation": "hard_sigmoid", "trainable": true, "unroll": false, "use_bias": true, "bias_constraint": null, "units": 64, "implementation": 0, "kernel_regularizer": null, "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null, "kernel_constraint": null, "go_backwards": false, "dropout": 0.0, "recurrent_constraint": null, "name": "lstm_2", "return_sequences": true, "activation": "tanh", "unit_forget_bias": true, "bias_regularizer": null}}, {"class_name": "LSTM", "config": {"activity_regularizer": null, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "mode": "fan_in", "scale": 2.0}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_activation": "hard_sigmoid", "trainable": true, "unroll": false, "use_bias": true, "bias_constraint": null, "units": 2, "implementation": 0, "kernel_regularizer": null, "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null, "kernel_constraint": null, "go_backwards": false, "dropout": 0.0, "recurrent_constraint": null, "name": "lstm_3", "return_sequences": true, "activation": "tanh", "unit_forget_bias": true, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "mode": "fan_in", "scale": 2.0}}, "kernel_constraint": null, "trainable": true, "use_bias": true, "name": "dense_1", "bias_constraint": null, "units": 1, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_regularizer": null}}]}