{"backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"implementation": 0, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "go_backwards": false, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "trainable": true, "recurrent_dropout": 0.0, "bias_regularizer": null, "name": "lstm_1", "batch_input_shape": [null, 1, 48], "recurrent_regularizer": null, "recurrent_constraint": null, "dropout": 0.0, "dtype": "float32", "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "unroll": false, "activation": "tanh", "units": 2, "use_bias": true, "stateful": false, "unit_forget_bias": true}}, {"class_name": "LSTM", "config": {"implementation": 0, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "go_backwards": false, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "trainable": true, "recurrent_dropout": 0.0, "bias_regularizer": null, "name": "lstm_2", "recurrent_regularizer": null, "recurrent_constraint": null, "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "unroll": false, "activation": "tanh", "units": 2, "use_bias": true, "stateful": false, "unit_forget_bias": true}}, {"class_name": "LSTM", "config": {"implementation": 0, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "go_backwards": false, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "trainable": true, "recurrent_dropout": 0.0, "bias_regularizer": null, "name": "lstm_3", "recurrent_regularizer": null, "recurrent_constraint": null, "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "unroll": false, "activation": "tanh", "units": 2, "use_bias": true, "stateful": false, "unit_forget_bias": true}}, {"class_name": "LSTM", "config": {"implementation": 0, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "go_backwards": false, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "trainable": true, "recurrent_dropout": 0.0, "bias_regularizer": null, "name": "lstm_4", "recurrent_regularizer": null, "recurrent_constraint": null, "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "unroll": false, "activation": "tanh", "units": 2, "use_bias": true, "stateful": false, "unit_forget_bias": true}}, {"class_name": "LSTM", "config": {"implementation": 0, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "go_backwards": false, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "trainable": true, "recurrent_dropout": 0.0, "bias_regularizer": null, "name": "lstm_5", "recurrent_regularizer": null, "recurrent_constraint": null, "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "unroll": false, "activation": "tanh", "units": 2, "use_bias": true, "stateful": false, "unit_forget_bias": true}}, {"class_name": "LSTM", "config": {"implementation": 0, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "go_backwards": false, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "trainable": true, "recurrent_dropout": 0.0, "bias_regularizer": null, "name": "lstm_6", "recurrent_regularizer": null, "recurrent_constraint": null, "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "unroll": false, "activation": "tanh", "units": 2, "use_bias": true, "stateful": false, "unit_forget_bias": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu", "use_bias": true, "name": "dense_1", "units": 1}}], "keras_version": "2.0.2", "class_name": "Sequential"}