{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"batch_input_shape": [null, 1, 48], "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true, "activation": "tanh", "kernel_regularizer": null, "go_backwards": false, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "implementation": 0, "stateful": false, "recurrent_activation": "hard_sigmoid", "unroll": false, "units": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}}, "recurrent_constraint": null, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "name": "lstm_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": true, "dtype": "float32", "trainable": true, "dropout": 0.0, "bias_constraint": null}}, {"class_name": "LSTM", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true, "activation": "tanh", "kernel_regularizer": null, "go_backwards": false, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "implementation": 0, "stateful": false, "recurrent_activation": "hard_sigmoid", "unroll": false, "units": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}}, "recurrent_constraint": null, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": true, "name": "lstm_2", "dropout": 0.0, "bias_constraint": null}}, {"class_name": "LSTM", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true, "activation": "tanh", "kernel_regularizer": null, "go_backwards": false, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "implementation": 0, "stateful": false, "recurrent_activation": "hard_sigmoid", "unroll": false, "units": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}}, "recurrent_constraint": null, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": true, "name": "lstm_3", "dropout": 0.0, "bias_constraint": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}}, "activation": "relu", "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "name": "dense_1", "bias_constraint": null}}], "keras_version": "2.0.2"}