{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "trainable": true, "kernel_regularizer": null, "batch_input_shape": [null, 1, 52], "unroll": false, "activity_regularizer": null, "return_sequences": true, "bias_constraint": null, "recurrent_constraint": null, "implementation": 0, "go_backwards": false, "kernel_constraint": null, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "dtype": "float32", "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "activation": "tanh", "units": 128, "unit_forget_bias": true, "name": "lstm_1", "bias_regularizer": null, "recurrent_dropout": 0.0}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "activation": "relu", "units": 1, "name": "dense_1", "bias_regularizer": null}}], "keras_version": "2.0.2"}