{"keras_version": "2.0.2", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "use_bias": true, "recurrent_dropout": 0.0, "unroll": false, "stateful": false, "go_backwards": false, "implementation": 0, "recurrent_regularizer": null, "bias_constraint": null, "return_sequences": true, "batch_input_shape": [null, 1, 52], "unit_forget_bias": true, "name": "lstm_1", "bias_regularizer": null, "kernel_regularizer": null, "dtype": "float32", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "activity_regularizer": null, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "trainable": true, "units": 128, "kernel_constraint": null}}, {"class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "use_bias": true, "recurrent_dropout": 0.0, "unroll": false, "stateful": false, "go_backwards": false, "implementation": 0, "recurrent_regularizer": null, "bias_constraint": null, "return_sequences": true, "unit_forget_bias": true, "name": "lstm_2", "bias_regularizer": null, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "activity_regularizer": null, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "trainable": true, "units": 64, "kernel_constraint": null}}, {"class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "use_bias": true, "recurrent_dropout": 0.0, "unroll": false, "stateful": false, "go_backwards": false, "implementation": 0, "recurrent_regularizer": null, "bias_constraint": null, "return_sequences": true, "unit_forget_bias": true, "name": "lstm_3", "bias_regularizer": null, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "activity_regularizer": null, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "trainable": true, "units": 2, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "name": "dense_1", "activity_regularizer": null, "activation": "relu", "trainable": true, "units": 1, "kernel_constraint": null, "bias_constraint": null}}]}