{"keras_version": "2.0.2", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"batch_input_shape": [null, 1, 48], "name": "lstm_1", "recurrent_dropout": 0.0, "kernel_regularizer": null, "unroll": false, "implementation": 0, "kernel_constraint": null, "units": 2, "recurrent_constraint": null, "dropout": 0.0, "return_sequences": true, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "bias_regularizer": null, "unit_forget_bias": true, "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "use_bias": true, "bias_constraint": null, "trainable": true, "stateful": false, "activation": "tanh", "recurrent_regularizer": null}}, {"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "kernel_regularizer": null, "unroll": false, "implementation": 0, "kernel_constraint": null, "units": 16, "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "return_sequences": true, "activity_regularizer": null, "dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "name": "lstm_2", "bias_regularizer": null, "unit_forget_bias": true, "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "bias_constraint": null, "trainable": true, "stateful": false, "activation": "tanh", "recurrent_regularizer": null}}, {"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "kernel_regularizer": null, "unroll": false, "implementation": 0, "kernel_constraint": null, "units": 16, "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "return_sequences": true, "activity_regularizer": null, "dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "name": "lstm_3", "bias_regularizer": null, "unit_forget_bias": true, "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "bias_constraint": null, "trainable": true, "stateful": false, "activation": "tanh", "recurrent_regularizer": null}}, {"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "kernel_regularizer": null, "unroll": false, "implementation": 0, "kernel_constraint": null, "units": 2, "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "return_sequences": true, "activity_regularizer": null, "dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "name": "lstm_4", "bias_regularizer": null, "unit_forget_bias": true, "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "bias_constraint": null, "trainable": true, "stateful": false, "activation": "tanh", "recurrent_regularizer": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "units": 1, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu"}}]}