{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"activity_regularizer": null, "trainable": true, "batch_input_shape": [null, 1, 48], "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "activation": "tanh", "unroll": false, "go_backwards": false, "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "implementation": 0, "kernel_constraint": null, "dropout": 0.0, "bias_constraint": null, "recurrent_regularizer": null, "unit_forget_bias": true, "stateful": false, "dtype": "float32", "name": "lstm_1", "kernel_regularizer": null, "units": 16, "use_bias": true, "recurrent_dropout": 0.0}}, {"class_name": "LSTM", "config": {"activity_regularizer": null, "trainable": true, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "activation": "tanh", "unroll": false, "go_backwards": false, "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "implementation": 0, "kernel_constraint": null, "dropout": 0.0, "bias_constraint": null, "recurrent_regularizer": null, "unit_forget_bias": true, "stateful": false, "name": "lstm_2", "kernel_regularizer": null, "units": 2, "use_bias": true, "recurrent_dropout": 0.0}}, {"class_name": "LSTM", "config": {"activity_regularizer": null, "trainable": true, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "activation": "tanh", "unroll": false, "go_backwards": false, "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "implementation": 0, "kernel_constraint": null, "dropout": 0.0, "bias_constraint": null, "recurrent_regularizer": null, "unit_forget_bias": true, "stateful": false, "name": "lstm_3", "kernel_regularizer": null, "units": 16, "use_bias": true, "recurrent_dropout": 0.0}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "name": "dense_1", "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "use_bias": true}}], "keras_version": "2.0.2"}