{"backend": "tensorflow", "config": [{"config": {"dtype": "float32", "unroll": false, "kernel_regularizer": null, "stateful": false, "bias_constraint": null, "bias_regularizer": null, "dropout": 0.0, "use_bias": true, "name": "lstm_1", "recurrent_dropout": 0.0, "activation": "tanh", "units": 2, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_constraint": null, "unit_forget_bias": true, "implementation": 0, "go_backwards": false, "recurrent_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "trainable": true, "recurrent_constraint": null, "return_sequences": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "recurrent_activation": "hard_sigmoid", "batch_input_shape": [null, 1, 48]}, "class_name": "LSTM"}, {"config": {"unroll": false, "activation": "tanh", "stateful": false, "bias_constraint": null, "bias_regularizer": null, "dropout": 0.0, "use_bias": true, "name": "lstm_2", "recurrent_dropout": 0.0, "kernel_regularizer": null, "units": 2, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_constraint": null, "unit_forget_bias": true, "implementation": 0, "go_backwards": false, "recurrent_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "trainable": true, "recurrent_constraint": null, "return_sequences": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM"}, {"config": {"unroll": false, "activation": "tanh", "stateful": false, "bias_constraint": null, "bias_regularizer": null, "dropout": 0.0, "use_bias": true, "name": "lstm_3", "recurrent_dropout": 0.0, "kernel_regularizer": null, "units": 2, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_constraint": null, "unit_forget_bias": true, "implementation": 0, "go_backwards": false, "recurrent_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "trainable": true, "recurrent_constraint": null, "return_sequences": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM"}, {"config": {"unroll": false, "activation": "tanh", "stateful": false, "bias_constraint": null, "bias_regularizer": null, "dropout": 0.0, "use_bias": true, "name": "lstm_4", "recurrent_dropout": 0.0, "kernel_regularizer": null, "units": 2, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_constraint": null, "unit_forget_bias": true, "implementation": 0, "go_backwards": false, "recurrent_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "trainable": true, "recurrent_constraint": null, "return_sequences": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM"}, {"config": {"kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "name": "dense_1", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "activation": "relu", "units": 1, "kernel_initializer": {"config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.2"}