{"backend": "tensorflow", "keras_version": "2.0.2", "config": [{"config": {"activation": "tanh", "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "unroll": false, "activity_regularizer": null, "name": "lstm_1", "recurrent_dropout": 0.0, "go_backwards": false, "bias_regularizer": null, "kernel_constraint": null, "batch_input_shape": [null, 1, 52], "stateful": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unit_forget_bias": true, "trainable": true, "recurrent_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "dtype": "float32", "recurrent_regularizer": null, "return_sequences": true, "recurrent_activation": "hard_sigmoid", "units": 128, "implementation": 0, "kernel_initializer": {"config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}, "class_name": "VarianceScaling"}, "dropout": 0.0}, "class_name": "LSTM"}, {"config": {"activation": "tanh", "name": "lstm_2", "kernel_regularizer": null, "use_bias": true, "unroll": false, "bias_constraint": null, "recurrent_dropout": 0.0, "go_backwards": false, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "stateful": false, "activity_regularizer": null, "unit_forget_bias": true, "trainable": true, "recurrent_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_regularizer": null, "return_sequences": true, "recurrent_activation": "hard_sigmoid", "units": 32, "implementation": 0, "kernel_initializer": {"config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}, "class_name": "VarianceScaling"}, "dropout": 0.0}, "class_name": "LSTM"}, {"config": {"activation": "tanh", "name": "lstm_3", "kernel_regularizer": null, "use_bias": true, "unroll": false, "bias_constraint": null, "recurrent_dropout": 0.0, "go_backwards": false, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "stateful": false, "activity_regularizer": null, "unit_forget_bias": true, "trainable": true, "recurrent_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_regularizer": null, "return_sequences": true, "recurrent_activation": "hard_sigmoid", "units": 2, "implementation": 0, "kernel_initializer": {"config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}, "class_name": "VarianceScaling"}, "dropout": 0.0}, "class_name": "LSTM"}, {"config": {"activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "name": "dense_1", "units": 1, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "class_name": "Sequential"}