{"class_name": "Sequential", "keras_version": "2.0.2", "config": [{"class_name": "LSTM", "config": {"unit_forget_bias": true, "use_bias": true, "return_sequences": true, "activity_regularizer": null, "units": 32, "bias_constraint": null, "kernel_constraint": null, "dropout": 0.0, "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_regularizer": null, "implementation": 0, "stateful": false, "trainable": true, "go_backwards": false, "kernel_regularizer": null, "batch_input_shape": [null, 1, 52], "dtype": "float32", "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "recurrent_dropout": 0.0, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "name": "lstm_1"}}, {"class_name": "LSTM", "config": {"unit_forget_bias": true, "use_bias": true, "return_sequences": true, "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_constraint": null, "kernel_constraint": null, "dropout": 0.0, "unroll": false, "units": 32, "bias_regularizer": null, "implementation": 0, "stateful": false, "trainable": true, "go_backwards": false, "kernel_regularizer": null, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "recurrent_dropout": 0.0, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "name": "lstm_2"}}, {"class_name": "LSTM", "config": {"unit_forget_bias": true, "use_bias": true, "return_sequences": true, "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_constraint": null, "kernel_constraint": null, "dropout": 0.0, "unroll": false, "units": 32, "bias_regularizer": null, "implementation": 0, "stateful": false, "trainable": true, "go_backwards": false, "kernel_regularizer": null, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "recurrent_dropout": 0.0, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "name": "lstm_3"}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "units": 1, "bias_regularizer": null, "activation": "relu", "name": "dense_1", "trainable": true}}], "backend": "tensorflow"}