{"class_name": "Sequential", "keras_version": "2.0.2", "config": [{"class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "recurrent_regularizer": null, "stateful": false, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "dtype": "float32", "go_backwards": false, "activity_regularizer": null, "implementation": 0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "batch_input_shape": [null, 1, 48], "return_sequences": true, "unit_forget_bias": true, "kernel_regularizer": null, "activation": "tanh", "units": 64, "recurrent_dropout": 0.0, "name": "lstm_1", "trainable": true, "unroll": false}}, {"class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "recurrent_regularizer": null, "stateful": false, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "bias_constraint": null, "go_backwards": false, "unit_forget_bias": true, "implementation": 0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "activity_regularizer": null, "kernel_regularizer": null, "activation": "tanh", "units": 8, "recurrent_dropout": 0.0, "name": "lstm_2", "trainable": true, "unroll": false}}, {"class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "recurrent_regularizer": null, "stateful": false, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "bias_constraint": null, "go_backwards": false, "unit_forget_bias": true, "implementation": 0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "activity_regularizer": null, "kernel_regularizer": null, "activation": "tanh", "units": 2, "recurrent_dropout": 0.0, "name": "lstm_3", "trainable": true, "unroll": false}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "activation": "relu", "units": 1, "bias_constraint": null, "name": "dense_1", "trainable": true}}], "backend": "tensorflow"}