{"keras_version": "2.0.2", "backend": "tensorflow", "config": [{"config": {"dropout": 0.0, "bias_constraint": null, "go_backwards": false, "recurrent_regularizer": null, "batch_input_shape": [null, 1, 48], "use_bias": true, "activation": "tanh", "recurrent_dropout": 0.0, "return_sequences": true, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "recurrent_activation": "hard_sigmoid", "trainable": true, "dtype": "float32", "bias_regularizer": null, "recurrent_constraint": null, "unit_forget_bias": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "units": 2, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "lstm_1", "activity_regularizer": null, "kernel_regularizer": null, "unroll": false, "implementation": 0, "stateful": false, "kernel_constraint": null}, "class_name": "LSTM"}, {"config": {"dropout": 0.0, "bias_constraint": null, "trainable": true, "recurrent_regularizer": null, "kernel_constraint": null, "use_bias": true, "activation": "tanh", "recurrent_dropout": 0.0, "return_sequences": true, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_regularizer": null, "recurrent_constraint": null, "unit_forget_bias": true, "units": 2, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "lstm_2", "activity_regularizer": null, "kernel_regularizer": null, "unroll": false, "implementation": 0, "stateful": false}, "class_name": "LSTM"}, {"config": {"dropout": 0.0, "bias_constraint": null, "trainable": true, "recurrent_regularizer": null, "kernel_constraint": null, "use_bias": true, "activation": "tanh", "recurrent_dropout": 0.0, "return_sequences": true, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_regularizer": null, "recurrent_constraint": null, "unit_forget_bias": true, "units": 2, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "lstm_3", "activity_regularizer": null, "kernel_regularizer": null, "unroll": false, "implementation": 0, "stateful": false}, "class_name": "LSTM"}, {"config": {"dropout": 0.0, "bias_constraint": null, "trainable": true, "recurrent_regularizer": null, "kernel_constraint": null, "use_bias": true, "activation": "tanh", "recurrent_dropout": 0.0, "return_sequences": true, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_regularizer": null, "recurrent_constraint": null, "unit_forget_bias": true, "units": 2, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "lstm_4", "activity_regularizer": null, "kernel_regularizer": null, "unroll": false, "implementation": 0, "stateful": false}, "class_name": "LSTM"}, {"config": {"dropout": 0.0, "bias_constraint": null, "trainable": true, "recurrent_regularizer": null, "kernel_constraint": null, "use_bias": true, "activation": "tanh", "recurrent_dropout": 0.0, "return_sequences": true, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_regularizer": null, "recurrent_constraint": null, "unit_forget_bias": true, "units": 2, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "lstm_5", "activity_regularizer": null, "kernel_regularizer": null, "unroll": false, "implementation": 0, "stateful": false}, "class_name": "LSTM"}, {"config": {"dropout": 0.0, "bias_constraint": null, "trainable": true, "recurrent_regularizer": null, "kernel_constraint": null, "use_bias": true, "activation": "tanh", "recurrent_dropout": 0.0, "return_sequences": true, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_regularizer": null, "recurrent_constraint": null, "unit_forget_bias": true, "units": 2, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "lstm_6", "activity_regularizer": null, "kernel_regularizer": null, "unroll": false, "implementation": 0, "stateful": false}, "class_name": "LSTM"}, {"config": {"bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_constraint": null, "name": "dense_1", "use_bias": true, "activation": "relu", "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "bias_regularizer": null, "units": 1}, "class_name": "Dense"}], "class_name": "Sequential"}