{"keras_version": "2.0.2", "config": [{"config": {"recurrent_activation": "hard_sigmoid", "bias_regularizer": null, "recurrent_constraint": null, "stateful": false, "batch_input_shape": [null, 1, 48], "implementation": 0, "dropout": 0.0, "trainable": true, "go_backwards": false, "activity_regularizer": null, "recurrent_regularizer": null, "unit_forget_bias": true, "unroll": false, "recurrent_dropout": 0.0, "use_bias": true, "kernel_constraint": null, "activation": "tanh", "bias_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "return_sequences": true, "kernel_regularizer": null, "units": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "name": "lstm_1"}, "class_name": "LSTM"}, {"config": {"bias_regularizer": null, "recurrent_constraint": null, "stateful": false, "go_backwards": false, "return_sequences": true, "dropout": 0.0, "implementation": 0, "trainable": true, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "recurrent_regularizer": null, "unit_forget_bias": true, "recurrent_dropout": 0.0, "use_bias": true, "kernel_constraint": null, "activation": "tanh", "bias_constraint": null, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "unroll": false, "kernel_regularizer": null, "units": 8, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "name": "lstm_2"}, "class_name": "LSTM"}, {"config": {"bias_regularizer": null, "recurrent_constraint": null, "stateful": false, "go_backwards": false, "return_sequences": true, "dropout": 0.0, "implementation": 0, "trainable": true, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "recurrent_regularizer": null, "unit_forget_bias": true, "recurrent_dropout": 0.0, "use_bias": true, "kernel_constraint": null, "activation": "tanh", "bias_constraint": null, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "unroll": false, "kernel_regularizer": null, "units": 2, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "name": "lstm_3"}, "class_name": "LSTM"}, {"config": {"kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "trainable": true, "units": 1, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1"}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential"}