{"class_name": "Sequential", "keras_version": "2.0.2", "config": [{"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_1", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "activity_regularizer": null, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "unroll": false, "activation": "tanh", "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "go_backwards": false, "dtype": "float32", "stateful": false, "unit_forget_bias": true, "implementation": 0, "use_bias": true, "units": 2, "bias_constraint": null, "batch_input_shape": [null, 1, 52], "bias_regularizer": null, "return_sequences": true, "kernel_constraint": null, "recurrent_dropout": 0.0, "kernel_regularizer": null, "recurrent_constraint": null, "trainable": true}}, {"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_2", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "activity_regularizer": null, "dropout": 0.0, "go_backwards": false, "unroll": false, "activation": "tanh", "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "unit_forget_bias": true, "implementation": 0, "use_bias": true, "units": 8, "bias_constraint": null, "recurrent_dropout": 0.0, "bias_regularizer": null, "return_sequences": true, "stateful": false, "kernel_regularizer": null, "recurrent_constraint": null, "trainable": true}}, {"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_3", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "activity_regularizer": null, "dropout": 0.0, "go_backwards": false, "unroll": false, "activation": "tanh", "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "unit_forget_bias": true, "implementation": 0, "use_bias": true, "units": 16, "bias_constraint": null, "recurrent_dropout": 0.0, "bias_regularizer": null, "return_sequences": true, "stateful": false, "kernel_regularizer": null, "recurrent_constraint": null, "trainable": true}}, {"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_4", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "activity_regularizer": null, "dropout": 0.0, "go_backwards": false, "unroll": false, "activation": "tanh", "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "unit_forget_bias": true, "implementation": 0, "use_bias": true, "units": 128, "bias_constraint": null, "recurrent_dropout": 0.0, "bias_regularizer": null, "return_sequences": true, "stateful": false, "kernel_regularizer": null, "recurrent_constraint": null, "trainable": true}}, {"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_5", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "activity_regularizer": null, "dropout": 0.0, "go_backwards": false, "unroll": false, "activation": "tanh", "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "unit_forget_bias": true, "implementation": 0, "use_bias": true, "units": 128, "bias_constraint": null, "recurrent_dropout": 0.0, "bias_regularizer": null, "return_sequences": true, "stateful": false, "kernel_regularizer": null, "recurrent_constraint": null, "trainable": true}}, {"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_6", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "activity_regularizer": null, "dropout": 0.0, "go_backwards": false, "unroll": false, "activation": "tanh", "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "unit_forget_bias": true, "implementation": 0, "use_bias": true, "units": 128, "bias_constraint": null, "recurrent_dropout": 0.0, "bias_regularizer": null, "return_sequences": true, "stateful": false, "kernel_regularizer": null, "recurrent_constraint": null, "trainable": true}}, {"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_7", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "activity_regularizer": null, "dropout": 0.0, "go_backwards": false, "unroll": false, "activation": "tanh", "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "unit_forget_bias": true, "implementation": 0, "use_bias": true, "units": 16, "bias_constraint": null, "recurrent_dropout": 0.0, "bias_regularizer": null, "return_sequences": true, "stateful": false, "kernel_regularizer": null, "recurrent_constraint": null, "trainable": true}}, {"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_8", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "activity_regularizer": null, "dropout": 0.0, "go_backwards": false, "unroll": false, "activation": "tanh", "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "unit_forget_bias": true, "implementation": 0, "use_bias": true, "units": 8, "bias_constraint": null, "recurrent_dropout": 0.0, "bias_regularizer": null, "return_sequences": true, "stateful": false, "kernel_regularizer": null, "recurrent_constraint": null, "trainable": true}}, {"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_9", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "activity_regularizer": null, "dropout": 0.0, "go_backwards": false, "unroll": false, "activation": "tanh", "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "unit_forget_bias": true, "implementation": 0, "use_bias": true, "units": 2, "bias_constraint": null, "recurrent_dropout": 0.0, "bias_regularizer": null, "return_sequences": true, "stateful": false, "kernel_regularizer": null, "recurrent_constraint": null, "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "use_bias": true, "units": 1, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true}}], "backend": "tensorflow"}