{"backend": "tensorflow", "keras_version": "2.0.2", "config": [{"class_name": "LSTM", "config": {"activation": "tanh", "dtype": "float32", "activity_regularizer": null, "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "recurrent_dropout": 0.0, "kernel_constraint": null, "bias_constraint": null, "go_backwards": false, "recurrent_regularizer": null, "recurrent_constraint": null, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unroll": false, "name": "lstm_1", "use_bias": true, "implementation": 0, "batch_input_shape": [null, 1, 48], "units": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "trainable": true}}, {"class_name": "LSTM", "config": {"activation": "tanh", "activity_regularizer": null, "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "recurrent_dropout": 0.0, "kernel_constraint": null, "bias_constraint": null, "go_backwards": false, "recurrent_regularizer": null, "recurrent_constraint": null, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_regularizer": null, "name": "lstm_2", "use_bias": true, "implementation": 0, "units": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "bias_regularizer": null, "unroll": false, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "trainable": true}}, {"class_name": "LSTM", "config": {"activation": "tanh", "activity_regularizer": null, "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "recurrent_dropout": 0.0, "kernel_constraint": null, "bias_constraint": null, "go_backwards": false, "recurrent_regularizer": null, "recurrent_constraint": null, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_regularizer": null, "name": "lstm_3", "use_bias": true, "implementation": 0, "units": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "bias_regularizer": null, "unroll": false, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "trainable": true}}, {"class_name": "LSTM", "config": {"activation": "tanh", "activity_regularizer": null, "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "recurrent_dropout": 0.0, "kernel_constraint": null, "bias_constraint": null, "go_backwards": false, "recurrent_regularizer": null, "recurrent_constraint": null, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_regularizer": null, "name": "lstm_4", "use_bias": true, "implementation": 0, "units": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "bias_regularizer": null, "unroll": false, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "trainable": true}}, {"class_name": "LSTM", "config": {"activation": "tanh", "activity_regularizer": null, "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "recurrent_dropout": 0.0, "kernel_constraint": null, "bias_constraint": null, "go_backwards": false, "recurrent_regularizer": null, "recurrent_constraint": null, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_regularizer": null, "name": "lstm_5", "use_bias": true, "implementation": 0, "units": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "bias_regularizer": null, "unroll": false, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "trainable": true}}, {"class_name": "LSTM", "config": {"activation": "tanh", "activity_regularizer": null, "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "recurrent_dropout": 0.0, "kernel_constraint": null, "bias_constraint": null, "go_backwards": false, "recurrent_regularizer": null, "recurrent_constraint": null, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_regularizer": null, "name": "lstm_6", "use_bias": true, "implementation": 0, "units": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "bias_regularizer": null, "unroll": false, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "use_bias": true, "activation": "relu", "activity_regularizer": null, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "trainable": true}}], "class_name": "Sequential"}