{"config": [{"config": {"recurrent_regularizer": null, "kernel_constraint": null, "stateful": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "lstm_1", "dtype": "float32", "activation": "tanh", "recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_dropout": 0.0, "implementation": 0, "recurrent_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "return_sequences": true, "batch_input_shape": [null, 1, 52], "units": 128, "go_backwards": false, "unit_forget_bias": true, "bias_constraint": null, "unroll": false, "dropout": 0.0, "kernel_initializer": {"config": {"seed": null, "mode": "fan_in", "distribution": "normal", "scale": 2.0}, "class_name": "VarianceScaling"}, "use_bias": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_regularizer": null}, "class_name": "LSTM"}, {"config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "units": 1, "kernel_initializer": {"config": {"seed": null, "mode": "fan_in", "distribution": "normal", "scale": 2.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activation": "relu", "trainable": true, "name": "dense_1", "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}], "keras_version": "2.0.2", "backend": "tensorflow", "class_name": "Sequential"}