{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"batch_input_shape": [null, 1, 48], "implementation": 0, "activity_regularizer": null, "units": 2, "bias_regularizer": null, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "unit_forget_bias": true, "trainable": true, "name": "lstm_1", "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "stateful": false, "recurrent_dropout": 0.0, "dropout": 0.0, "kernel_constraint": null, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "kernel_regularizer": null, "unroll": false, "dtype": "float32", "activation": "tanh", "return_sequences": true}}, {"class_name": "LSTM", "config": {"implementation": 0, "activity_regularizer": null, "units": 2, "bias_regularizer": null, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "name": "lstm_2", "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "stateful": false, "recurrent_dropout": 0.0, "unit_forget_bias": true, "use_bias": true, "dropout": 0.0, "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "kernel_regularizer": null, "unroll": false, "activation": "tanh", "return_sequences": true}}, {"class_name": "LSTM", "config": {"implementation": 0, "activity_regularizer": null, "units": 2, "bias_regularizer": null, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "name": "lstm_3", "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "stateful": false, "recurrent_dropout": 0.0, "unit_forget_bias": true, "use_bias": true, "dropout": 0.0, "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "kernel_regularizer": null, "unroll": false, "activation": "tanh", "return_sequences": true}}, {"class_name": "LSTM", "config": {"implementation": 0, "activity_regularizer": null, "units": 2, "bias_regularizer": null, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "name": "lstm_4", "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "stateful": false, "recurrent_dropout": 0.0, "unit_forget_bias": true, "use_bias": true, "dropout": 0.0, "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "kernel_regularizer": null, "unroll": false, "activation": "tanh", "return_sequences": true}}, {"class_name": "LSTM", "config": {"implementation": 0, "activity_regularizer": null, "units": 2, "bias_regularizer": null, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "name": "lstm_5", "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "stateful": false, "recurrent_dropout": 0.0, "unit_forget_bias": true, "use_bias": true, "dropout": 0.0, "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "kernel_regularizer": null, "unroll": false, "activation": "tanh", "return_sequences": true}}, {"class_name": "LSTM", "config": {"implementation": 0, "activity_regularizer": null, "units": 2, "bias_regularizer": null, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "name": "lstm_6", "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "stateful": false, "recurrent_dropout": 0.0, "unit_forget_bias": true, "use_bias": true, "dropout": 0.0, "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "kernel_regularizer": null, "unroll": false, "activation": "tanh", "return_sequences": true}}, {"class_name": "Dense", "config": {"use_bias": true, "activity_regularizer": null, "units": 1, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "name": "dense_1", "activation": "relu"}}], "keras_version": "2.0.2"}