{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "batch_input_shape": [null, 1, 52], "unroll": false, "kernel_regularizer": null, "implementation": 0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "trainable": true, "name": "lstm_1", "stateful": false, "go_backwards": false, "unit_forget_bias": true, "activity_regularizer": null, "units": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "return_sequences": true, "use_bias": true, "kernel_constraint": null, "recurrent_constraint": null, "recurrent_dropout": 0.0, "activation": "tanh", "recurrent_regularizer": null, "bias_regularizer": null, "dtype": "float32", "dropout": 0.0}}, {"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "activation": "tanh", "unroll": false, "kernel_regularizer": null, "implementation": 0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "trainable": true, "name": "lstm_2", "stateful": false, "go_backwards": false, "unit_forget_bias": true, "activity_regularizer": null, "units": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "return_sequences": true, "use_bias": true, "kernel_constraint": null, "recurrent_constraint": null, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "bias_regularizer": null, "dropout": 0.0}}, {"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "activation": "tanh", "unroll": false, "kernel_regularizer": null, "implementation": 0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "trainable": true, "name": "lstm_3", "stateful": false, "go_backwards": false, "unit_forget_bias": true, "activity_regularizer": null, "units": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "return_sequences": true, "use_bias": true, "kernel_constraint": null, "recurrent_constraint": null, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "bias_regularizer": null, "dropout": 0.0}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "bias_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "name": "dense_1", "bias_regularizer": null}}], "backend": "tensorflow", "keras_version": "2.0.2"}