{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"trainable": true, "batch_input_shape": [null, 1, 52], "recurrent_activation": "hard_sigmoid", "stateful": false, "return_sequences": true, "unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "unroll": false, "go_backwards": false, "recurrent_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "dtype": "float32", "bias_constraint": null, "name": "lstm_1", "implementation": 0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "recurrent_constraint": null, "activation": "tanh", "kernel_regularizer": null, "dropout": 0.0, "bias_regularizer": null, "units": 64, "recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LSTM", "config": {"trainable": true, "unroll": false, "recurrent_activation": "hard_sigmoid", "stateful": false, "return_sequences": true, "unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "go_backwards": false, "recurrent_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "name": "lstm_2", "implementation": 0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "recurrent_constraint": null, "activation": "tanh", "kernel_regularizer": null, "dropout": 0.0, "bias_regularizer": null, "units": 2, "recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "units": 1, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null}}], "keras_version": "2.0.2"}