{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "recurrent_activation": "hard_sigmoid", "implementation": 0, "activity_regularizer": null, "kernel_constraint": null, "dtype": "float32", "trainable": true, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "name": "lstm_1", "return_sequences": true, "recurrent_regularizer": null, "units": 128, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true, "go_backwards": false, "use_bias": true, "stateful": false, "bias_constraint": null, "recurrent_dropout": 0.0, "recurrent_constraint": null, "activation": "tanh", "batch_input_shape": [null, 1, 52]}}, {"class_name": "LSTM", "config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "recurrent_activation": "hard_sigmoid", "implementation": 0, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "name": "lstm_2", "return_sequences": true, "recurrent_regularizer": null, "units": 64, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true, "go_backwards": false, "use_bias": true, "stateful": false, "bias_constraint": null, "recurrent_dropout": 0.0, "recurrent_constraint": null, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "recurrent_activation": "hard_sigmoid", "implementation": 0, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "name": "lstm_3", "return_sequences": true, "recurrent_regularizer": null, "units": 32, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true, "go_backwards": false, "use_bias": true, "stateful": false, "bias_constraint": null, "recurrent_dropout": 0.0, "recurrent_constraint": null, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "recurrent_activation": "hard_sigmoid", "implementation": 0, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "name": "lstm_4", "return_sequences": true, "recurrent_regularizer": null, "units": 16, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true, "go_backwards": false, "use_bias": true, "stateful": false, "bias_constraint": null, "recurrent_dropout": 0.0, "recurrent_constraint": null, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "recurrent_activation": "hard_sigmoid", "implementation": 0, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "name": "lstm_5", "return_sequences": true, "recurrent_regularizer": null, "units": 8, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true, "go_backwards": false, "use_bias": true, "stateful": false, "bias_constraint": null, "recurrent_dropout": 0.0, "recurrent_constraint": null, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "recurrent_activation": "hard_sigmoid", "implementation": 0, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "name": "lstm_6", "return_sequences": true, "recurrent_regularizer": null, "units": 4, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true, "go_backwards": false, "use_bias": true, "stateful": false, "bias_constraint": null, "recurrent_dropout": 0.0, "recurrent_constraint": null, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "recurrent_activation": "hard_sigmoid", "implementation": 0, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "name": "lstm_7", "return_sequences": true, "recurrent_regularizer": null, "units": 2, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true, "go_backwards": false, "use_bias": true, "stateful": false, "bias_constraint": null, "recurrent_dropout": 0.0, "recurrent_constraint": null, "activation": "tanh"}}, {"class_name": "Dense", "config": {"name": "dense_1", "bias_regularizer": null, "units": 1, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "activation": "relu"}}], "keras_version": "2.0.2"}