{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.2", "config": [{"class_name": "LSTM", "config": {"use_bias": true, "unit_forget_bias": true, "bias_constraint": null, "activation": "tanh", "recurrent_regularizer": null, "dropout": 0.0, "stateful": false, "dtype": "float32", "return_sequences": true, "implementation": 0, "batch_input_shape": [null, 1, 48], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "unroll": false, "trainable": true, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "activity_regularizer": null, "recurrent_constraint": null, "go_backwards": false, "name": "lstm_1"}}, {"class_name": "LSTM", "config": {"use_bias": true, "unit_forget_bias": true, "bias_constraint": null, "activation": "tanh", "recurrent_regularizer": null, "dropout": 0.0, "stateful": false, "activity_regularizer": null, "return_sequences": true, "implementation": 0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 4, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "unroll": false, "trainable": true, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_constraint": null, "go_backwards": false, "name": "lstm_2"}}, {"class_name": "LSTM", "config": {"use_bias": true, "unit_forget_bias": true, "bias_constraint": null, "activation": "tanh", "recurrent_regularizer": null, "dropout": 0.0, "stateful": false, "activity_regularizer": null, "return_sequences": true, "implementation": 0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 8, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "unroll": false, "trainable": true, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_constraint": null, "go_backwards": false, "name": "lstm_3"}}, {"class_name": "LSTM", "config": {"use_bias": true, "unit_forget_bias": true, "bias_constraint": null, "activation": "tanh", "recurrent_regularizer": null, "dropout": 0.0, "stateful": false, "activity_regularizer": null, "return_sequences": true, "implementation": 0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "unroll": false, "trainable": true, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_constraint": null, "go_backwards": false, "name": "lstm_4"}}, {"class_name": "LSTM", "config": {"use_bias": true, "unit_forget_bias": true, "bias_constraint": null, "activation": "tanh", "recurrent_regularizer": null, "dropout": 0.0, "stateful": false, "activity_regularizer": null, "return_sequences": true, "implementation": 0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 8, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "unroll": false, "trainable": true, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_constraint": null, "go_backwards": false, "name": "lstm_5"}}, {"class_name": "LSTM", "config": {"use_bias": true, "unit_forget_bias": true, "bias_constraint": null, "activation": "tanh", "recurrent_regularizer": null, "dropout": 0.0, "stateful": false, "activity_regularizer": null, "return_sequences": true, "implementation": 0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 4, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "unroll": false, "trainable": true, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_constraint": null, "go_backwards": false, "name": "lstm_6"}}, {"class_name": "LSTM", "config": {"use_bias": true, "unit_forget_bias": true, "bias_constraint": null, "activation": "tanh", "recurrent_regularizer": null, "dropout": 0.0, "stateful": false, "activity_regularizer": null, "return_sequences": true, "implementation": 0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "unroll": false, "trainable": true, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_constraint": null, "go_backwards": false, "name": "lstm_7"}}, {"class_name": "Dense", "config": {"use_bias": true, "units": 1, "bias_constraint": null, "activation": "relu", "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "name": "dense_1", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}]}