{"keras_version": "2.0.2", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"recurrent_regularizer": null, "kernel_regularizer": null, "recurrent_dropout": 0.0, "activity_regularizer": null, "dtype": "float32", "name": "lstm_1", "dropout": 0.0, "unroll": false, "kernel_constraint": null, "bias_constraint": null, "batch_input_shape": [null, 1, 52], "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "trainable": true, "implementation": 0, "recurrent_constraint": null, "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "return_sequences": true, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "units": 2, "unit_forget_bias": true, "activation": "tanh", "recurrent_activation": "hard_sigmoid"}}, {"class_name": "LSTM", "config": {"recurrent_regularizer": null, "kernel_regularizer": null, "recurrent_dropout": 0.0, "kernel_constraint": null, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "name": "lstm_2", "unroll": false, "stateful": false, "bias_constraint": null, "dropout": 0.0, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "trainable": true, "implementation": 0, "recurrent_constraint": null, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "units": 8, "activation": "tanh", "unit_forget_bias": true}}, {"class_name": "LSTM", "config": {"recurrent_regularizer": null, "kernel_regularizer": null, "recurrent_dropout": 0.0, "kernel_constraint": null, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "name": "lstm_3", "unroll": false, "stateful": false, "bias_constraint": null, "dropout": 0.0, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "trainable": true, "implementation": 0, "recurrent_constraint": null, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "units": 16, "activation": "tanh", "unit_forget_bias": true}}, {"class_name": "LSTM", "config": {"recurrent_regularizer": null, "kernel_regularizer": null, "recurrent_dropout": 0.0, "kernel_constraint": null, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "name": "lstm_4", "unroll": false, "stateful": false, "bias_constraint": null, "dropout": 0.0, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "trainable": true, "implementation": 0, "recurrent_constraint": null, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "units": 128, "activation": "tanh", "unit_forget_bias": true}}, {"class_name": "LSTM", "config": {"recurrent_regularizer": null, "kernel_regularizer": null, "recurrent_dropout": 0.0, "kernel_constraint": null, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "name": "lstm_5", "unroll": false, "stateful": false, "bias_constraint": null, "dropout": 0.0, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "trainable": true, "implementation": 0, "recurrent_constraint": null, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "units": 16, "activation": "tanh", "unit_forget_bias": true}}, {"class_name": "LSTM", "config": {"recurrent_regularizer": null, "kernel_regularizer": null, "recurrent_dropout": 0.0, "kernel_constraint": null, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "name": "lstm_6", "unroll": false, "stateful": false, "bias_constraint": null, "dropout": 0.0, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "trainable": true, "implementation": 0, "recurrent_constraint": null, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "units": 8, "activation": "tanh", "unit_forget_bias": true}}, {"class_name": "LSTM", "config": {"recurrent_regularizer": null, "kernel_regularizer": null, "recurrent_dropout": 0.0, "kernel_constraint": null, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "name": "lstm_7", "unroll": false, "stateful": false, "bias_constraint": null, "dropout": 0.0, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "trainable": true, "implementation": 0, "recurrent_constraint": null, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "units": 2, "activation": "tanh", "unit_forget_bias": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "trainable": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "units": 1, "bias_constraint": null, "kernel_regularizer": null, "name": "dense_1", "activation": "relu"}}], "backend": "tensorflow"}