{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"dropout": 0.0, "return_sequences": true, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "go_backwards": false, "stateful": false, "unit_forget_bias": true, "unroll": false, "dtype": "float32", "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "name": "lstm_1", "bias_constraint": null, "use_bias": true, "implementation": 0, "recurrent_dropout": 0.0, "activation": "tanh", "batch_input_shape": [null, 1, 52], "recurrent_regularizer": null, "recurrent_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "name": "dense_1", "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "units": 1, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "kernel_regularizer": null}}], "keras_version": "2.0.2"}