{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"name": "lstm_1", "implementation": 0, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_regularizer": null, "recurrent_regularizer": null, "units": 2, "trainable": true, "activation": "tanh", "kernel_regularizer": null, "recurrent_constraint": null, "return_sequences": true, "activity_regularizer": null, "unit_forget_bias": true, "batch_input_shape": [null, 1, 48], "go_backwards": false, "recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "use_bias": true, "dtype": "float32", "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "unroll": false}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.2, "trainable": true}}, {"class_name": "LSTM", "config": {"name": "lstm_2", "implementation": 0, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_regularizer": null, "recurrent_regularizer": null, "units": 8, "trainable": true, "activation": "tanh", "kernel_regularizer": null, "recurrent_constraint": null, "return_sequences": true, "activity_regularizer": null, "unit_forget_bias": true, "go_backwards": false, "recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "use_bias": true, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "unroll": false}}, {"class_name": "LSTM", "config": {"name": "lstm_3", "implementation": 0, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_regularizer": null, "recurrent_regularizer": null, "units": 16, "trainable": true, "activation": "tanh", "kernel_regularizer": null, "recurrent_constraint": null, "return_sequences": true, "activity_regularizer": null, "unit_forget_bias": true, "go_backwards": false, "recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "use_bias": true, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "unroll": false}}, {"class_name": "LSTM", "config": {"name": "lstm_4", "implementation": 0, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_regularizer": null, "recurrent_regularizer": null, "units": 128, "trainable": true, "activation": "tanh", "kernel_regularizer": null, "recurrent_constraint": null, "return_sequences": true, "activity_regularizer": null, "unit_forget_bias": true, "go_backwards": false, "recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "use_bias": true, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "unroll": false}}, {"class_name": "LSTM", "config": {"name": "lstm_5", "implementation": 0, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_regularizer": null, "recurrent_regularizer": null, "units": 16, "trainable": true, "activation": "tanh", "kernel_regularizer": null, "recurrent_constraint": null, "return_sequences": true, "activity_regularizer": null, "unit_forget_bias": true, "go_backwards": false, "recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "use_bias": true, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "unroll": false}}, {"class_name": "LSTM", "config": {"name": "lstm_6", "implementation": 0, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_regularizer": null, "recurrent_regularizer": null, "units": 8, "trainable": true, "activation": "tanh", "kernel_regularizer": null, "recurrent_constraint": null, "return_sequences": true, "activity_regularizer": null, "unit_forget_bias": true, "go_backwards": false, "recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "use_bias": true, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "unroll": false}}, {"class_name": "LSTM", "config": {"name": "lstm_7", "implementation": 0, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_regularizer": null, "recurrent_regularizer": null, "units": 2, "trainable": true, "activation": "tanh", "kernel_regularizer": null, "recurrent_constraint": null, "return_sequences": true, "activity_regularizer": null, "unit_forget_bias": true, "go_backwards": false, "recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "use_bias": true, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "unroll": false}}, {"class_name": "Dense", "config": {"name": "dense_1", "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "units": 1, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}], "keras_version": "2.0.2", "backend": "tensorflow"}