{"config": [{"config": {"kernel_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "units": 2, "recurrent_dropout": 0.0, "name": "lstm_1", "bias_regularizer": null, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "use_bias": true, "unroll": false, "recurrent_constraint": null, "implementation": 0, "dtype": "float32", "go_backwards": false, "activity_regularizer": null, "activation": "tanh", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unit_forget_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "dropout": 0.0, "trainable": true, "stateful": false, "kernel_regularizer": null, "batch_input_shape": [null, 1, 48]}, "class_name": "LSTM"}, {"config": {"kernel_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "units": 2, "recurrent_dropout": 0.0, "name": "lstm_2", "bias_regularizer": null, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "use_bias": true, "unroll": false, "recurrent_constraint": null, "implementation": 0, "activity_regularizer": null, "activation": "tanh", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unit_forget_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "dropout": 0.0, "trainable": true, "stateful": false, "kernel_regularizer": null, "go_backwards": false}, "class_name": "LSTM"}, {"config": {"kernel_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "units": 2, "recurrent_dropout": 0.0, "name": "lstm_3", "bias_regularizer": null, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "use_bias": true, "unroll": false, "recurrent_constraint": null, "implementation": 0, "activity_regularizer": null, "activation": "tanh", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unit_forget_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "dropout": 0.0, "trainable": true, "stateful": false, "kernel_regularizer": null, "go_backwards": false}, "class_name": "LSTM"}, {"config": {"kernel_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "units": 2, "recurrent_dropout": 0.0, "name": "lstm_4", "bias_regularizer": null, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "use_bias": true, "unroll": false, "recurrent_constraint": null, "implementation": 0, "activity_regularizer": null, "activation": "tanh", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unit_forget_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "dropout": 0.0, "trainable": true, "stateful": false, "kernel_regularizer": null, "go_backwards": false}, "class_name": "LSTM"}, {"config": {"kernel_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "units": 2, "recurrent_dropout": 0.0, "name": "lstm_5", "bias_regularizer": null, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "use_bias": true, "unroll": false, "recurrent_constraint": null, "implementation": 0, "activity_regularizer": null, "activation": "tanh", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unit_forget_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "dropout": 0.0, "trainable": true, "stateful": false, "kernel_regularizer": null, "go_backwards": false}, "class_name": "LSTM"}, {"config": {"kernel_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "units": 2, "recurrent_dropout": 0.0, "name": "lstm_6", "bias_regularizer": null, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "use_bias": true, "unroll": false, "recurrent_constraint": null, "implementation": 0, "activity_regularizer": null, "activation": "tanh", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unit_forget_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "dropout": 0.0, "trainable": true, "stateful": false, "kernel_regularizer": null, "go_backwards": false}, "class_name": "LSTM"}, {"config": {"kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "name": "dense_1", "bias_regularizer": null, "trainable": true, "use_bias": true, "kernel_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.2", "backend": "tensorflow"}