{"keras_version": "2.0.2", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"return_sequences": true, "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "name": "lstm_1", "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_constraint": null, "unroll": false, "use_bias": true, "implementation": 0, "stateful": false, "recurrent_activation": "hard_sigmoid", "trainable": true, "activation": "tanh", "recurrent_regularizer": null, "bias_constraint": null, "dtype": "float32", "go_backwards": false, "unit_forget_bias": true, "units": 128, "bias_regularizer": null, "batch_input_shape": [null, 1, 52], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "recurrent_dropout": 0.0, "activity_regularizer": null}}, {"class_name": "LSTM", "config": {"return_sequences": true, "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "name": "lstm_2", "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_constraint": null, "unroll": false, "implementation": 0, "stateful": false, "recurrent_activation": "hard_sigmoid", "trainable": true, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "go_backwards": false, "unit_forget_bias": true, "units": 32, "bias_constraint": null, "use_bias": true, "recurrent_regularizer": null, "dropout": 0.0, "recurrent_dropout": 0.0, "activity_regularizer": null}}, {"class_name": "LSTM", "config": {"return_sequences": true, "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "name": "lstm_3", "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_constraint": null, "unroll": false, "implementation": 0, "stateful": false, "recurrent_activation": "hard_sigmoid", "trainable": true, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "go_backwards": false, "unit_forget_bias": true, "units": 8, "bias_constraint": null, "use_bias": true, "recurrent_regularizer": null, "dropout": 0.0, "recurrent_dropout": 0.0, "activity_regularizer": null}}, {"class_name": "LSTM", "config": {"return_sequences": true, "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "name": "lstm_4", "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_constraint": null, "unroll": false, "implementation": 0, "stateful": false, "recurrent_activation": "hard_sigmoid", "trainable": true, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "go_backwards": false, "unit_forget_bias": true, "units": 2, "bias_constraint": null, "use_bias": true, "recurrent_regularizer": null, "dropout": 0.0, "recurrent_dropout": 0.0, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "bias_regularizer": null, "name": "dense_1", "kernel_regularizer": null, "units": 1, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu", "activity_regularizer": null}}]}