{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"recurrent_constraint": null, "bias_regularizer": null, "trainable": true, "return_sequences": true, "name": "lstm_1", "recurrent_regularizer": null, "implementation": 0, "units": 32, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "stateful": false, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "activity_regularizer": null, "dtype": "float32", "dropout": 0.0, "batch_input_shape": [null, 1, 48], "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}}, "unroll": false, "activation": "tanh", "bias_constraint": null, "unit_forget_bias": true, "recurrent_dropout": 0.0, "use_bias": true}}, {"class_name": "LSTM", "config": {"recurrent_constraint": null, "units": 16, "trainable": true, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null, "implementation": 0, "bias_regularizer": null, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "stateful": false, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "activity_regularizer": null, "unit_forget_bias": true, "dropout": 0.0, "go_backwards": false, "name": "lstm_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}}, "unroll": false, "activation": "tanh", "bias_constraint": null, "recurrent_dropout": 0.0, "use_bias": true}}, {"class_name": "LSTM", "config": {"recurrent_constraint": null, "units": 4, "trainable": true, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null, "implementation": 0, "bias_regularizer": null, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "stateful": false, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "activity_regularizer": null, "unit_forget_bias": true, "dropout": 0.0, "go_backwards": false, "name": "lstm_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}}, "unroll": false, "activation": "tanh", "bias_constraint": null, "recurrent_dropout": 0.0, "use_bias": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "trainable": true, "bias_constraint": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}}, "kernel_constraint": null, "activation": "relu", "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true}}], "backend": "tensorflow", "keras_version": "2.0.2"}