{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.2", "config": [{"class_name": "LSTM", "config": {"name": "lstm_1", "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_sequences": true, "activity_regularizer": null, "activation": "tanh", "kernel_regularizer": null, "batch_input_shape": [null, 1, 48], "unit_forget_bias": true, "kernel_constraint": null, "bias_constraint": null, "implementation": 0, "recurrent_regularizer": null, "dtype": "float32", "unroll": false, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "trainable": true, "dropout": 0.0, "recurrent_dropout": 0.0, "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "units": 2}}, {"class_name": "LSTM", "config": {"name": "lstm_2", "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_sequences": true, "activity_regularizer": null, "activation": "tanh", "kernel_regularizer": null, "unit_forget_bias": true, "kernel_constraint": null, "bias_constraint": null, "implementation": 0, "recurrent_regularizer": null, "unroll": false, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "trainable": true, "dropout": 0.0, "recurrent_dropout": 0.0, "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "units": 8}}, {"class_name": "LSTM", "config": {"name": "lstm_3", "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_sequences": true, "activity_regularizer": null, "activation": "tanh", "kernel_regularizer": null, "unit_forget_bias": true, "kernel_constraint": null, "bias_constraint": null, "implementation": 0, "recurrent_regularizer": null, "unroll": false, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "trainable": true, "dropout": 0.0, "recurrent_dropout": 0.0, "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "units": 16}}, {"class_name": "LSTM", "config": {"name": "lstm_4", "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_sequences": true, "activity_regularizer": null, "activation": "tanh", "kernel_regularizer": null, "unit_forget_bias": true, "kernel_constraint": null, "bias_constraint": null, "implementation": 0, "recurrent_regularizer": null, "unroll": false, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "trainable": true, "dropout": 0.0, "recurrent_dropout": 0.0, "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "units": 128}}, {"class_name": "LSTM", "config": {"name": "lstm_5", "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_sequences": true, "activity_regularizer": null, "activation": "tanh", "kernel_regularizer": null, "unit_forget_bias": true, "kernel_constraint": null, "bias_constraint": null, "implementation": 0, "recurrent_regularizer": null, "unroll": false, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "trainable": true, "dropout": 0.0, "recurrent_dropout": 0.0, "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "units": 16}}, {"class_name": "LSTM", "config": {"name": "lstm_6", "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_sequences": true, "activity_regularizer": null, "activation": "tanh", "kernel_regularizer": null, "unit_forget_bias": true, "kernel_constraint": null, "bias_constraint": null, "implementation": 0, "recurrent_regularizer": null, "unroll": false, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "trainable": true, "dropout": 0.0, "recurrent_dropout": 0.0, "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "units": 8}}, {"class_name": "LSTM", "config": {"name": "lstm_7", "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_sequences": true, "activity_regularizer": null, "activation": "tanh", "kernel_regularizer": null, "unit_forget_bias": true, "kernel_constraint": null, "bias_constraint": null, "implementation": 0, "recurrent_regularizer": null, "unroll": false, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "trainable": true, "dropout": 0.0, "recurrent_dropout": 0.0, "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "units": 2}}, {"class_name": "Dense", "config": {"name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "trainable": true, "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "units": 1}}]}