{"class_name": "Sequential", "keras_version": "2.0.2", "config": [{"class_name": "LSTM", "config": {"name": "lstm_1", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unroll": false, "trainable": true, "stateful": false, "unit_forget_bias": true, "kernel_regularizer": null, "batch_input_shape": [null, 1, 52], "recurrent_dropout": 0.0, "bias_constraint": null, "bias_regularizer": null, "implementation": 0, "recurrent_constraint": null, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "activation": "tanh", "dropout": 0.0, "activity_regularizer": null, "return_sequences": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "units": 128, "use_bias": true}}, {"class_name": "LSTM", "config": {"name": "lstm_2", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unroll": false, "trainable": true, "stateful": false, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_dropout": 0.0, "bias_constraint": null, "recurrent_regularizer": null, "implementation": 0, "recurrent_constraint": null, "go_backwards": false, "activation": "tanh", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "activity_regularizer": null, "bias_regularizer": null, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 32, "use_bias": true}}, {"class_name": "LSTM", "config": {"name": "lstm_3", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unroll": false, "trainable": true, "stateful": false, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_dropout": 0.0, "bias_constraint": null, "recurrent_regularizer": null, "implementation": 0, "recurrent_constraint": null, "go_backwards": false, "activation": "tanh", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "activity_regularizer": null, "bias_regularizer": null, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "use_bias": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "units": 1}}], "backend": "tensorflow"}