{"class_name": "Sequential", "keras_version": "2.0.2", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"use_bias": true, "batch_input_shape": [null, 1, 52], "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 0, "name": "lstm_1", "bias_regularizer": null, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "activation": "tanh", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}}, "dtype": "float32", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unit_forget_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "go_backwards": false, "stateful": false, "units": 2, "dropout": 0.0, "bias_constraint": null, "return_sequences": true, "activity_regularizer": null, "unroll": false, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "LSTM", "config": {"use_bias": true, "recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 0, "name": "lstm_2", "bias_regularizer": null, "recurrent_regularizer": null, "activation": "tanh", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}}, "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unit_forget_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "go_backwards": false, "stateful": false, "units": 8, "dropout": 0.0, "bias_constraint": null, "activity_regularizer": null, "return_sequences": true, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "LSTM", "config": {"use_bias": true, "recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 0, "name": "lstm_3", "bias_regularizer": null, "recurrent_regularizer": null, "activation": "tanh", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}}, "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unit_forget_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "go_backwards": false, "stateful": false, "units": 16, "dropout": 0.0, "bias_constraint": null, "activity_regularizer": null, "return_sequences": true, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "LSTM", "config": {"use_bias": true, "recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 0, "name": "lstm_4", "bias_regularizer": null, "recurrent_regularizer": null, "activation": "tanh", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}}, "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unit_forget_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "go_backwards": false, "stateful": false, "units": 64, "dropout": 0.0, "bias_constraint": null, "activity_regularizer": null, "return_sequences": true, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "LSTM", "config": {"use_bias": true, "recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 0, "name": "lstm_5", "bias_regularizer": null, "recurrent_regularizer": null, "activation": "tanh", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}}, "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unit_forget_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "go_backwards": false, "stateful": false, "units": 128, "dropout": 0.0, "bias_constraint": null, "activity_regularizer": null, "return_sequences": true, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "LSTM", "config": {"use_bias": true, "recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 0, "name": "lstm_6", "bias_regularizer": null, "recurrent_regularizer": null, "activation": "tanh", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}}, "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unit_forget_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "go_backwards": false, "stateful": false, "units": 64, "dropout": 0.0, "bias_constraint": null, "activity_regularizer": null, "return_sequences": true, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "LSTM", "config": {"use_bias": true, "recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 0, "name": "lstm_7", "bias_regularizer": null, "recurrent_regularizer": null, "activation": "tanh", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}}, "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unit_forget_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "go_backwards": false, "stateful": false, "units": 16, "dropout": 0.0, "bias_constraint": null, "activity_regularizer": null, "return_sequences": true, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "LSTM", "config": {"use_bias": true, "recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 0, "name": "lstm_8", "bias_regularizer": null, "recurrent_regularizer": null, "activation": "tanh", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}}, "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unit_forget_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "go_backwards": false, "stateful": false, "units": 8, "dropout": 0.0, "bias_constraint": null, "activity_regularizer": null, "return_sequences": true, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "LSTM", "config": {"use_bias": true, "recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 0, "name": "lstm_9", "bias_regularizer": null, "recurrent_regularizer": null, "activation": "tanh", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}}, "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unit_forget_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "go_backwards": false, "stateful": false, "units": 2, "dropout": 0.0, "bias_constraint": null, "activity_regularizer": null, "return_sequences": true, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "units": 1, "activation": "relu", "name": "dense_1", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}}}}]}