{"class_name": "Sequential", "keras_version": "2.0.2", "config": [{"class_name": "LSTM", "config": {"dropout": 0.0, "recurrent_dropout": 0.0, "kernel_regularizer": null, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "name": "lstm_1", "units": 64, "dtype": "float32", "implementation": 0, "use_bias": true, "activation": "tanh", "bias_constraint": null, "stateful": false, "return_sequences": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "seed": null, "mode": "fan_in"}}, "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "trainable": true, "bias_regularizer": null, "batch_input_shape": [null, 1, 48], "recurrent_regularizer": null, "activity_regularizer": null}}, {"class_name": "LSTM", "config": {"dropout": 0.0, "recurrent_dropout": 0.0, "kernel_regularizer": null, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "name": "lstm_2", "units": 32, "implementation": 0, "use_bias": true, "activation": "tanh", "bias_constraint": null, "stateful": false, "return_sequences": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "seed": null, "mode": "fan_in"}}, "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "trainable": true, "bias_regularizer": null, "recurrent_regularizer": null, "activity_regularizer": null}}, {"class_name": "LSTM", "config": {"dropout": 0.0, "recurrent_dropout": 0.0, "kernel_regularizer": null, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "name": "lstm_3", "units": 16, "implementation": 0, "use_bias": true, "activation": "tanh", "bias_constraint": null, "stateful": false, "return_sequences": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "seed": null, "mode": "fan_in"}}, "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "trainable": true, "bias_regularizer": null, "recurrent_regularizer": null, "activity_regularizer": null}}, {"class_name": "LSTM", "config": {"dropout": 0.0, "recurrent_dropout": 0.0, "kernel_regularizer": null, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "name": "lstm_4", "units": 2, "implementation": 0, "use_bias": true, "activation": "tanh", "bias_constraint": null, "stateful": false, "return_sequences": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "seed": null, "mode": "fan_in"}}, "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "trainable": true, "bias_regularizer": null, "recurrent_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"units": 1, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "seed": null, "mode": "fan_in"}}, "name": "dense_1", "activation": "relu", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "trainable": true, "activity_regularizer": null}}], "backend": "tensorflow"}