{"class_name": "Sequential", "keras_version": "2.0.2", "config": [{"class_name": "LSTM", "config": {"activation": "tanh", "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null, "recurrent_dropout": 0.0, "kernel_constraint": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "recurrent_constraint": null, "batch_input_shape": [null, 1, 52], "trainable": true, "return_sequences": true, "units": 256, "stateful": false, "name": "lstm_1", "unit_forget_bias": true, "use_bias": true, "go_backwards": false, "activity_regularizer": null, "implementation": 0, "recurrent_activation": "hard_sigmoid", "unroll": false, "kernel_regularizer": null}}, {"class_name": "LSTM", "config": {"activation": "tanh", "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "implementation": 0, "recurrent_dropout": 0.0, "kernel_regularizer": null, "stateful": false, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "recurrent_constraint": null, "units": 32, "kernel_constraint": null, "name": "lstm_2", "unit_forget_bias": true, "use_bias": true, "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_activation": "hard_sigmoid", "unroll": false, "return_sequences": true}}, {"class_name": "LSTM", "config": {"activation": "tanh", "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "implementation": 0, "recurrent_dropout": 0.0, "kernel_regularizer": null, "stateful": false, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "recurrent_constraint": null, "units": 2, "kernel_constraint": null, "name": "lstm_3", "unit_forget_bias": true, "use_bias": true, "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_activation": "hard_sigmoid", "unroll": false, "return_sequences": true}}, {"class_name": "Dense", "config": {"activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "units": 1, "kernel_constraint": null, "name": "dense_1", "use_bias": true, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "backend": "tensorflow"}