{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"return_sequences": true, "kernel_constraint": null, "bias_constraint": null, "dtype": "float32", "recurrent_regularizer": null, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "activity_regularizer": null, "trainable": true, "dropout": 0.0, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "batch_input_shape": [null, 1, 52], "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}}, "use_bias": true, "name": "lstm_1", "bias_regularizer": null, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 0, "recurrent_dropout": 0.0, "unit_forget_bias": true, "recurrent_constraint": null, "units": 64, "kernel_regularizer": null}}, {"class_name": "LSTM", "config": {"return_sequences": true, "kernel_constraint": null, "bias_constraint": null, "recurrent_regularizer": null, "stateful": false, "recurrent_dropout": 0.0, "activity_regularizer": null, "dropout": 0.0, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "trainable": true, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}}, "use_bias": true, "name": "lstm_2", "bias_regularizer": null, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true, "recurrent_constraint": null, "units": 32, "kernel_regularizer": null}}, {"class_name": "LSTM", "config": {"return_sequences": true, "kernel_constraint": null, "bias_constraint": null, "recurrent_regularizer": null, "stateful": false, "recurrent_dropout": 0.0, "activity_regularizer": null, "dropout": 0.0, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "trainable": true, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}}, "use_bias": true, "name": "lstm_3", "bias_regularizer": null, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true, "recurrent_constraint": null, "units": 32, "kernel_regularizer": null}}, {"class_name": "LSTM", "config": {"return_sequences": true, "kernel_constraint": null, "bias_constraint": null, "recurrent_regularizer": null, "stateful": false, "recurrent_dropout": 0.0, "activity_regularizer": null, "dropout": 0.0, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "trainable": true, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}}, "use_bias": true, "name": "lstm_4", "bias_regularizer": null, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true, "recurrent_constraint": null, "units": 32, "kernel_regularizer": null}}, {"class_name": "LSTM", "config": {"return_sequences": true, "kernel_constraint": null, "bias_constraint": null, "recurrent_regularizer": null, "stateful": false, "recurrent_dropout": 0.0, "activity_regularizer": null, "dropout": 0.0, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "trainable": true, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}}, "use_bias": true, "name": "lstm_5", "bias_regularizer": null, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true, "recurrent_constraint": null, "units": 32, "kernel_regularizer": null}}, {"class_name": "LSTM", "config": {"return_sequences": true, "kernel_constraint": null, "bias_constraint": null, "recurrent_regularizer": null, "stateful": false, "recurrent_dropout": 0.0, "activity_regularizer": null, "dropout": 0.0, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "trainable": true, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}}, "use_bias": true, "name": "lstm_6", "bias_regularizer": null, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true, "recurrent_constraint": null, "units": 32, "kernel_regularizer": null}}, {"class_name": "LSTM", "config": {"return_sequences": true, "kernel_constraint": null, "bias_constraint": null, "recurrent_regularizer": null, "stateful": false, "recurrent_dropout": 0.0, "activity_regularizer": null, "dropout": 0.0, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "trainable": true, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}}, "use_bias": true, "name": "lstm_7", "bias_regularizer": null, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true, "recurrent_constraint": null, "units": 64, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "trainable": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}}, "use_bias": true, "name": "dense_1", "bias_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "units": 1, "kernel_regularizer": null}}], "keras_version": "2.0.2", "backend": "tensorflow"}