{"config": [{"config": {"use_bias": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "trainable": true, "return_sequences": true, "dropout": 0.0, "recurrent_regularizer": null, "dtype": "float32", "kernel_constraint": null, "unroll": false, "recurrent_constraint": null, "implementation": 0, "kernel_regularizer": null, "activity_regularizer": null, "unit_forget_bias": true, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 8, "stateful": false, "batch_input_shape": [null, 1, 48], "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "name": "lstm_1", "recurrent_dropout": 0.0}, "class_name": "LSTM"}, {"config": {"use_bias": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "unit_forget_bias": true, "return_sequences": true, "dropout": 0.0, "recurrent_regularizer": null, "kernel_constraint": null, "trainable": true, "unroll": false, "recurrent_constraint": null, "kernel_regularizer": null, "implementation": 0, "activity_regularizer": null, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 128, "stateful": false, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "name": "lstm_2", "recurrent_dropout": 0.0}, "class_name": "LSTM"}, {"config": {"use_bias": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "unit_forget_bias": true, "return_sequences": true, "dropout": 0.0, "recurrent_regularizer": null, "kernel_constraint": null, "trainable": true, "unroll": false, "recurrent_constraint": null, "kernel_regularizer": null, "implementation": 0, "activity_regularizer": null, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 8, "stateful": false, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "name": "lstm_3", "recurrent_dropout": 0.0}, "class_name": "LSTM"}, {"config": {"use_bias": true, "trainable": true, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "units": 1, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activity_regularizer": null, "name": "dense_1", "bias_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}], "keras_version": "2.0.2", "backend": "tensorflow", "class_name": "Sequential"}