{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.2", "config": [{"class_name": "LSTM", "config": {"name": "lstm_1", "kernel_constraint": null, "return_sequences": true, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}}, "batch_input_shape": [null, 1, 48], "recurrent_constraint": null, "dropout": 0.0, "bias_regularizer": null, "dtype": "float32", "activity_regularizer": null, "implementation": 0, "recurrent_regularizer": null, "units": 64, "trainable": true, "use_bias": true, "go_backwards": false, "activation": "tanh", "bias_constraint": null}}, {"class_name": "LSTM", "config": {"dropout": 0.0, "kernel_constraint": null, "return_sequences": true, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unit_forget_bias": true, "kernel_regularizer": null, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}}, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "name": "lstm_2", "bias_regularizer": null, "activity_regularizer": null, "implementation": 0, "recurrent_regularizer": null, "units": 8, "recurrent_dropout": 0.0, "unroll": false, "go_backwards": false, "bias_constraint": null}}, {"class_name": "LSTM", "config": {"dropout": 0.0, "kernel_constraint": null, "return_sequences": true, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unit_forget_bias": true, "kernel_regularizer": null, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}}, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "name": "lstm_3", "bias_regularizer": null, "activity_regularizer": null, "implementation": 0, "recurrent_regularizer": null, "units": 2, "recurrent_dropout": 0.0, "unroll": false, "go_backwards": false, "bias_constraint": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}}, "kernel_regularizer": null, "name": "dense_1", "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "units": 1, "trainable": true, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}]}