{"class_name": "Sequential", "keras_version": "2.0.2", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"bias_constraint": null, "stateful": false, "units": 2, "dropout": 0.0, "name": "lstm_1", "go_backwards": false, "bias_regularizer": null, "dtype": "float32", "unit_forget_bias": true, "recurrent_constraint": null, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "recurrent_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "trainable": true, "unroll": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "return_sequences": true, "implementation": 0, "batch_input_shape": [null, 1, 52], "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "LSTM", "config": {"bias_constraint": null, "stateful": false, "units": 8, "dropout": 0.0, "name": "lstm_2", "go_backwards": false, "bias_regularizer": null, "unit_forget_bias": true, "recurrent_constraint": null, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "recurrent_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "trainable": true, "unroll": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "return_sequences": true, "implementation": 0, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "LSTM", "config": {"bias_constraint": null, "stateful": false, "units": 16, "dropout": 0.0, "name": "lstm_3", "go_backwards": false, "bias_regularizer": null, "unit_forget_bias": true, "recurrent_constraint": null, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "recurrent_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "trainable": true, "unroll": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "return_sequences": true, "implementation": 0, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "LSTM", "config": {"bias_constraint": null, "stateful": false, "units": 128, "dropout": 0.0, "name": "lstm_4", "go_backwards": false, "bias_regularizer": null, "unit_forget_bias": true, "recurrent_constraint": null, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "recurrent_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "trainable": true, "unroll": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "return_sequences": true, "implementation": 0, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "LSTM", "config": {"bias_constraint": null, "stateful": false, "units": 256, "dropout": 0.0, "name": "lstm_5", "go_backwards": false, "bias_regularizer": null, "unit_forget_bias": true, "recurrent_constraint": null, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "recurrent_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "trainable": true, "unroll": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "return_sequences": true, "implementation": 0, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "LSTM", "config": {"bias_constraint": null, "stateful": false, "units": 128, "dropout": 0.0, "name": "lstm_6", "go_backwards": false, "bias_regularizer": null, "unit_forget_bias": true, "recurrent_constraint": null, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "recurrent_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "trainable": true, "unroll": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "return_sequences": true, "implementation": 0, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "LSTM", "config": {"bias_constraint": null, "stateful": false, "units": 16, "dropout": 0.0, "name": "lstm_7", "go_backwards": false, "bias_regularizer": null, "unit_forget_bias": true, "recurrent_constraint": null, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "recurrent_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "trainable": true, "unroll": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "return_sequences": true, "implementation": 0, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "LSTM", "config": {"bias_constraint": null, "stateful": false, "units": 8, "dropout": 0.0, "name": "lstm_8", "go_backwards": false, "bias_regularizer": null, "unit_forget_bias": true, "recurrent_constraint": null, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "recurrent_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "trainable": true, "unroll": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "return_sequences": true, "implementation": 0, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "LSTM", "config": {"bias_constraint": null, "stateful": false, "units": 2, "dropout": 0.0, "name": "lstm_9", "go_backwards": false, "bias_regularizer": null, "unit_forget_bias": true, "recurrent_constraint": null, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "recurrent_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "trainable": true, "unroll": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "return_sequences": true, "implementation": 0, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "Dense", "config": {"bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "name": "dense_1", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "activation": "relu"}}]}