{"keras_version": "2.0.2", "config": [{"config": {"unroll": false, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "implementation": 0, "dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "batch_input_shape": [null, 1, 52], "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}, "class_name": "VarianceScaling"}, "dtype": "float32", "recurrent_regularizer": null, "name": "lstm_1", "go_backwards": false, "stateful": false, "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "recurrent_constraint": null, "use_bias": true, "unit_forget_bias": true, "activity_regularizer": null, "activation": "tanh", "units": 128, "recurrent_dropout": 0.0}, "class_name": "LSTM"}, {"config": {"unroll": false, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "implementation": 0, "dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "name": "lstm_2", "go_backwards": false, "stateful": false, "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "recurrent_constraint": null, "use_bias": true, "unit_forget_bias": true, "activity_regularizer": null, "activation": "tanh", "units": 64, "recurrent_dropout": 0.0}, "class_name": "LSTM"}, {"config": {"unroll": false, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "implementation": 0, "dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "name": "lstm_3", "go_backwards": false, "stateful": false, "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "recurrent_constraint": null, "use_bias": true, "unit_forget_bias": true, "activity_regularizer": null, "activation": "tanh", "units": 2, "recurrent_dropout": 0.0}, "class_name": "LSTM"}, {"config": {"bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}, "class_name": "VarianceScaling"}, "name": "dense_1", "units": 1, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow"}