{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"use_bias": true, "activity_regularizer": null, "implementation": 0, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_constraint": null, "bias_constraint": null, "go_backwards": false, "stateful": false, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "kernel_regularizer": null, "unroll": false, "dropout": 0.0, "bias_regularizer": null, "name": "lstm_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "recurrent_regularizer": null, "trainable": true, "units": 64, "dtype": "float32", "batch_input_shape": [null, 1, 48], "activation": "tanh", "return_sequences": true}}, {"class_name": "LSTM", "config": {"use_bias": true, "activity_regularizer": null, "recurrent_constraint": null, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "implementation": 0, "bias_constraint": null, "go_backwards": false, "stateful": false, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "kernel_regularizer": null, "unroll": false, "dropout": 0.0, "bias_regularizer": null, "name": "lstm_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "recurrent_regularizer": null, "trainable": true, "units": 8, "activation": "tanh", "return_sequences": true}}, {"class_name": "LSTM", "config": {"use_bias": true, "activity_regularizer": null, "recurrent_constraint": null, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "implementation": 0, "bias_constraint": null, "go_backwards": false, "stateful": false, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "kernel_regularizer": null, "unroll": false, "dropout": 0.0, "bias_regularizer": null, "name": "lstm_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "recurrent_regularizer": null, "trainable": true, "units": 2, "activation": "tanh", "return_sequences": true}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "trainable": true, "units": 1, "bias_constraint": null, "activation": "relu", "kernel_constraint": null}}], "keras_version": "2.0.2"}