{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"name": "lstm_1", "recurrent_regularizer": null, "stateful": false, "kernel_regularizer": null, "activation": "tanh", "bias_constraint": null, "batch_input_shape": [null, 1, 48], "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false, "use_bias": true, "bias_regularizer": null, "unroll": false, "return_sequences": true, "recurrent_constraint": null, "units": 2, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "dropout": 0.0, "recurrent_dropout": 0.0, "trainable": true, "activity_regularizer": null, "dtype": "float32", "implementation": 0}}, {"class_name": "LSTM", "config": {"name": "lstm_2", "recurrent_regularizer": null, "stateful": false, "activity_regularizer": null, "kernel_regularizer": null, "activation": "tanh", "bias_constraint": null, "dropout": 0.0, "unit_forget_bias": true, "trainable": true, "implementation": 0, "bias_regularizer": null, "unroll": false, "return_sequences": true, "recurrent_constraint": null, "units": 8, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false}}, {"class_name": "LSTM", "config": {"name": "lstm_3", "recurrent_regularizer": null, "stateful": false, "activity_regularizer": null, "kernel_regularizer": null, "activation": "tanh", "bias_constraint": null, "dropout": 0.0, "unit_forget_bias": true, "trainable": true, "implementation": 0, "bias_regularizer": null, "unroll": false, "return_sequences": true, "recurrent_constraint": null, "units": 64, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false}}, {"class_name": "LSTM", "config": {"name": "lstm_4", "recurrent_regularizer": null, "stateful": false, "activity_regularizer": null, "kernel_regularizer": null, "activation": "tanh", "bias_constraint": null, "dropout": 0.0, "unit_forget_bias": true, "trainable": true, "implementation": 0, "bias_regularizer": null, "unroll": false, "return_sequences": true, "recurrent_constraint": null, "units": 64, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false}}, {"class_name": "LSTM", "config": {"name": "lstm_5", "recurrent_regularizer": null, "stateful": false, "activity_regularizer": null, "kernel_regularizer": null, "activation": "tanh", "bias_constraint": null, "dropout": 0.0, "unit_forget_bias": true, "trainable": true, "implementation": 0, "bias_regularizer": null, "unroll": false, "return_sequences": true, "recurrent_constraint": null, "units": 8, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false}}, {"class_name": "LSTM", "config": {"name": "lstm_6", "recurrent_regularizer": null, "stateful": false, "activity_regularizer": null, "kernel_regularizer": null, "activation": "tanh", "bias_constraint": null, "dropout": 0.0, "unit_forget_bias": true, "trainable": true, "implementation": 0, "bias_regularizer": null, "unroll": false, "return_sequences": true, "recurrent_constraint": null, "units": 2, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false}}, {"class_name": "Dense", "config": {"name": "dense_1", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "activation": "relu", "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "units": 1}}], "backend": "tensorflow", "keras_version": "2.0.2"}