{"config": [{"config": {"name": "lstm_1", "implementation": 0, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dropout": 0.0, "bias_regularizer": null, "activity_regularizer": null, "unroll": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "recurrent_constraint": null, "recurrent_regularizer": null, "kernel_initializer": {"config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "dtype": "float32", "trainable": true, "unit_forget_bias": true, "bias_constraint": null, "activation": "tanh", "stateful": false, "kernel_constraint": null, "batch_input_shape": [null, 1, 48], "go_backwards": false, "recurrent_dropout": 0.0, "units": 16}, "class_name": "LSTM"}, {"config": {"name": "lstm_2", "implementation": 0, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dropout": 0.0, "bias_regularizer": null, "activity_regularizer": null, "unroll": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "recurrent_constraint": null, "recurrent_regularizer": null, "kernel_initializer": {"config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "unit_forget_bias": true, "bias_constraint": null, "activation": "tanh", "stateful": false, "kernel_constraint": null, "go_backwards": false, "recurrent_dropout": 0.0, "units": 128}, "class_name": "LSTM"}, {"config": {"name": "lstm_3", "implementation": 0, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dropout": 0.0, "bias_regularizer": null, "activity_regularizer": null, "unroll": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "recurrent_constraint": null, "recurrent_regularizer": null, "kernel_initializer": {"config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "unit_forget_bias": true, "bias_constraint": null, "activation": "tanh", "stateful": false, "kernel_constraint": null, "go_backwards": false, "recurrent_dropout": 0.0, "units": 16}, "class_name": "LSTM"}, {"config": {"name": "dense_1", "use_bias": true, "kernel_initializer": {"config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "bias_constraint": null, "activation": "relu", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "units": 1}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.0.2", "class_name": "Sequential"}