{"keras_version": "2.0.2", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"use_bias": true, "unroll": false, "implementation": 0, "trainable": true, "kernel_regularizer": null, "return_sequences": true, "kernel_constraint": null, "stateful": false, "batch_input_shape": [null, 1, 48], "go_backwards": false, "recurrent_constraint": null, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "activation": "tanh", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "units": 2, "recurrent_dropout": 0.0, "unit_forget_bias": true, "activity_regularizer": null, "name": "lstm_1", "recurrent_activation": "hard_sigmoid", "dtype": "float32"}}, {"class_name": "LSTM", "config": {"use_bias": true, "unroll": false, "implementation": 0, "trainable": true, "kernel_regularizer": null, "return_sequences": true, "kernel_constraint": null, "stateful": false, "go_backwards": false, "recurrent_constraint": null, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "activation": "tanh", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "units": 8, "recurrent_dropout": 0.0, "unit_forget_bias": true, "activity_regularizer": null, "name": "lstm_2", "recurrent_activation": "hard_sigmoid"}}, {"class_name": "LSTM", "config": {"use_bias": true, "unroll": false, "implementation": 0, "trainable": true, "kernel_regularizer": null, "return_sequences": true, "kernel_constraint": null, "stateful": false, "go_backwards": false, "recurrent_constraint": null, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "activation": "tanh", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "units": 16, "recurrent_dropout": 0.0, "unit_forget_bias": true, "activity_regularizer": null, "name": "lstm_3", "recurrent_activation": "hard_sigmoid"}}, {"class_name": "LSTM", "config": {"use_bias": true, "unroll": false, "implementation": 0, "trainable": true, "kernel_regularizer": null, "return_sequences": true, "kernel_constraint": null, "stateful": false, "go_backwards": false, "recurrent_constraint": null, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "activation": "tanh", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "units": 128, "recurrent_dropout": 0.0, "unit_forget_bias": true, "activity_regularizer": null, "name": "lstm_4", "recurrent_activation": "hard_sigmoid"}}, {"class_name": "LSTM", "config": {"use_bias": true, "unroll": false, "implementation": 0, "trainable": true, "kernel_regularizer": null, "return_sequences": true, "kernel_constraint": null, "stateful": false, "go_backwards": false, "recurrent_constraint": null, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "activation": "tanh", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "units": 16, "recurrent_dropout": 0.0, "unit_forget_bias": true, "activity_regularizer": null, "name": "lstm_5", "recurrent_activation": "hard_sigmoid"}}, {"class_name": "LSTM", "config": {"use_bias": true, "unroll": false, "implementation": 0, "trainable": true, "kernel_regularizer": null, "return_sequences": true, "kernel_constraint": null, "stateful": false, "go_backwards": false, "recurrent_constraint": null, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "activation": "tanh", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "units": 8, "recurrent_dropout": 0.0, "unit_forget_bias": true, "activity_regularizer": null, "name": "lstm_6", "recurrent_activation": "hard_sigmoid"}}, {"class_name": "LSTM", "config": {"use_bias": true, "unroll": false, "implementation": 0, "trainable": true, "kernel_regularizer": null, "return_sequences": true, "kernel_constraint": null, "stateful": false, "go_backwards": false, "recurrent_constraint": null, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "activation": "tanh", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "units": 2, "recurrent_dropout": 0.0, "unit_forget_bias": true, "activity_regularizer": null, "name": "lstm_7", "recurrent_activation": "hard_sigmoid"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "trainable": true, "kernel_regularizer": null, "units": 1, "name": "dense_1", "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null}}]}