{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"unroll": false, "dropout": 0.0, "trainable": true, "go_backwards": false, "units": 128, "activation": "tanh", "recurrent_dropout": 0.0, "name": "lstm_1", "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "activity_regularizer": null, "stateful": false, "batch_input_shape": [null, 1, 52], "recurrent_constraint": null, "implementation": 0, "recurrent_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "return_sequences": true, "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "LSTM", "config": {"unroll": false, "dropout": 0.0, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "units": 64, "activation": "tanh", "recurrent_dropout": 0.0, "name": "lstm_2", "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "go_backwards": false, "activity_regularizer": null, "stateful": false, "implementation": 0, "recurrent_constraint": null, "recurrent_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "return_sequences": true, "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "LSTM", "config": {"unroll": false, "dropout": 0.0, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "units": 2, "activation": "tanh", "recurrent_dropout": 0.0, "name": "lstm_3", "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "go_backwards": false, "activity_regularizer": null, "stateful": false, "implementation": 0, "recurrent_constraint": null, "recurrent_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "return_sequences": true, "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"trainable": true, "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "units": 1, "use_bias": true, "name": "dense_1", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "activity_regularizer": null, "kernel_constraint": null}}], "keras_version": "2.0.2", "backend": "tensorflow"}