{"config": [{"config": {"stateful": false, "return_sequences": true, "unit_forget_bias": true, "dropout": 0.0, "activation": "tanh", "dtype": "float32", "bias_constraint": null, "use_bias": true, "recurrent_constraint": null, "units": 2, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "kernel_constraint": null, "implementation": 0, "trainable": true, "unroll": false, "batch_input_shape": [null, 1, 48], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "name": "lstm_1", "go_backwards": false, "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"stateful": false, "return_sequences": true, "unit_forget_bias": true, "dropout": 0.0, "activation": "tanh", "bias_constraint": null, "use_bias": true, "recurrent_constraint": null, "units": 8, "kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "kernel_constraint": null, "implementation": 0, "trainable": true, "unroll": false, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "name": "lstm_2", "bias_regularizer": null, "go_backwards": false, "recurrent_dropout": 0.0, "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"stateful": false, "return_sequences": true, "unit_forget_bias": true, "dropout": 0.0, "activation": "tanh", "bias_constraint": null, "use_bias": true, "recurrent_constraint": null, "units": 32, "kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "kernel_constraint": null, "implementation": 0, "trainable": true, "unroll": false, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "name": "lstm_3", "bias_regularizer": null, "go_backwards": false, "recurrent_dropout": 0.0, "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"stateful": false, "return_sequences": true, "unit_forget_bias": true, "dropout": 0.0, "activation": "tanh", "bias_constraint": null, "use_bias": true, "recurrent_constraint": null, "units": 32, "kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "kernel_constraint": null, "implementation": 0, "trainable": true, "unroll": false, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "name": "lstm_4", "bias_regularizer": null, "go_backwards": false, "recurrent_dropout": 0.0, "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"stateful": false, "return_sequences": true, "unit_forget_bias": true, "dropout": 0.0, "activation": "tanh", "bias_constraint": null, "use_bias": true, "recurrent_constraint": null, "units": 8, "kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "kernel_constraint": null, "implementation": 0, "trainable": true, "unroll": false, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "name": "lstm_5", "bias_regularizer": null, "go_backwards": false, "recurrent_dropout": 0.0, "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"stateful": false, "return_sequences": true, "unit_forget_bias": true, "dropout": 0.0, "activation": "tanh", "bias_constraint": null, "use_bias": true, "recurrent_constraint": null, "units": 2, "kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "kernel_constraint": null, "implementation": 0, "trainable": true, "unroll": false, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "name": "lstm_6", "bias_regularizer": null, "go_backwards": false, "recurrent_dropout": 0.0, "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"kernel_constraint": null, "activity_regularizer": null, "trainable": true, "units": 1, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "name": "dense_1", "bias_regularizer": null, "use_bias": true, "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.2"}