{"config": [{"config": {"activation": "tanh", "recurrent_regularizer": null, "stateful": false, "bias_constraint": null, "unit_forget_bias": true, "trainable": true, "dtype": "float32", "activity_regularizer": null, "implementation": 0, "kernel_constraint": null, "unroll": false, "recurrent_constraint": null, "batch_input_shape": [null, 1, 52], "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "name": "lstm_1", "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "dropout": 0.0, "bias_regularizer": null, "recurrent_dropout": 0.0, "go_backwards": false, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_sequences": true, "units": 128, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}}, "class_name": "LSTM"}, {"config": {"activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "name": "dense_1", "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "units": 1, "kernel_constraint": null}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.0.2", "class_name": "Sequential"}