{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.2", "config": [{"class_name": "LSTM", "config": {"batch_input_shape": [null, 1, 48], "recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "stateful": false, "bias_regularizer": null, "dropout": 0.0, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "kernel_regularizer": null, "implementation": 0, "unroll": false, "unit_forget_bias": true, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_regularizer": null, "bias_constraint": null, "go_backwards": false, "units": 2, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "use_bias": true, "activity_regularizer": null, "name": "lstm_1", "return_sequences": true, "dtype": "float32"}}, {"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "stateful": false, "dropout": 0.0, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "kernel_regularizer": null, "implementation": 0, "unroll": false, "unit_forget_bias": true, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_regularizer": null, "bias_constraint": null, "go_backwards": false, "units": 2, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "use_bias": true, "activity_regularizer": null, "name": "lstm_2", "return_sequences": true}}, {"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "stateful": false, "dropout": 0.0, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "kernel_regularizer": null, "implementation": 0, "unroll": false, "unit_forget_bias": true, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_regularizer": null, "bias_constraint": null, "go_backwards": false, "units": 2, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "use_bias": true, "activity_regularizer": null, "name": "lstm_3", "return_sequences": true}}, {"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "stateful": false, "dropout": 0.0, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "kernel_regularizer": null, "implementation": 0, "unroll": false, "unit_forget_bias": true, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_regularizer": null, "bias_constraint": null, "go_backwards": false, "units": 2, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "use_bias": true, "activity_regularizer": null, "name": "lstm_4", "return_sequences": true}}, {"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "stateful": false, "dropout": 0.0, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "kernel_regularizer": null, "implementation": 0, "unroll": false, "unit_forget_bias": true, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_regularizer": null, "bias_constraint": null, "go_backwards": false, "units": 2, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "use_bias": true, "activity_regularizer": null, "name": "lstm_5", "return_sequences": true}}, {"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "stateful": false, "dropout": 0.0, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "kernel_regularizer": null, "implementation": 0, "unroll": false, "unit_forget_bias": true, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_regularizer": null, "bias_constraint": null, "go_backwards": false, "units": 2, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "use_bias": true, "activity_regularizer": null, "name": "lstm_6", "return_sequences": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "units": 1, "kernel_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_1", "trainable": true}}]}