{"keras_version": "2.0.2", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "return_sequences": true, "recurrent_constraint": null, "unroll": false, "activation": "tanh", "name": "lstm_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "normal", "scale": 2.0}}, "go_backwards": false, "recurrent_dropout": 0.0, "units": 2, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "bias_regularizer": null, "implementation": 0, "kernel_constraint": null, "dropout": 0.0, "kernel_regularizer": null, "batch_input_shape": [null, 1, 48], "dtype": "float32", "recurrent_regularizer": null, "activity_regularizer": null, "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"rate": 0.1, "name": "dropout_1", "trainable": true}}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "return_sequences": true, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "name": "lstm_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "normal", "scale": 2.0}}, "go_backwards": false, "recurrent_dropout": 0.0, "unroll": false, "units": 8, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "bias_regularizer": null, "implementation": 0, "kernel_constraint": null, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "activity_regularizer": null, "stateful": false, "dropout": 0.0, "bias_constraint": null}}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "return_sequences": true, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "name": "lstm_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "normal", "scale": 2.0}}, "go_backwards": false, "recurrent_dropout": 0.0, "unroll": false, "units": 16, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "bias_regularizer": null, "implementation": 0, "kernel_constraint": null, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "activity_regularizer": null, "stateful": false, "dropout": 0.0, "bias_constraint": null}}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "return_sequences": true, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "name": "lstm_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "normal", "scale": 2.0}}, "go_backwards": false, "recurrent_dropout": 0.0, "unroll": false, "units": 128, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "bias_regularizer": null, "implementation": 0, "kernel_constraint": null, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "activity_regularizer": null, "stateful": false, "dropout": 0.0, "bias_constraint": null}}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "return_sequences": true, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "name": "lstm_5", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "normal", "scale": 2.0}}, "go_backwards": false, "recurrent_dropout": 0.0, "unroll": false, "units": 16, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "bias_regularizer": null, "implementation": 0, "kernel_constraint": null, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "activity_regularizer": null, "stateful": false, "dropout": 0.0, "bias_constraint": null}}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "return_sequences": true, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "name": "lstm_6", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "normal", "scale": 2.0}}, "go_backwards": false, "recurrent_dropout": 0.0, "unroll": false, "units": 8, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "bias_regularizer": null, "implementation": 0, "kernel_constraint": null, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "activity_regularizer": null, "stateful": false, "dropout": 0.0, "bias_constraint": null}}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "return_sequences": true, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "name": "lstm_7", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "normal", "scale": 2.0}}, "go_backwards": false, "recurrent_dropout": 0.0, "unroll": false, "units": 2, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "bias_regularizer": null, "implementation": 0, "kernel_constraint": null, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "activity_regularizer": null, "stateful": false, "dropout": 0.0, "bias_constraint": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "activation": "relu", "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "normal", "scale": 2.0}}, "units": 1, "bias_constraint": null, "kernel_regularizer": null}}]}