{"backend": "tensorflow", "keras_version": "2.0.2", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"bias_constraint": null, "unroll": false, "dtype": "float32", "dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_constraint": null, "stateful": false, "unit_forget_bias": true, "name": "lstm_1", "bias_regularizer": null, "use_bias": true, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "implementation": 0, "go_backwards": false, "units": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "batch_input_shape": [null, 1, 52], "trainable": true, "return_sequences": true, "kernel_regularizer": null, "recurrent_dropout": 0.0, "activity_regularizer": null}}, {"class_name": "LSTM", "config": {"bias_constraint": null, "unroll": false, "dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_constraint": null, "stateful": false, "unit_forget_bias": true, "name": "lstm_2", "bias_regularizer": null, "use_bias": true, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "implementation": 0, "go_backwards": false, "units": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "trainable": true, "return_sequences": true, "kernel_regularizer": null, "recurrent_dropout": 0.0, "activity_regularizer": null}}, {"class_name": "LSTM", "config": {"bias_constraint": null, "unroll": false, "dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_constraint": null, "stateful": false, "unit_forget_bias": true, "name": "lstm_3", "bias_regularizer": null, "use_bias": true, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "implementation": 0, "go_backwards": false, "units": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "trainable": true, "return_sequences": true, "kernel_regularizer": null, "recurrent_dropout": 0.0, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activation": "relu", "use_bias": true, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_1", "kernel_constraint": null}}]}