{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"kernel_constraint": null, "return_sequences": true, "recurrent_regularizer": null, "unroll": false, "activity_regularizer": null, "units": 64, "recurrent_dropout": 0.0, "bias_regularizer": null, "recurrent_constraint": null, "dropout": 0.0, "unit_forget_bias": true, "stateful": false, "dtype": "float32", "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "batch_input_shape": [null, 1, 52], "name": "lstm_1", "go_backwards": false, "bias_constraint": null, "implementation": 0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "kernel_regularizer": null, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}, {"class_name": "LSTM", "config": {"kernel_constraint": null, "return_sequences": true, "recurrent_regularizer": null, "unroll": false, "activity_regularizer": null, "units": 16, "recurrent_dropout": 0.0, "bias_regularizer": null, "recurrent_constraint": null, "dropout": 0.0, "unit_forget_bias": true, "stateful": false, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "name": "lstm_2", "go_backwards": false, "bias_constraint": null, "implementation": 0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "kernel_regularizer": null, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}, {"class_name": "LSTM", "config": {"kernel_constraint": null, "return_sequences": true, "recurrent_regularizer": null, "unroll": false, "activity_regularizer": null, "units": 32, "recurrent_dropout": 0.0, "bias_regularizer": null, "recurrent_constraint": null, "dropout": 0.0, "unit_forget_bias": true, "stateful": false, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "name": "lstm_3", "go_backwards": false, "bias_constraint": null, "implementation": 0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "kernel_regularizer": null, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}, {"class_name": "LSTM", "config": {"kernel_constraint": null, "return_sequences": true, "recurrent_regularizer": null, "unroll": false, "activity_regularizer": null, "units": 32, "recurrent_dropout": 0.0, "bias_regularizer": null, "recurrent_constraint": null, "dropout": 0.0, "unit_forget_bias": true, "stateful": false, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "name": "lstm_4", "go_backwards": false, "bias_constraint": null, "implementation": 0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "kernel_regularizer": null, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}, {"class_name": "LSTM", "config": {"kernel_constraint": null, "return_sequences": true, "recurrent_regularizer": null, "unroll": false, "activity_regularizer": null, "units": 32, "recurrent_dropout": 0.0, "bias_regularizer": null, "recurrent_constraint": null, "dropout": 0.0, "unit_forget_bias": true, "stateful": false, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "name": "lstm_5", "go_backwards": false, "bias_constraint": null, "implementation": 0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "kernel_regularizer": null, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}, {"class_name": "LSTM", "config": {"kernel_constraint": null, "return_sequences": true, "recurrent_regularizer": null, "unroll": false, "activity_regularizer": null, "units": 16, "recurrent_dropout": 0.0, "bias_regularizer": null, "recurrent_constraint": null, "dropout": 0.0, "unit_forget_bias": true, "stateful": false, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "name": "lstm_6", "go_backwards": false, "bias_constraint": null, "implementation": 0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "kernel_regularizer": null, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}, {"class_name": "LSTM", "config": {"kernel_constraint": null, "return_sequences": true, "recurrent_regularizer": null, "unroll": false, "activity_regularizer": null, "units": 64, "recurrent_dropout": 0.0, "bias_regularizer": null, "recurrent_constraint": null, "dropout": 0.0, "unit_forget_bias": true, "stateful": false, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "name": "lstm_7", "go_backwards": false, "bias_constraint": null, "implementation": 0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "kernel_regularizer": null, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "name": "dense_1", "units": 1, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "activation": "relu", "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "keras_version": "2.0.2"}