{"keras_version": "2.0.2", "config": [{"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 1, 48], "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_constraint": null, "recurrent_constraint": null, "dropout": 0.0, "units": 2, "unit_forget_bias": true, "name": "lstm_1", "activity_regularizer": null, "bias_regularizer": null, "unroll": false, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "dtype": "float32", "stateful": false, "recurrent_dropout": 0.0, "implementation": 0, "trainable": true, "return_sequences": true, "recurrent_regularizer": null, "go_backwards": false}, "class_name": "LSTM"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_constraint": null, "recurrent_constraint": null, "trainable": true, "units": 2, "unit_forget_bias": true, "name": "lstm_2", "activity_regularizer": null, "bias_regularizer": null, "unroll": false, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "go_backwards": false, "stateful": false, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "implementation": 0, "dropout": 0.0, "return_sequences": true, "use_bias": true}, "class_name": "LSTM"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_constraint": null, "recurrent_constraint": null, "trainable": true, "units": 2, "unit_forget_bias": true, "name": "lstm_3", "activity_regularizer": null, "bias_regularizer": null, "unroll": false, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "go_backwards": false, "stateful": false, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "implementation": 0, "dropout": 0.0, "return_sequences": true, "use_bias": true}, "class_name": "LSTM"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_constraint": null, "recurrent_constraint": null, "trainable": true, "units": 2, "unit_forget_bias": true, "name": "lstm_4", "activity_regularizer": null, "bias_regularizer": null, "unroll": false, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "go_backwards": false, "stateful": false, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "implementation": 0, "dropout": 0.0, "return_sequences": true, "use_bias": true}, "class_name": "LSTM"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_constraint": null, "recurrent_constraint": null, "trainable": true, "units": 2, "unit_forget_bias": true, "name": "lstm_5", "activity_regularizer": null, "bias_regularizer": null, "unroll": false, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "go_backwards": false, "stateful": false, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "implementation": 0, "dropout": 0.0, "return_sequences": true, "use_bias": true}, "class_name": "LSTM"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_constraint": null, "recurrent_constraint": null, "trainable": true, "units": 2, "unit_forget_bias": true, "name": "lstm_6", "activity_regularizer": null, "bias_regularizer": null, "unroll": false, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "go_backwards": false, "stateful": false, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "implementation": 0, "dropout": 0.0, "return_sequences": true, "use_bias": true}, "class_name": "LSTM"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1, "kernel_constraint": null, "name": "dense_1", "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "bias_constraint": null, "trainable": true, "kernel_initializer": {"config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow"}