{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"go_backwards": false, "recurrent_constraint": null, "recurrent_dropout": 0.0, "activation": "tanh", "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "implementation": 0, "unit_forget_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "units": 128, "kernel_constraint": null, "batch_input_shape": [null, 1, 52], "return_sequences": true, "activity_regularizer": null, "recurrent_regularizer": null, "name": "lstm_1", "unroll": false, "dtype": "float32", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "stateful": false, "bias_constraint": null, "dropout": 0.0}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "activation": "relu", "name": "dense_1", "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "kernel_regularizer": null, "kernel_constraint": null}}], "keras_version": "2.0.2"}