{"backend": "tensorflow", "keras_version": "2.0.2", "config": [{"class_name": "LSTM", "config": {"go_backwards": false, "trainable": true, "name": "lstm_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null, "use_bias": true, "units": 8, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}}, "stateful": false, "implementation": 0, "return_sequences": true, "batch_input_shape": [null, 1, 48], "unit_forget_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "unroll": false, "recurrent_dropout": 0.0, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"go_backwards": false, "trainable": true, "name": "lstm_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}}, "stateful": false, "implementation": 0, "return_sequences": true, "units": 128, "unit_forget_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "unroll": false, "recurrent_dropout": 0.0, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"go_backwards": false, "trainable": true, "name": "lstm_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}}, "stateful": false, "implementation": 0, "return_sequences": true, "units": 8, "unit_forget_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "unroll": false, "recurrent_dropout": 0.0, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "activation": "tanh"}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_regularizer": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}}, "units": 1, "activation": "relu", "activity_regularizer": null}}], "class_name": "Sequential"}