{"config": [{"config": {"kernel_regularizer": null, "bias_regularizer": null, "units": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dropout": 0.0, "unit_forget_bias": true, "recurrent_regularizer": null, "name": "lstm_1", "trainable": true, "kernel_constraint": null, "go_backwards": false, "activation": "tanh", "return_sequences": true, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}, "class_name": "VarianceScaling"}, "use_bias": true, "dtype": "float32", "recurrent_activation": "hard_sigmoid", "batch_input_shape": [null, 1, 52], "stateful": false, "unroll": false, "activity_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_constraint": null, "recurrent_dropout": 0.0, "implementation": 0}, "class_name": "LSTM"}, {"config": {"kernel_regularizer": null, "bias_constraint": null, "trainable": true, "units": 1, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}, "class_name": "VarianceScaling"}, "activation": "relu", "use_bias": true, "kernel_constraint": null, "name": "dense_1", "bias_regularizer": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.2"}