{"keras_version": "2.0.2", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"batch_input_shape": [null, 1, 48], "dtype": "float32", "recurrent_dropout": 0.0, "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null, "unroll": false, "return_sequences": true, "use_bias": true, "implementation": 0, "recurrent_constraint": null, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "distribution": "normal", "scale": 2.0}}, "dropout": 0.0, "bias_regularizer": null, "stateful": false, "trainable": true, "kernel_constraint": null, "units": 2, "recurrent_activation": "hard_sigmoid", "name": "lstm_1", "kernel_regularizer": null, "go_backwards": false, "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null}}, {"class_name": "LSTM", "config": {"activity_regularizer": null, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null, "unroll": false, "return_sequences": true, "use_bias": true, "implementation": 0, "recurrent_constraint": null, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "distribution": "normal", "scale": 2.0}}, "dropout": 0.0, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "units": 32, "recurrent_activation": "hard_sigmoid", "name": "lstm_2", "kernel_regularizer": null, "go_backwards": false, "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "recurrent_regularizer": null}}, {"class_name": "LSTM", "config": {"activity_regularizer": null, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null, "unroll": false, "return_sequences": true, "use_bias": true, "implementation": 0, "recurrent_constraint": null, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "distribution": "normal", "scale": 2.0}}, "dropout": 0.0, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "units": 32, "recurrent_activation": "hard_sigmoid", "name": "lstm_3", "kernel_regularizer": null, "go_backwards": false, "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "recurrent_regularizer": null}}, {"class_name": "LSTM", "config": {"activity_regularizer": null, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null, "unroll": false, "return_sequences": true, "use_bias": true, "implementation": 0, "recurrent_constraint": null, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "distribution": "normal", "scale": 2.0}}, "dropout": 0.0, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "units": 2, "recurrent_activation": "hard_sigmoid", "name": "lstm_4", "kernel_regularizer": null, "go_backwards": false, "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "recurrent_regularizer": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "distribution": "normal", "scale": 2.0}}, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "units": 1, "name": "dense_1", "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu"}}], "backend": "tensorflow"}