{"config": [{"config": {"go_backwards": false, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_regularizer": null, "dropout": 0.0, "bias_constraint": null, "recurrent_dropout": 0.0, "recurrent_constraint": null, "activity_regularizer": null, "name": "lstm_1", "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "unroll": false, "unit_forget_bias": true, "trainable": true, "activation": "tanh", "units": 128, "kernel_regularizer": null, "stateful": false, "dtype": "float32", "batch_input_shape": [null, 1, 52], "use_bias": true, "implementation": 0, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "LSTM"}, {"config": {"kernel_constraint": null, "name": "dense_1", "trainable": true, "activation": "relu", "units": 1, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.2"}