{"config": [{"class_name": "LSTM", "config": {"recurrent_regularizer": null, "return_sequences": true, "bias_regularizer": null, "units": 64, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "batch_input_shape": [null, 1, 48], "trainable": true, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "unroll": false, "implementation": 0, "go_backwards": false, "dtype": "float32", "name": "lstm_1", "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "recurrent_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "stateful": false, "bias_constraint": null, "kernel_regularizer": null}}, {"class_name": "LSTM", "config": {"recurrent_regularizer": null, "return_sequences": true, "bias_regularizer": null, "units": 8, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "trainable": true, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "unroll": false, "implementation": 0, "go_backwards": false, "name": "lstm_2", "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "recurrent_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "stateful": false, "bias_constraint": null, "kernel_regularizer": null}}, {"class_name": "LSTM", "config": {"recurrent_regularizer": null, "return_sequences": true, "bias_regularizer": null, "units": 2, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "trainable": true, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "unroll": false, "implementation": 0, "go_backwards": false, "name": "lstm_3", "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "recurrent_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "stateful": false, "bias_constraint": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"trainable": true, "activation": "relu", "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "units": 1, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "name": "dense_1", "kernel_regularizer": null}}], "class_name": "Sequential", "keras_version": "2.0.2", "backend": "tensorflow"}