{"backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"recurrent_regularizer": null, "units": 128, "kernel_constraint": null, "kernel_regularizer": null, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_constraint": null, "bias_constraint": null, "stateful": false, "unroll": false, "use_bias": true, "implementation": 0, "dtype": "float32", "activation": "tanh", "bias_regularizer": null, "unit_forget_bias": true, "activity_regularizer": null, "dropout": 0.0, "go_backwards": false, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 1, 16], "name": "lstm_1", "recurrent_activation": "hard_sigmoid", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "relu", "units": 1, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "dense_1", "trainable": true}}], "class_name": "Sequential", "keras_version": "2.0.2"}