{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.2", "config": [{"class_name": "LSTM", "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activity_regularizer": null, "dropout": 0.0, "implementation": 0, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "trainable": true, "return_sequences": true, "bias_regularizer": null, "kernel_constraint": null, "batch_input_shape": [null, 1, 52], "go_backwards": false, "recurrent_activation": "hard_sigmoid", "unroll": false, "activation": "tanh", "recurrent_constraint": null, "unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}}, "name": "lstm_1", "stateful": false, "units": 128, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "dtype": "float32"}}, {"class_name": "LSTM", "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}}, "activity_regularizer": null, "dropout": 0.0, "implementation": 0, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "trainable": true, "return_sequences": true, "kernel_constraint": null, "bias_regularizer": null, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "unroll": false, "activation": "tanh", "recurrent_constraint": null, "unit_forget_bias": true, "kernel_regularizer": null, "name": "lstm_2", "stateful": false, "units": 64, "recurrent_dropout": 0.0, "recurrent_regularizer": null}}, {"class_name": "LSTM", "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}}, "activity_regularizer": null, "dropout": 0.0, "implementation": 0, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "trainable": true, "return_sequences": true, "kernel_constraint": null, "bias_regularizer": null, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "unroll": false, "activation": "tanh", "recurrent_constraint": null, "unit_forget_bias": true, "kernel_regularizer": null, "name": "lstm_3", "stateful": false, "units": 2, "recurrent_dropout": 0.0, "recurrent_regularizer": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}}, "name": "dense_1", "bias_regularizer": null, "units": 1}}]}