{"class_name": "Sequential", "keras_version": "2.0.2", "config": [{"class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "activity_regularizer": null, "activation": "tanh", "go_backwards": false, "dtype": "float32", "batch_input_shape": [null, 1, 48], "stateful": false, "dropout": 0.0, "implementation": 0, "recurrent_regularizer": null, "trainable": true, "kernel_constraint": null, "units": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "recurrent_dropout": 0.0, "bias_constraint": null, "kernel_regularizer": null, "name": "lstm_1", "unit_forget_bias": true, "unroll": false, "recurrent_constraint": null, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "activity_regularizer": null, "activation": "tanh", "go_backwards": false, "stateful": false, "dropout": 0.0, "implementation": 0, "recurrent_regularizer": null, "trainable": true, "kernel_constraint": null, "units": 8, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "recurrent_dropout": 0.0, "bias_constraint": null, "kernel_regularizer": null, "name": "lstm_2", "unit_forget_bias": true, "unroll": false, "recurrent_constraint": null, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "activity_regularizer": null, "activation": "tanh", "go_backwards": false, "stateful": false, "dropout": 0.0, "implementation": 0, "recurrent_regularizer": null, "trainable": true, "kernel_constraint": null, "units": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "recurrent_dropout": 0.0, "bias_constraint": null, "kernel_regularizer": null, "name": "lstm_3", "unit_forget_bias": true, "unroll": false, "recurrent_constraint": null, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "activity_regularizer": null, "activation": "tanh", "go_backwards": false, "stateful": false, "dropout": 0.0, "implementation": 0, "recurrent_regularizer": null, "trainable": true, "kernel_constraint": null, "units": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "recurrent_dropout": 0.0, "bias_constraint": null, "kernel_regularizer": null, "name": "lstm_4", "unit_forget_bias": true, "unroll": false, "recurrent_constraint": null, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "activity_regularizer": null, "activation": "tanh", "go_backwards": false, "stateful": false, "dropout": 0.0, "implementation": 0, "recurrent_regularizer": null, "trainable": true, "kernel_constraint": null, "units": 8, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "recurrent_dropout": 0.0, "bias_constraint": null, "kernel_regularizer": null, "name": "lstm_5", "unit_forget_bias": true, "unroll": false, "recurrent_constraint": null, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "activity_regularizer": null, "activation": "tanh", "go_backwards": false, "stateful": false, "dropout": 0.0, "implementation": 0, "recurrent_regularizer": null, "trainable": true, "kernel_constraint": null, "units": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "recurrent_dropout": 0.0, "bias_constraint": null, "kernel_regularizer": null, "name": "lstm_6", "unit_forget_bias": true, "unroll": false, "recurrent_constraint": null, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_constraint": null, "units": 1, "use_bias": true, "bias_regularizer": null}}], "backend": "tensorflow"}