{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"bias_constraint": null, "kernel_constraint": null, "trainable": true, "recurrent_regularizer": null, "bias_regularizer": null, "stateful": false, "kernel_regularizer": null, "return_sequences": true, "unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}}, "dtype": "float32", "activation": "tanh", "dropout": 0.0, "use_bias": true, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "go_backwards": false, "activity_regularizer": null, "recurrent_constraint": null, "name": "lstm_1", "implementation": 0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 1, 52], "units": 128}}, {"class_name": "Dense", "config": {"bias_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}}, "activity_regularizer": null, "trainable": true, "name": "dense_1", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1}}], "keras_version": "2.0.2"}