{"backend": "tensorflow", "keras_version": "2.0.2", "config": [{"class_name": "LSTM", "config": {"implementation": 0, "use_bias": true, "kernel_regularizer": null, "return_sequences": true, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "unroll": false, "dtype": "float32", "units": 2, "bias_constraint": null, "unit_forget_bias": true, "dropout": 0.0, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "stateful": false, "bias_regularizer": null, "name": "lstm_1", "batch_input_shape": [null, 1, 48], "recurrent_dropout": 0.0, "trainable": true, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}}}, {"class_name": "LSTM", "config": {"implementation": 0, "kernel_regularizer": null, "return_sequences": true, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "unroll": false, "units": 8, "bias_constraint": null, "unit_forget_bias": true, "dropout": 0.0, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "stateful": false, "bias_regularizer": null, "name": "lstm_2", "use_bias": true, "recurrent_dropout": 0.0, "trainable": true, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}}}, {"class_name": "LSTM", "config": {"implementation": 0, "kernel_regularizer": null, "return_sequences": true, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "unroll": false, "units": 32, "bias_constraint": null, "unit_forget_bias": true, "dropout": 0.0, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "stateful": false, "bias_regularizer": null, "name": "lstm_3", "use_bias": true, "recurrent_dropout": 0.0, "trainable": true, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}}}, {"class_name": "LSTM", "config": {"implementation": 0, "kernel_regularizer": null, "return_sequences": true, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "unroll": false, "units": 32, "bias_constraint": null, "unit_forget_bias": true, "dropout": 0.0, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "stateful": false, "bias_regularizer": null, "name": "lstm_4", "use_bias": true, "recurrent_dropout": 0.0, "trainable": true, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}}}, {"class_name": "LSTM", "config": {"implementation": 0, "kernel_regularizer": null, "return_sequences": true, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "unroll": false, "units": 8, "bias_constraint": null, "unit_forget_bias": true, "dropout": 0.0, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "stateful": false, "bias_regularizer": null, "name": "lstm_5", "use_bias": true, "recurrent_dropout": 0.0, "trainable": true, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}}}, {"class_name": "LSTM", "config": {"implementation": 0, "kernel_regularizer": null, "return_sequences": true, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "unroll": false, "units": 2, "bias_constraint": null, "unit_forget_bias": true, "dropout": 0.0, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "stateful": false, "bias_regularizer": null, "name": "lstm_6", "use_bias": true, "recurrent_dropout": 0.0, "trainable": true, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "use_bias": true, "units": 1, "bias_constraint": null, "trainable": true, "activation": "relu", "kernel_constraint": null}}], "class_name": "Sequential"}