{"keras_version": "2.0.2", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "activity_regularizer": null, "implementation": 0, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "stateful": false, "go_backwards": false, "batch_input_shape": [null, 1, 48], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "recurrent_regularizer": null, "trainable": true, "unroll": false, "unit_forget_bias": true, "bias_constraint": null, "kernel_regularizer": null, "dtype": "float32", "return_sequences": true, "name": "lstm_1", "recurrent_dropout": 0.0, "dropout": 0.0, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "activity_regularizer": null, "implementation": 0, "name": "lstm_2", "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "stateful": false, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "recurrent_regularizer": null, "trainable": true, "unroll": false, "unit_forget_bias": true, "bias_constraint": null, "kernel_regularizer": null, "return_sequences": true, "activation": "tanh", "recurrent_dropout": 0.0, "dropout": 0.0, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "activity_regularizer": null, "implementation": 0, "name": "lstm_3", "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "stateful": false, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "recurrent_regularizer": null, "trainable": true, "unroll": false, "unit_forget_bias": true, "bias_constraint": null, "kernel_regularizer": null, "return_sequences": true, "activation": "tanh", "recurrent_dropout": 0.0, "dropout": 0.0, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 16, "activity_regularizer": null, "implementation": 0, "name": "lstm_4", "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "stateful": false, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "recurrent_regularizer": null, "trainable": true, "unroll": false, "unit_forget_bias": true, "bias_constraint": null, "kernel_regularizer": null, "return_sequences": true, "activation": "tanh", "recurrent_dropout": 0.0, "dropout": 0.0, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "name": "dense_1", "activation": "relu", "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "units": 1}}], "backend": "tensorflow"}