{"config": [{"config": {"trainable": true, "recurrent_constraint": null, "go_backwards": false, "kernel_regularizer": null, "recurrent_dropout": 0.0, "unit_forget_bias": true, "units": 8, "unroll": false, "use_bias": true, "kernel_constraint": null, "batch_input_shape": [null, 1, 48], "kernel_initializer": {"config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "return_sequences": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "dtype": "float32", "bias_constraint": null, "activity_regularizer": null, "name": "lstm_1", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "stateful": false, "bias_regularizer": null, "implementation": 0, "dropout": 0.0}, "class_name": "LSTM"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "kernel_initializer": {"config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "recurrent_dropout": 0.0, "unit_forget_bias": true, "units": 128, "unroll": false, "use_bias": true, "kernel_constraint": null, "recurrent_constraint": null, "dropout": 0.0, "kernel_regularizer": null, "return_sequences": true, "activation": "tanh", "bias_constraint": null, "activity_regularizer": null, "name": "lstm_2", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_activation": "hard_sigmoid", "stateful": false, "bias_regularizer": null, "implementation": 0, "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "kernel_initializer": {"config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "recurrent_dropout": 0.0, "unit_forget_bias": true, "units": 8, "unroll": false, "use_bias": true, "kernel_constraint": null, "recurrent_constraint": null, "dropout": 0.0, "kernel_regularizer": null, "return_sequences": true, "activation": "tanh", "bias_constraint": null, "activity_regularizer": null, "name": "lstm_3", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_activation": "hard_sigmoid", "stateful": false, "bias_regularizer": null, "implementation": 0, "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"trainable": true, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "name": "dense_1", "units": 1, "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.0.2", "class_name": "Sequential"}