{"config": [{"config": {"trainable": true, "units": 128, "recurrent_regularizer": null, "kernel_constraint": null, "activation": "tanh", "bias_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "use_bias": true, "bias_regularizer": null, "unroll": false, "stateful": false, "dtype": "float32", "activity_regularizer": null, "return_sequences": true, "kernel_initializer": {"config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "recurrent_dropout": 0.0, "recurrent_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "batch_input_shape": [null, 1, 52], "recurrent_activation": "hard_sigmoid", "go_backwards": false, "unit_forget_bias": true, "implementation": 0, "name": "lstm_1", "dropout": 0.0}, "class_name": "LSTM"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "units": 1, "use_bias": true, "name": "dense_1", "bias_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.2", "backend": "tensorflow"}