{"config": [{"config": {"kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_regularizer": null, "dtype": "float32", "kernel_constraint": null, "unit_forget_bias": true, "activation": "tanh", "bias_regularizer": null, "return_sequences": true, "use_bias": true, "batch_input_shape": [null, 1, 52], "trainable": true, "name": "lstm_1", "bias_constraint": null, "implementation": 0, "stateful": false, "units": 128, "activity_regularizer": null, "kernel_regularizer": null, "unroll": false, "dropout": 0.0, "recurrent_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "go_backwards": false}, "class_name": "LSTM"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_regularizer": null, "kernel_constraint": null, "unit_forget_bias": true, "activation": "tanh", "bias_regularizer": null, "return_sequences": true, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "lstm_2", "bias_constraint": null, "implementation": 0, "stateful": false, "units": 64, "activity_regularizer": null, "kernel_regularizer": null, "unroll": false, "dropout": 0.0, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "go_backwards": false}, "class_name": "LSTM"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_regularizer": null, "kernel_constraint": null, "unit_forget_bias": true, "activation": "tanh", "bias_regularizer": null, "return_sequences": true, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "lstm_3", "bias_constraint": null, "implementation": 0, "stateful": false, "units": 2, "activity_regularizer": null, "kernel_regularizer": null, "unroll": false, "dropout": 0.0, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "go_backwards": false}, "class_name": "LSTM"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "units": 1, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.2"}