{"config": [{"config": {"recurrent_activation": "hard_sigmoid", "dtype": "float32", "kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "go_backwards": false, "recurrent_constraint": null, "use_bias": true, "recurrent_regularizer": null, "trainable": true, "units": 2, "batch_input_shape": [null, 1, 48], "bias_constraint": null, "dropout": 0.0, "unit_forget_bias": true, "bias_regularizer": null, "stateful": false, "name": "lstm_1", "kernel_regularizer": null, "unroll": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "return_sequences": true, "activity_regularizer": null, "implementation": 0, "activation": "tanh", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 0.0}, "class_name": "LSTM"}, {"config": {"recurrent_activation": "hard_sigmoid", "units": 8, "kernel_constraint": null, "go_backwards": false, "recurrent_constraint": null, "use_bias": true, "recurrent_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "activation": "tanh", "bias_constraint": null, "name": "lstm_2", "unit_forget_bias": true, "stateful": false, "dropout": 0.0, "kernel_regularizer": null, "unroll": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "return_sequences": true, "activity_regularizer": null, "implementation": 0, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 0.0}, "class_name": "LSTM"}, {"config": {"recurrent_activation": "hard_sigmoid", "units": 32, "kernel_constraint": null, "go_backwards": false, "recurrent_constraint": null, "use_bias": true, "recurrent_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "activation": "tanh", "bias_constraint": null, "name": "lstm_3", "unit_forget_bias": true, "stateful": false, "dropout": 0.0, "kernel_regularizer": null, "unroll": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "return_sequences": true, "activity_regularizer": null, "implementation": 0, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 0.0}, "class_name": "LSTM"}, {"config": {"recurrent_activation": "hard_sigmoid", "units": 32, "kernel_constraint": null, "go_backwards": false, "recurrent_constraint": null, "use_bias": true, "recurrent_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "activation": "tanh", "bias_constraint": null, "name": "lstm_4", "unit_forget_bias": true, "stateful": false, "dropout": 0.0, "kernel_regularizer": null, "unroll": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "return_sequences": true, "activity_regularizer": null, "implementation": 0, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 0.0}, "class_name": "LSTM"}, {"config": {"recurrent_activation": "hard_sigmoid", "units": 8, "kernel_constraint": null, "go_backwards": false, "recurrent_constraint": null, "use_bias": true, "recurrent_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "activation": "tanh", "bias_constraint": null, "name": "lstm_5", "unit_forget_bias": true, "stateful": false, "dropout": 0.0, "kernel_regularizer": null, "unroll": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "return_sequences": true, "activity_regularizer": null, "implementation": 0, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 0.0}, "class_name": "LSTM"}, {"config": {"recurrent_activation": "hard_sigmoid", "units": 2, "kernel_constraint": null, "go_backwards": false, "recurrent_constraint": null, "use_bias": true, "recurrent_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "activation": "tanh", "bias_constraint": null, "name": "lstm_6", "unit_forget_bias": true, "stateful": false, "dropout": 0.0, "kernel_regularizer": null, "unroll": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "return_sequences": true, "activity_regularizer": null, "implementation": 0, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 0.0}, "class_name": "LSTM"}, {"config": {"units": 1, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "name": "dense_1", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "keras_version": "2.0.2", "backend": "tensorflow", "class_name": "Sequential"}