{"config": [{"config": {"batch_input_shape": [null, 1, 48], "recurrent_dropout": 0.0, "unroll": false, "unit_forget_bias": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "stateful": false, "implementation": 0, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "units": 2, "recurrent_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "activation": "tanh", "recurrent_constraint": null, "name": "lstm_1", "use_bias": true, "dtype": "float32", "return_sequences": true, "activity_regularizer": null, "bias_regularizer": null, "go_backwards": false}, "class_name": "LSTM"}, {"config": {"recurrent_dropout": 0.0, "unroll": false, "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "stateful": false, "implementation": 0, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "units": 8, "recurrent_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "activation": "tanh", "recurrent_constraint": null, "name": "lstm_2", "use_bias": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "return_sequences": true, "activity_regularizer": null, "bias_regularizer": null, "go_backwards": false}, "class_name": "LSTM"}, {"config": {"recurrent_dropout": 0.0, "unroll": false, "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "stateful": false, "implementation": 0, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "units": 128, "recurrent_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "activation": "tanh", "recurrent_constraint": null, "name": "lstm_3", "use_bias": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "return_sequences": true, "activity_regularizer": null, "bias_regularizer": null, "go_backwards": false}, "class_name": "LSTM"}, {"config": {"recurrent_dropout": 0.0, "unroll": false, "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "stateful": false, "implementation": 0, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "units": 8, "recurrent_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "activation": "tanh", "recurrent_constraint": null, "name": "lstm_4", "use_bias": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "return_sequences": true, "activity_regularizer": null, "bias_regularizer": null, "go_backwards": false}, "class_name": "LSTM"}, {"config": {"recurrent_dropout": 0.0, "unroll": false, "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "stateful": false, "implementation": 0, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "units": 2, "recurrent_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "activation": "tanh", "recurrent_constraint": null, "name": "lstm_5", "use_bias": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "return_sequences": true, "activity_regularizer": null, "bias_regularizer": null, "go_backwards": false}, "class_name": "LSTM"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "use_bias": true, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "units": 1}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.2", "backend": "tensorflow"}