{"backend": "tensorflow", "keras_version": "2.0.2", "config": [{"config": {"use_bias": true, "unroll": false, "trainable": true, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "go_backwards": false, "units": 8, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_regularizer": null, "dropout": 0.0, "return_sequences": true, "activation": "tanh", "kernel_initializer": {"config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "name": "lstm_1", "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unit_forget_bias": true, "bias_constraint": null, "stateful": false, "recurrent_dropout": 0.0, "kernel_regularizer": null, "implementation": 0, "recurrent_constraint": null, "batch_input_shape": [null, 1, 48]}, "class_name": "LSTM"}, {"config": {"use_bias": true, "unroll": false, "trainable": true, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "go_backwards": false, "units": 8, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_regularizer": null, "dropout": 0.0, "return_sequences": true, "activation": "tanh", "kernel_initializer": {"config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "name": "lstm_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unit_forget_bias": true, "bias_constraint": null, "stateful": false, "recurrent_dropout": 0.0, "kernel_regularizer": null, "implementation": 0, "recurrent_constraint": null}, "class_name": "LSTM"}, {"config": {"use_bias": true, "unroll": false, "trainable": true, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "go_backwards": false, "units": 8, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_regularizer": null, "dropout": 0.0, "return_sequences": true, "activation": "tanh", "kernel_initializer": {"config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "name": "lstm_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unit_forget_bias": true, "bias_constraint": null, "stateful": false, "recurrent_dropout": 0.0, "kernel_regularizer": null, "implementation": 0, "recurrent_constraint": null}, "class_name": "LSTM"}, {"config": {"use_bias": true, "unroll": false, "trainable": true, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "go_backwards": false, "units": 8, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_regularizer": null, "dropout": 0.0, "return_sequences": true, "activation": "tanh", "kernel_initializer": {"config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "name": "lstm_4", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unit_forget_bias": true, "bias_constraint": null, "stateful": false, "recurrent_dropout": 0.0, "kernel_regularizer": null, "implementation": 0, "recurrent_constraint": null}, "class_name": "LSTM"}, {"config": {"use_bias": true, "unroll": false, "trainable": true, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "go_backwards": false, "units": 8, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_regularizer": null, "dropout": 0.0, "return_sequences": true, "activation": "tanh", "kernel_initializer": {"config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "name": "lstm_5", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unit_forget_bias": true, "bias_constraint": null, "stateful": false, "recurrent_dropout": 0.0, "kernel_regularizer": null, "implementation": 0, "recurrent_constraint": null}, "class_name": "LSTM"}, {"config": {"use_bias": true, "unroll": false, "trainable": true, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "go_backwards": false, "units": 8, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_regularizer": null, "dropout": 0.0, "return_sequences": true, "activation": "tanh", "kernel_initializer": {"config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "name": "lstm_6", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unit_forget_bias": true, "bias_constraint": null, "stateful": false, "recurrent_dropout": 0.0, "kernel_regularizer": null, "implementation": 0, "recurrent_constraint": null}, "class_name": "LSTM"}, {"config": {"bias_regularizer": null, "use_bias": true, "name": "dense_1", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "units": 1, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}