{"class_name": "Sequential", "keras_version": "2.0.2", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"recurrent_regularizer": null, "unit_forget_bias": true, "bias_regularizer": null, "recurrent_constraint": null, "dtype": "float32", "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "batch_input_shape": [null, 1, 48], "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "kernel_regularizer": null, "implementation": 0, "go_backwards": false, "trainable": true, "return_sequences": true, "units": 2, "kernel_constraint": null, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "stateful": false, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "name": "lstm_1", "activation": "tanh"}}, {"class_name": "LSTM", "config": {"recurrent_regularizer": null, "bias_regularizer": null, "stateful": false, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "name": "lstm_2", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "kernel_regularizer": null, "implementation": 0, "go_backwards": false, "trainable": true, "return_sequences": true, "units": 4, "kernel_constraint": null, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "unit_forget_bias": true, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"recurrent_regularizer": null, "bias_regularizer": null, "stateful": false, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "name": "lstm_3", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "kernel_regularizer": null, "implementation": 0, "go_backwards": false, "trainable": true, "return_sequences": true, "units": 8, "kernel_constraint": null, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "unit_forget_bias": true, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"recurrent_regularizer": null, "bias_regularizer": null, "stateful": false, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "name": "lstm_4", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "kernel_regularizer": null, "implementation": 0, "go_backwards": false, "trainable": true, "return_sequences": true, "units": 2, "kernel_constraint": null, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "unit_forget_bias": true, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"recurrent_regularizer": null, "bias_regularizer": null, "stateful": false, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "name": "lstm_5", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "kernel_regularizer": null, "implementation": 0, "go_backwards": false, "trainable": true, "return_sequences": true, "units": 8, "kernel_constraint": null, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "unit_forget_bias": true, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"recurrent_regularizer": null, "bias_regularizer": null, "stateful": false, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "name": "lstm_6", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "kernel_regularizer": null, "implementation": 0, "go_backwards": false, "trainable": true, "return_sequences": true, "units": 4, "kernel_constraint": null, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "unit_forget_bias": true, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"recurrent_regularizer": null, "bias_regularizer": null, "stateful": false, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "name": "lstm_7", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "kernel_regularizer": null, "implementation": 0, "go_backwards": false, "trainable": true, "return_sequences": true, "units": 2, "kernel_constraint": null, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "unit_forget_bias": true, "activation": "tanh"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "units": 1, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "name": "dense_1", "use_bias": true}}]}