{"keras_version": "2.0.2", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "dtype": "float32", "activity_regularizer": null, "implementation": 0, "return_sequences": true, "recurrent_regularizer": null, "activation": "tanh", "kernel_regularizer": null, "dropout": 0.0, "unit_forget_bias": true, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "lstm_1", "trainable": true, "go_backwards": false, "units": 2, "unroll": false, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "recurrent_constraint": null, "batch_input_shape": [null, 1, 48], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "implementation": 0, "return_sequences": true, "recurrent_regularizer": null, "activation": "tanh", "kernel_regularizer": null, "dropout": 0.0, "unit_forget_bias": true, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "lstm_2", "trainable": true, "go_backwards": false, "units": 8, "unroll": false, "bias_regularizer": null, "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "kernel_constraint": null}}, {"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "implementation": 0, "return_sequences": true, "recurrent_regularizer": null, "activation": "tanh", "kernel_regularizer": null, "dropout": 0.0, "unit_forget_bias": true, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "lstm_3", "trainable": true, "go_backwards": false, "units": 32, "unroll": false, "bias_regularizer": null, "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "kernel_constraint": null}}, {"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "implementation": 0, "return_sequences": true, "recurrent_regularizer": null, "activation": "tanh", "kernel_regularizer": null, "dropout": 0.0, "unit_forget_bias": true, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "lstm_4", "trainable": true, "go_backwards": false, "units": 32, "unroll": false, "bias_regularizer": null, "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "kernel_constraint": null}}, {"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "implementation": 0, "return_sequences": true, "recurrent_regularizer": null, "activation": "tanh", "kernel_regularizer": null, "dropout": 0.0, "unit_forget_bias": true, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "lstm_5", "trainable": true, "go_backwards": false, "units": 8, "unroll": false, "bias_regularizer": null, "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "kernel_constraint": null}}, {"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "implementation": 0, "return_sequences": true, "recurrent_regularizer": null, "activation": "tanh", "kernel_regularizer": null, "dropout": 0.0, "unit_forget_bias": true, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "lstm_6", "trainable": true, "go_backwards": false, "units": 2, "unroll": false, "bias_regularizer": null, "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_constraint": null, "units": 1, "activity_regularizer": null, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "dense_1"}}]}