{"keras_version": "2.0.2", "backend": "tensorflow", "config": [{"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "kernel_regularizer": null, "go_backwards": false, "recurrent_dropout": 0.0, "activation": "tanh", "unroll": false, "kernel_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "stateful": false, "dropout": 0.0, "recurrent_constraint": null, "recurrent_regularizer": null, "batch_input_shape": [null, 1, 48], "activity_regularizer": null, "return_sequences": true, "units": 2, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "lstm_1", "implementation": 0}, "class_name": "LSTM"}, {"config": {"recurrent_dropout": 0.0, "kernel_regularizer": null, "go_backwards": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "kernel_constraint": null, "unroll": false, "implementation": 0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "stateful": false, "dropout": 0.0, "recurrent_constraint": null, "recurrent_regularizer": null, "activity_regularizer": null, "return_sequences": true, "units": 32, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "name": "lstm_2", "bias_constraint": null}, "class_name": "LSTM"}, {"config": {"recurrent_dropout": 0.0, "kernel_regularizer": null, "go_backwards": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "kernel_constraint": null, "unroll": false, "implementation": 0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "stateful": false, "dropout": 0.0, "recurrent_constraint": null, "recurrent_regularizer": null, "activity_regularizer": null, "return_sequences": true, "units": 64, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "name": "lstm_3", "bias_constraint": null}, "class_name": "LSTM"}, {"config": {"recurrent_dropout": 0.0, "kernel_regularizer": null, "go_backwards": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "kernel_constraint": null, "unroll": false, "implementation": 0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "stateful": false, "dropout": 0.0, "recurrent_constraint": null, "recurrent_regularizer": null, "activity_regularizer": null, "return_sequences": true, "units": 64, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "name": "lstm_4", "bias_constraint": null}, "class_name": "LSTM"}, {"config": {"recurrent_dropout": 0.0, "kernel_regularizer": null, "go_backwards": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "kernel_constraint": null, "unroll": false, "implementation": 0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "stateful": false, "dropout": 0.0, "recurrent_constraint": null, "recurrent_regularizer": null, "activity_regularizer": null, "return_sequences": true, "units": 32, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "name": "lstm_5", "bias_constraint": null}, "class_name": "LSTM"}, {"config": {"recurrent_dropout": 0.0, "kernel_regularizer": null, "go_backwards": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "kernel_constraint": null, "unroll": false, "implementation": 0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "stateful": false, "dropout": 0.0, "recurrent_constraint": null, "recurrent_regularizer": null, "activity_regularizer": null, "return_sequences": true, "units": 2, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "name": "lstm_6", "bias_constraint": null}, "class_name": "LSTM"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activity_regularizer": null, "units": 1, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "dense_1", "activation": "relu"}, "class_name": "Dense"}], "class_name": "Sequential"}