{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.2", "config": [{"class_name": "LSTM", "config": {"recurrent_regularizer": null, "batch_input_shape": [null, 1, 48], "stateful": false, "unit_forget_bias": true, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "name": "lstm_1", "activity_regularizer": null, "kernel_regularizer": null, "recurrent_constraint": null, "implementation": 0, "return_sequences": true, "trainable": true, "unroll": false, "dropout": 0.0, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}}, "go_backwards": false, "units": 2, "kernel_constraint": null, "bias_regularizer": null, "dtype": "float32", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "LSTM", "config": {"recurrent_regularizer": null, "recurrent_constraint": null, "stateful": false, "unit_forget_bias": true, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "name": "lstm_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}}, "activity_regularizer": null, "kernel_regularizer": null, "implementation": 0, "return_sequences": true, "trainable": true, "unroll": false, "dropout": 0.0, "recurrent_dropout": 0.0, "bias_regularizer": null, "go_backwards": false, "units": 8, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "LSTM", "config": {"recurrent_regularizer": null, "recurrent_constraint": null, "stateful": false, "unit_forget_bias": true, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "name": "lstm_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}}, "activity_regularizer": null, "kernel_regularizer": null, "implementation": 0, "return_sequences": true, "trainable": true, "unroll": false, "dropout": 0.0, "recurrent_dropout": 0.0, "bias_regularizer": null, "go_backwards": false, "units": 32, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "LSTM", "config": {"recurrent_regularizer": null, "recurrent_constraint": null, "stateful": false, "unit_forget_bias": true, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "name": "lstm_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}}, "activity_regularizer": null, "kernel_regularizer": null, "implementation": 0, "return_sequences": true, "trainable": true, "unroll": false, "dropout": 0.0, "recurrent_dropout": 0.0, "bias_regularizer": null, "go_backwards": false, "units": 32, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "LSTM", "config": {"recurrent_regularizer": null, "recurrent_constraint": null, "stateful": false, "unit_forget_bias": true, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "name": "lstm_5", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}}, "activity_regularizer": null, "kernel_regularizer": null, "implementation": 0, "return_sequences": true, "trainable": true, "unroll": false, "dropout": 0.0, "recurrent_dropout": 0.0, "bias_regularizer": null, "go_backwards": false, "units": 8, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "LSTM", "config": {"recurrent_regularizer": null, "recurrent_constraint": null, "stateful": false, "unit_forget_bias": true, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "name": "lstm_6", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}}, "activity_regularizer": null, "kernel_regularizer": null, "implementation": 0, "return_sequences": true, "trainable": true, "unroll": false, "dropout": 0.0, "recurrent_dropout": 0.0, "bias_regularizer": null, "go_backwards": false, "units": 2, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "Dense", "config": {"trainable": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "units": 1, "kernel_constraint": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}}, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null}}]}