{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.2", "config": [{"class_name": "LSTM", "config": {"stateful": false, "unroll": false, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "recurrent_constraint": null, "use_bias": true, "dtype": "float32", "batch_input_shape": [null, 1, 52], "name": "lstm_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "trainable": true, "return_sequences": true, "kernel_constraint": null, "unit_forget_bias": true, "implementation": 0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "activity_regularizer": null, "dropout": 0.0, "bias_regularizer": null, "go_backwards": false, "units": 128, "bias_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "activation": "tanh"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "activation": "relu", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "units": 1, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true}}]}