{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"unroll": false, "batch_input_shape": [null, 1, 52], "recurrent_regularizer": null, "name": "lstm_1", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "trainable": true, "stateful": false, "unit_forget_bias": true, "go_backwards": false, "implementation": 0, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "units": 128, "recurrent_dropout": 0.0, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "activation": "tanh", "dtype": "float32", "return_sequences": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "units": 1, "activation": "relu", "bias_constraint": null, "trainable": true, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "kernel_constraint": null, "activity_regularizer": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "keras_version": "2.0.2"}