{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"unroll": false, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "implementation": 0, "trainable": true, "activation": "tanh", "dropout": 0.0, "recurrent_dropout": 0.0, "units": 2, "go_backwards": false, "kernel_constraint": null, "dtype": "float32", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "mode": "fan_in", "scale": 2.0}}, "bias_regularizer": null, "bias_constraint": null, "return_sequences": true, "stateful": false, "use_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "batch_input_shape": [null, 1, 52], "name": "lstm_1"}}, {"class_name": "LSTM", "config": {"unroll": false, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "implementation": 0, "trainable": true, "activation": "tanh", "dropout": 0.0, "recurrent_dropout": 0.0, "units": 8, "go_backwards": false, "kernel_constraint": null, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "mode": "fan_in", "scale": 2.0}}, "stateful": false, "bias_constraint": null, "return_sequences": true, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_2"}}, {"class_name": "LSTM", "config": {"unroll": false, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "implementation": 0, "trainable": true, "activation": "tanh", "dropout": 0.0, "recurrent_dropout": 0.0, "units": 16, "go_backwards": false, "kernel_constraint": null, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "mode": "fan_in", "scale": 2.0}}, "stateful": false, "bias_constraint": null, "return_sequences": true, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_3"}}, {"class_name": "LSTM", "config": {"unroll": false, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "implementation": 0, "trainable": true, "activation": "tanh", "dropout": 0.0, "recurrent_dropout": 0.0, "units": 128, "go_backwards": false, "kernel_constraint": null, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "mode": "fan_in", "scale": 2.0}}, "stateful": false, "bias_constraint": null, "return_sequences": true, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_4"}}, {"class_name": "LSTM", "config": {"unroll": false, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "implementation": 0, "trainable": true, "activation": "tanh", "dropout": 0.0, "recurrent_dropout": 0.0, "units": 16, "go_backwards": false, "kernel_constraint": null, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "mode": "fan_in", "scale": 2.0}}, "stateful": false, "bias_constraint": null, "return_sequences": true, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_5"}}, {"class_name": "LSTM", "config": {"unroll": false, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "implementation": 0, "trainable": true, "activation": "tanh", "dropout": 0.0, "recurrent_dropout": 0.0, "units": 8, "go_backwards": false, "kernel_constraint": null, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "mode": "fan_in", "scale": 2.0}}, "stateful": false, "bias_constraint": null, "return_sequences": true, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_6"}}, {"class_name": "LSTM", "config": {"unroll": false, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "implementation": 0, "trainable": true, "activation": "tanh", "dropout": 0.0, "recurrent_dropout": 0.0, "units": 2, "go_backwards": false, "kernel_constraint": null, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "mode": "fan_in", "scale": 2.0}}, "stateful": false, "bias_constraint": null, "return_sequences": true, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_7"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "mode": "fan_in", "scale": 2.0}}, "kernel_constraint": null, "name": "dense_1"}}], "keras_version": "2.0.2", "backend": "tensorflow"}