{"config": [{"config": {"name": "lstm_1", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_constraint": null, "implementation": 0, "unroll": false, "trainable": true, "unit_forget_bias": true, "batch_input_shape": [null, 1, 48], "recurrent_dropout": 0.0, "activity_regularizer": null, "return_sequences": true, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "dtype": "float32", "go_backwards": false, "stateful": false, "recurrent_constraint": null, "units": 64, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activation": "tanh", "dropout": 0.0, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM"}, {"config": {"name": "lstm_2", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_constraint": null, "implementation": 0, "unroll": false, "trainable": true, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "units": 8, "return_sequences": true, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "go_backwards": false, "stateful": false, "recurrent_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activation": "tanh", "dropout": 0.0, "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"name": "lstm_3", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_constraint": null, "implementation": 0, "unroll": false, "trainable": true, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "units": 2, "return_sequences": true, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "go_backwards": false, "stateful": false, "recurrent_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activation": "tanh", "dropout": 0.0, "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "units": 1, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "activation": "relu", "activity_regularizer": null, "use_bias": true}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.0.2", "class_name": "Sequential"}