{"class_name": "Sequential", "keras_version": "2.0.2", "config": [{"class_name": "LSTM", "config": {"use_bias": true, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 1, 48], "recurrent_dropout": 0.0, "kernel_constraint": null, "go_backwards": false, "dropout": 0.0, "units": 2, "implementation": 0, "recurrent_regularizer": null, "bias_regularizer": null, "name": "lstm_1", "dtype": "float32", "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unroll": false, "trainable": true, "activation": "tanh", "activity_regularizer": null, "return_sequences": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}}, "unit_forget_bias": true, "stateful": false, "recurrent_activation": "hard_sigmoid", "bias_constraint": null}}, {"class_name": "LSTM", "config": {"use_bias": true, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "kernel_constraint": null, "go_backwards": false, "dropout": 0.0, "units": 4, "unit_forget_bias": true, "recurrent_regularizer": null, "bias_regularizer": null, "name": "lstm_2", "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unroll": false, "trainable": true, "activation": "tanh", "return_sequences": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}}, "activity_regularizer": null, "implementation": 0, "stateful": false, "recurrent_activation": "hard_sigmoid", "bias_constraint": null}}, {"class_name": "LSTM", "config": {"use_bias": true, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "kernel_constraint": null, "go_backwards": false, "dropout": 0.0, "units": 8, "unit_forget_bias": true, "recurrent_regularizer": null, "bias_regularizer": null, "name": "lstm_3", "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unroll": false, "trainable": true, "activation": "tanh", "return_sequences": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}}, "activity_regularizer": null, "implementation": 0, "stateful": false, "recurrent_activation": "hard_sigmoid", "bias_constraint": null}}, {"class_name": "LSTM", "config": {"use_bias": true, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "kernel_constraint": null, "go_backwards": false, "dropout": 0.0, "units": 16, "unit_forget_bias": true, "recurrent_regularizer": null, "bias_regularizer": null, "name": "lstm_4", "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unroll": false, "trainable": true, "activation": "tanh", "return_sequences": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}}, "activity_regularizer": null, "implementation": 0, "stateful": false, "recurrent_activation": "hard_sigmoid", "bias_constraint": null}}, {"class_name": "LSTM", "config": {"use_bias": true, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "kernel_constraint": null, "go_backwards": false, "dropout": 0.0, "units": 8, "unit_forget_bias": true, "recurrent_regularizer": null, "bias_regularizer": null, "name": "lstm_5", "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unroll": false, "trainable": true, "activation": "tanh", "return_sequences": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}}, "activity_regularizer": null, "implementation": 0, "stateful": false, "recurrent_activation": "hard_sigmoid", "bias_constraint": null}}, {"class_name": "LSTM", "config": {"use_bias": true, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "kernel_constraint": null, "go_backwards": false, "dropout": 0.0, "units": 4, "unit_forget_bias": true, "recurrent_regularizer": null, "bias_regularizer": null, "name": "lstm_6", "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unroll": false, "trainable": true, "activation": "tanh", "return_sequences": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}}, "activity_regularizer": null, "implementation": 0, "stateful": false, "recurrent_activation": "hard_sigmoid", "bias_constraint": null}}, {"class_name": "LSTM", "config": {"use_bias": true, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "kernel_constraint": null, "go_backwards": false, "dropout": 0.0, "units": 2, "unit_forget_bias": true, "recurrent_regularizer": null, "bias_regularizer": null, "name": "lstm_7", "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unroll": false, "trainable": true, "activation": "tanh", "return_sequences": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}}, "activity_regularizer": null, "implementation": 0, "stateful": false, "recurrent_activation": "hard_sigmoid", "bias_constraint": null}}, {"class_name": "Dense", "config": {"use_bias": true, "trainable": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}}, "units": 1, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null}}], "backend": "tensorflow"}