{"backend": "tensorflow", "config": [{"config": {"go_backwards": false, "name": "lstm_1", "trainable": true, "recurrent_regularizer": null, "recurrent_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "batch_input_shape": [null, 1, 52], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "units": 128, "implementation": 0, "use_bias": true, "return_sequences": true, "kernel_regularizer": null, "dropout": 0.0, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "unroll": false, "stateful": false, "bias_regularizer": null, "activation": "tanh", "kernel_constraint": null}, "class_name": "LSTM"}, {"config": {"go_backwards": false, "name": "lstm_2", "trainable": true, "recurrent_regularizer": null, "recurrent_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 64, "implementation": 0, "use_bias": true, "return_sequences": true, "kernel_regularizer": null, "dropout": 0.0, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "unroll": false, "stateful": false, "bias_regularizer": null, "activation": "tanh", "kernel_constraint": null}, "class_name": "LSTM"}, {"config": {"go_backwards": false, "name": "lstm_3", "trainable": true, "recurrent_regularizer": null, "recurrent_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 2, "implementation": 0, "use_bias": true, "return_sequences": true, "kernel_regularizer": null, "dropout": 0.0, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "unroll": false, "stateful": false, "bias_regularizer": null, "activation": "tanh", "kernel_constraint": null}, "class_name": "LSTM"}, {"config": {"name": "dense_1", "trainable": true, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "units": 1, "kernel_constraint": null}, "class_name": "Dense"}], "keras_version": "2.0.2", "class_name": "Sequential"}