{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.2", "config": [{"class_name": "LSTM", "config": {"unroll": false, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "name": "lstm_1", "bias_constraint": null, "recurrent_regularizer": null, "use_bias": true, "go_backwards": false, "recurrent_constraint": null, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "unit_forget_bias": true, "batch_input_shape": [null, 1, 52], "kernel_constraint": null, "units": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "activation": "tanh", "kernel_regularizer": null, "dtype": "float32", "return_sequences": true, "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "implementation": 0, "stateful": false}}, {"class_name": "LSTM", "config": {"unroll": false, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "activation": "tanh", "bias_constraint": null, "recurrent_regularizer": null, "use_bias": true, "go_backwards": false, "recurrent_constraint": null, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "unit_forget_bias": true, "kernel_constraint": null, "units": 8, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "name": "lstm_2", "kernel_regularizer": null, "return_sequences": true, "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "implementation": 0, "stateful": false}}, {"class_name": "LSTM", "config": {"unroll": false, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "activation": "tanh", "bias_constraint": null, "recurrent_regularizer": null, "use_bias": true, "go_backwards": false, "recurrent_constraint": null, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "unit_forget_bias": true, "kernel_constraint": null, "units": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "name": "lstm_3", "kernel_regularizer": null, "return_sequences": true, "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "implementation": 0, "stateful": false}}, {"class_name": "Dense", "config": {"trainable": true, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "name": "dense_1", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activation": "relu", "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null}}]}