{"keras_version": "2.0.2", "config": [{"class_name": "LSTM", "config": {"dropout": 0.0, "activity_regularizer": null, "return_sequences": true, "recurrent_regularizer": null, "bias_regularizer": null, "dtype": "float32", "unroll": false, "go_backwards": false, "bias_constraint": null, "implementation": 0, "use_bias": true, "batch_input_shape": [null, 1, 48], "units": 2, "trainable": true, "stateful": false, "recurrent_constraint": null, "recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_1", "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true}}, {"class_name": "LSTM", "config": {"dropout": 0.0, "activity_regularizer": null, "return_sequences": true, "recurrent_regularizer": null, "bias_regularizer": null, "units": 4, "unroll": false, "go_backwards": false, "implementation": 0, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "stateful": false, "recurrent_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_2", "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "trainable": true, "recurrent_dropout": 0.0, "kernel_regularizer": null, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true}}, {"class_name": "LSTM", "config": {"dropout": 0.0, "activity_regularizer": null, "return_sequences": true, "recurrent_regularizer": null, "bias_regularizer": null, "units": 8, "unroll": false, "go_backwards": false, "implementation": 0, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "stateful": false, "recurrent_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_3", "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "trainable": true, "recurrent_dropout": 0.0, "kernel_regularizer": null, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true}}, {"class_name": "LSTM", "config": {"dropout": 0.0, "activity_regularizer": null, "return_sequences": true, "recurrent_regularizer": null, "bias_regularizer": null, "units": 2, "unroll": false, "go_backwards": false, "implementation": 0, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "stateful": false, "recurrent_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_4", "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "trainable": true, "recurrent_dropout": 0.0, "kernel_regularizer": null, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true}}, {"class_name": "LSTM", "config": {"dropout": 0.0, "activity_regularizer": null, "return_sequences": true, "recurrent_regularizer": null, "bias_regularizer": null, "units": 8, "unroll": false, "go_backwards": false, "implementation": 0, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "stateful": false, "recurrent_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_5", "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "trainable": true, "recurrent_dropout": 0.0, "kernel_regularizer": null, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true}}, {"class_name": "LSTM", "config": {"dropout": 0.0, "activity_regularizer": null, "return_sequences": true, "recurrent_regularizer": null, "bias_regularizer": null, "units": 4, "unroll": false, "go_backwards": false, "implementation": 0, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "stateful": false, "recurrent_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_6", "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "trainable": true, "recurrent_dropout": 0.0, "kernel_regularizer": null, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true}}, {"class_name": "LSTM", "config": {"dropout": 0.0, "activity_regularizer": null, "return_sequences": true, "recurrent_regularizer": null, "bias_regularizer": null, "units": 2, "unroll": false, "go_backwards": false, "implementation": 0, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "stateful": false, "recurrent_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_7", "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "trainable": true, "recurrent_dropout": 0.0, "kernel_regularizer": null, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true}}, {"class_name": "Dense", "config": {"units": 1, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "relu", "name": "dense_1", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "trainable": true}}], "backend": "tensorflow", "class_name": "Sequential"}