{"config": [{"config": {"activity_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 0.0, "go_backwards": false, "stateful": false, "recurrent_constraint": null, "name": "lstm_1", "bias_constraint": null, "batch_input_shape": [null, 1, 48], "activation": "tanh", "units": 2, "recurrent_regularizer": null, "trainable": true, "implementation": 0, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "dtype": "float32", "kernel_constraint": null, "bias_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "dropout": 0.0, "kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "return_sequences": true, "unroll": false}, "class_name": "LSTM"}, {"config": {"activity_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 0.0, "go_backwards": false, "stateful": false, "recurrent_constraint": null, "name": "lstm_2", "bias_constraint": null, "unroll": false, "activation": "tanh", "units": 2, "recurrent_regularizer": null, "trainable": true, "implementation": 0, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "bias_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "dropout": 0.0, "kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "return_sequences": true}, "class_name": "LSTM"}, {"config": {"activity_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 0.0, "go_backwards": false, "stateful": false, "recurrent_constraint": null, "name": "lstm_3", "bias_constraint": null, "unroll": false, "activation": "tanh", "units": 2, "recurrent_regularizer": null, "trainable": true, "implementation": 0, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "bias_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "dropout": 0.0, "kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "return_sequences": true}, "class_name": "LSTM"}, {"config": {"activity_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 0.0, "go_backwards": false, "stateful": false, "recurrent_constraint": null, "name": "lstm_4", "bias_constraint": null, "unroll": false, "activation": "tanh", "units": 2, "recurrent_regularizer": null, "trainable": true, "implementation": 0, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "bias_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "dropout": 0.0, "kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "return_sequences": true}, "class_name": "LSTM"}, {"config": {"activity_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 0.0, "go_backwards": false, "stateful": false, "recurrent_constraint": null, "name": "lstm_5", "bias_constraint": null, "unroll": false, "activation": "tanh", "units": 2, "recurrent_regularizer": null, "trainable": true, "implementation": 0, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "bias_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "dropout": 0.0, "kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "return_sequences": true}, "class_name": "LSTM"}, {"config": {"activity_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 0.0, "go_backwards": false, "stateful": false, "recurrent_constraint": null, "name": "lstm_6", "bias_constraint": null, "unroll": false, "activation": "tanh", "units": 2, "recurrent_regularizer": null, "trainable": true, "implementation": 0, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "bias_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "dropout": 0.0, "kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "return_sequences": true}, "class_name": "LSTM"}, {"config": {"activity_regularizer": null, "use_bias": true, "name": "dense_1", "kernel_constraint": null, "units": 1, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.2"}