{"config": [{"config": {"kernel_constraint": null, "activation": "tanh", "units": 128, "bias_regularizer": null, "use_bias": true, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "dtype": "float32", "implementation": 0, "unroll": false, "dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_sequences": true, "name": "lstm_1", "bias_constraint": null, "batch_input_shape": [null, 1, 52], "stateful": false, "activity_regularizer": null, "unit_forget_bias": true, "recurrent_regularizer": null, "trainable": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_constraint": null, "kernel_regularizer": null, "go_backwards": false}, "class_name": "LSTM"}, {"config": {"kernel_constraint": null, "activation": "tanh", "units": 32, "bias_regularizer": null, "use_bias": true, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "implementation": 0, "unroll": false, "dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_sequences": true, "name": "lstm_2", "bias_constraint": null, "stateful": false, "activity_regularizer": null, "unit_forget_bias": true, "recurrent_regularizer": null, "trainable": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_constraint": null, "kernel_regularizer": null, "go_backwards": false}, "class_name": "LSTM"}, {"config": {"kernel_constraint": null, "activation": "tanh", "units": 2, "bias_regularizer": null, "use_bias": true, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "implementation": 0, "unroll": false, "dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_sequences": true, "name": "lstm_3", "bias_constraint": null, "stateful": false, "activity_regularizer": null, "unit_forget_bias": true, "recurrent_regularizer": null, "trainable": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_constraint": null, "kernel_regularizer": null, "go_backwards": false}, "class_name": "LSTM"}, {"config": {"bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "units": 1, "bias_regularizer": null, "use_bias": true, "name": "dense_1", "trainable": true, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null}, "class_name": "Dense"}], "keras_version": "2.0.2", "class_name": "Sequential", "backend": "tensorflow"}