{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.2", "config": [{"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "name": "lstm_1", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "unit_forget_bias": true, "unroll": false, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "units": 128, "recurrent_regularizer": null, "implementation": 0, "kernel_constraint": null, "activity_regularizer": null, "dropout": 0.0, "bias_regularizer": null, "kernel_regularizer": null, "recurrent_constraint": null, "go_backwards": false, "use_bias": true, "recurrent_activation": "hard_sigmoid", "dtype": "float32", "return_sequences": true, "batch_input_shape": [null, 1, 52], "activation": "tanh"}}, {"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "name": "lstm_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "return_sequences": true, "unit_forget_bias": true, "unroll": false, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "units": 32, "recurrent_regularizer": null, "implementation": 0, "kernel_constraint": null, "activity_regularizer": null, "dropout": 0.0, "bias_regularizer": null, "kernel_regularizer": null, "recurrent_constraint": null, "go_backwards": false, "use_bias": true, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "name": "lstm_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "return_sequences": true, "unit_forget_bias": true, "unroll": false, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "units": 2, "recurrent_regularizer": null, "implementation": 0, "kernel_constraint": null, "activity_regularizer": null, "dropout": 0.0, "bias_regularizer": null, "kernel_regularizer": null, "recurrent_constraint": null, "go_backwards": false, "use_bias": true, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "activation": "tanh"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "name": "dense_1", "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "use_bias": true, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu"}}]}