{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"bias_constraint": null, "recurrent_dropout": 0.0, "go_backwards": false, "name": "lstm_1", "units": 2, "use_bias": true, "bias_regularizer": null, "trainable": true, "unroll": false, "kernel_regularizer": null, "unit_forget_bias": true, "dropout": 0.0, "dtype": "float32", "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_constraint": null, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "stateful": false, "batch_input_shape": [null, 1, 48], "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 0, "activity_regularizer": null, "recurrent_regularizer": null}}, {"class_name": "LSTM", "config": {"bias_constraint": null, "recurrent_dropout": 0.0, "go_backwards": false, "name": "lstm_2", "units": 8, "use_bias": true, "bias_regularizer": null, "trainable": true, "unroll": false, "kernel_regularizer": null, "unit_forget_bias": true, "dropout": 0.0, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_constraint": null, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "stateful": false, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 0, "activity_regularizer": null, "recurrent_regularizer": null}}, {"class_name": "LSTM", "config": {"bias_constraint": null, "recurrent_dropout": 0.0, "go_backwards": false, "name": "lstm_3", "units": 32, "use_bias": true, "bias_regularizer": null, "trainable": true, "unroll": false, "kernel_regularizer": null, "unit_forget_bias": true, "dropout": 0.0, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_constraint": null, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "stateful": false, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 0, "activity_regularizer": null, "recurrent_regularizer": null}}, {"class_name": "LSTM", "config": {"bias_constraint": null, "recurrent_dropout": 0.0, "go_backwards": false, "name": "lstm_4", "units": 32, "use_bias": true, "bias_regularizer": null, "trainable": true, "unroll": false, "kernel_regularizer": null, "unit_forget_bias": true, "dropout": 0.0, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_constraint": null, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "stateful": false, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 0, "activity_regularizer": null, "recurrent_regularizer": null}}, {"class_name": "LSTM", "config": {"bias_constraint": null, "recurrent_dropout": 0.0, "go_backwards": false, "name": "lstm_5", "units": 8, "use_bias": true, "bias_regularizer": null, "trainable": true, "unroll": false, "kernel_regularizer": null, "unit_forget_bias": true, "dropout": 0.0, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_constraint": null, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "stateful": false, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 0, "activity_regularizer": null, "recurrent_regularizer": null}}, {"class_name": "LSTM", "config": {"bias_constraint": null, "recurrent_dropout": 0.0, "go_backwards": false, "name": "lstm_6", "units": 2, "use_bias": true, "bias_regularizer": null, "trainable": true, "unroll": false, "kernel_regularizer": null, "unit_forget_bias": true, "dropout": 0.0, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_constraint": null, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "stateful": false, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 0, "activity_regularizer": null, "recurrent_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_constraint": null, "activation": "relu", "name": "dense_1", "units": 1, "use_bias": true, "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null}}], "backend": "tensorflow", "keras_version": "2.0.2"}