{"backend": "tensorflow", "keras_version": "2.0.2", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"bias_regularizer": null, "kernel_regularizer": null, "stateful": false, "use_bias": true, "recurrent_activation": "hard_sigmoid", "units": 2, "activation": "tanh", "recurrent_constraint": null, "unroll": false, "return_sequences": true, "name": "lstm_1", "implementation": 0, "go_backwards": false, "dropout": 0.0, "unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "bias_constraint": null, "trainable": true, "dtype": "float32", "recurrent_dropout": 0.0, "kernel_constraint": null, "activity_regularizer": null, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 1, 48], "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}}}, {"class_name": "LSTM", "config": {"bias_regularizer": null, "kernel_regularizer": null, "stateful": false, "use_bias": true, "recurrent_activation": "hard_sigmoid", "units": 8, "activation": "tanh", "recurrent_constraint": null, "unroll": false, "return_sequences": true, "name": "lstm_2", "implementation": 0, "go_backwards": false, "activity_regularizer": null, "unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "bias_constraint": null, "trainable": true, "recurrent_dropout": 0.0, "kernel_constraint": null, "dropout": 0.0, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}}}, {"class_name": "LSTM", "config": {"bias_regularizer": null, "kernel_regularizer": null, "stateful": false, "use_bias": true, "recurrent_activation": "hard_sigmoid", "units": 32, "activation": "tanh", "recurrent_constraint": null, "unroll": false, "return_sequences": true, "name": "lstm_3", "implementation": 0, "go_backwards": false, "activity_regularizer": null, "unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "bias_constraint": null, "trainable": true, "recurrent_dropout": 0.0, "kernel_constraint": null, "dropout": 0.0, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}}}, {"class_name": "LSTM", "config": {"bias_regularizer": null, "kernel_regularizer": null, "stateful": false, "use_bias": true, "recurrent_activation": "hard_sigmoid", "units": 32, "activation": "tanh", "recurrent_constraint": null, "unroll": false, "return_sequences": true, "name": "lstm_4", "implementation": 0, "go_backwards": false, "activity_regularizer": null, "unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "bias_constraint": null, "trainable": true, "recurrent_dropout": 0.0, "kernel_constraint": null, "dropout": 0.0, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}}}, {"class_name": "LSTM", "config": {"bias_regularizer": null, "kernel_regularizer": null, "stateful": false, "use_bias": true, "recurrent_activation": "hard_sigmoid", "units": 8, "activation": "tanh", "recurrent_constraint": null, "unroll": false, "return_sequences": true, "name": "lstm_5", "implementation": 0, "go_backwards": false, "activity_regularizer": null, "unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "bias_constraint": null, "trainable": true, "recurrent_dropout": 0.0, "kernel_constraint": null, "dropout": 0.0, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}}}, {"class_name": "LSTM", "config": {"bias_regularizer": null, "kernel_regularizer": null, "stateful": false, "use_bias": true, "recurrent_activation": "hard_sigmoid", "units": 2, "activation": "tanh", "recurrent_constraint": null, "unroll": false, "return_sequences": true, "name": "lstm_6", "implementation": 0, "go_backwards": false, "activity_regularizer": null, "unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "bias_constraint": null, "trainable": true, "recurrent_dropout": 0.0, "kernel_constraint": null, "dropout": 0.0, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "use_bias": true, "trainable": true, "units": 1, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1"}}]}