{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.2", "config": [{"class_name": "LSTM", "config": {"unit_forget_bias": true, "implementation": 0, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "dtype": "float32", "bias_constraint": null, "unroll": false, "bias_regularizer": null, "activation": "tanh", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "batch_input_shape": [null, 1, 48], "use_bias": true, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "kernel_regularizer": null, "kernel_constraint": null, "recurrent_regularizer": null, "name": "lstm_1", "units": 64, "recurrent_constraint": null, "recurrent_dropout": 0.0}}, {"class_name": "LSTM", "config": {"unit_forget_bias": true, "implementation": 0, "stateful": false, "bias_constraint": null, "unroll": false, "bias_regularizer": null, "activation": "tanh", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "units": 8, "use_bias": true, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "kernel_regularizer": null, "kernel_constraint": null, "recurrent_regularizer": null, "name": "lstm_2", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_constraint": null, "recurrent_dropout": 0.0}}, {"class_name": "LSTM", "config": {"unit_forget_bias": true, "implementation": 0, "stateful": false, "bias_constraint": null, "unroll": false, "bias_regularizer": null, "activation": "tanh", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "units": 2, "use_bias": true, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "kernel_regularizer": null, "kernel_constraint": null, "recurrent_regularizer": null, "name": "lstm_3", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_constraint": null, "recurrent_dropout": 0.0}}, {"class_name": "Dense", "config": {"bias_constraint": null, "units": 1, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "activation": "relu", "kernel_regularizer": null, "trainable": true, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true}}]}