{"config": [{"config": {"units": 128, "dropout": 0.0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_initializer": {"config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "unit_forget_bias": true, "dtype": "float32", "recurrent_constraint": null, "stateful": false, "unroll": false, "return_sequences": true, "implementation": 0, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "recurrent_dropout": 0.0, "trainable": true, "kernel_regularizer": null, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "go_backwards": false, "name": "lstm_1", "use_bias": true, "bias_regularizer": null, "batch_input_shape": [null, 1, 52]}, "class_name": "LSTM"}, {"config": {"units": 32, "dropout": 0.0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_initializer": {"config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "unit_forget_bias": true, "recurrent_constraint": null, "stateful": false, "unroll": false, "return_sequences": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "recurrent_dropout": 0.0, "trainable": true, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "go_backwards": false, "implementation": 0, "use_bias": true, "bias_regularizer": null, "name": "lstm_2"}, "class_name": "LSTM"}, {"config": {"units": 2, "dropout": 0.0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_initializer": {"config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "unit_forget_bias": true, "recurrent_constraint": null, "stateful": false, "unroll": false, "return_sequences": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "recurrent_dropout": 0.0, "trainable": true, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "go_backwards": false, "implementation": 0, "use_bias": true, "bias_regularizer": null, "name": "lstm_3"}, "class_name": "LSTM"}, {"config": {"kernel_regularizer": null, "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "activation": "relu", "name": "dense_1", "use_bias": true, "bias_regularizer": null}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.0.2", "class_name": "Sequential"}