{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"name": "lstm_1", "dropout": 0.0, "dtype": "float32", "unroll": false, "trainable": true, "implementation": 0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "batch_input_shape": [null, 1, 48], "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "activation": "tanh", "go_backwards": false, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "recurrent_constraint": null, "unit_forget_bias": true, "return_sequences": true, "activity_regularizer": null, "recurrent_dropout": 0.0, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "units": 8}}, {"class_name": "LSTM", "config": {"name": "lstm_2", "dropout": 0.0, "recurrent_regularizer": null, "unroll": false, "trainable": true, "implementation": 0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "activation": "tanh", "go_backwards": false, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "recurrent_constraint": null, "unit_forget_bias": true, "return_sequences": true, "activity_regularizer": null, "recurrent_dropout": 0.0, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "units": 8}}, {"class_name": "LSTM", "config": {"name": "lstm_3", "dropout": 0.0, "recurrent_regularizer": null, "unroll": false, "trainable": true, "implementation": 0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "activation": "tanh", "go_backwards": false, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "recurrent_constraint": null, "unit_forget_bias": true, "return_sequences": true, "activity_regularizer": null, "recurrent_dropout": 0.0, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "units": 8}}, {"class_name": "LSTM", "config": {"name": "lstm_4", "dropout": 0.0, "recurrent_regularizer": null, "unroll": false, "trainable": true, "implementation": 0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "activation": "tanh", "go_backwards": false, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "recurrent_constraint": null, "unit_forget_bias": true, "return_sequences": true, "activity_regularizer": null, "recurrent_dropout": 0.0, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "units": 8}}, {"class_name": "LSTM", "config": {"name": "lstm_5", "dropout": 0.0, "recurrent_regularizer": null, "unroll": false, "trainable": true, "implementation": 0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "activation": "tanh", "go_backwards": false, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "recurrent_constraint": null, "unit_forget_bias": true, "return_sequences": true, "activity_regularizer": null, "recurrent_dropout": 0.0, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "units": 8}}, {"class_name": "LSTM", "config": {"name": "lstm_6", "dropout": 0.0, "recurrent_regularizer": null, "unroll": false, "trainable": true, "implementation": 0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "activation": "tanh", "go_backwards": false, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "recurrent_constraint": null, "unit_forget_bias": true, "return_sequences": true, "activity_regularizer": null, "recurrent_dropout": 0.0, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "units": 8}}, {"class_name": "Dense", "config": {"activation": "relu", "use_bias": true, "name": "dense_1", "bias_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "units": 1, "kernel_regularizer": null}}], "keras_version": "2.0.2"}