{"config": [{"config": {"implementation": 0, "name": "lstm_1", "dtype": "float32", "kernel_regularizer": null, "recurrent_dropout": 0.0, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "stateful": false, "batch_input_shape": [null, 1, 52], "return_sequences": true, "go_backwards": false, "activation": "tanh", "use_bias": true, "recurrent_constraint": null, "unit_forget_bias": true, "units": 128, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "unroll": false, "dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "LSTM"}, {"config": {"implementation": 0, "name": "lstm_2", "kernel_regularizer": null, "recurrent_dropout": 0.0, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "stateful": false, "return_sequences": true, "go_backwards": false, "activation": "tanh", "use_bias": true, "recurrent_constraint": null, "unit_forget_bias": true, "units": 64, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "unroll": false, "dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "LSTM"}, {"config": {"implementation": 0, "name": "lstm_3", "kernel_regularizer": null, "recurrent_dropout": 0.0, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "stateful": false, "return_sequences": true, "go_backwards": false, "activation": "tanh", "use_bias": true, "recurrent_constraint": null, "unit_forget_bias": true, "units": 2, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "unroll": false, "dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "LSTM"}, {"config": {"activation": "relu", "name": "dense_1", "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "bias_constraint": null, "units": 1, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.0.2", "class_name": "Sequential"}