{"backend": "tensorflow", "config": [{"config": {"recurrent_regularizer": null, "go_backwards": false, "recurrent_dropout": 0.0, "unroll": false, "bias_constraint": null, "kernel_regularizer": null, "dropout": 0.0, "recurrent_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "bias_regularizer": null, "trainable": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_constraint": null, "name": "lstm_1", "activation": "tanh", "batch_input_shape": [null, 1, 48], "implementation": 0, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "stateful": false, "unit_forget_bias": true, "return_sequences": true, "units": 8, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "LSTM"}, {"config": {"recurrent_regularizer": null, "go_backwards": false, "recurrent_dropout": 0.0, "unroll": false, "bias_constraint": null, "kernel_regularizer": null, "dropout": 0.0, "recurrent_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "trainable": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_constraint": null, "name": "lstm_2", "activation": "tanh", "implementation": 0, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "stateful": false, "unit_forget_bias": true, "return_sequences": true, "units": 8, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "LSTM"}, {"config": {"recurrent_regularizer": null, "go_backwards": false, "recurrent_dropout": 0.0, "unroll": false, "bias_constraint": null, "kernel_regularizer": null, "dropout": 0.0, "recurrent_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "trainable": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_constraint": null, "name": "lstm_3", "activation": "tanh", "implementation": 0, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "stateful": false, "unit_forget_bias": true, "return_sequences": true, "units": 8, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "LSTM"}, {"config": {"recurrent_regularizer": null, "go_backwards": false, "recurrent_dropout": 0.0, "unroll": false, "bias_constraint": null, "kernel_regularizer": null, "dropout": 0.0, "recurrent_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "trainable": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_constraint": null, "name": "lstm_4", "activation": "tanh", "implementation": 0, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "stateful": false, "unit_forget_bias": true, "return_sequences": true, "units": 8, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "LSTM"}, {"config": {"recurrent_regularizer": null, "go_backwards": false, "recurrent_dropout": 0.0, "unroll": false, "bias_constraint": null, "kernel_regularizer": null, "dropout": 0.0, "recurrent_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "trainable": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_constraint": null, "name": "lstm_5", "activation": "tanh", "implementation": 0, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "stateful": false, "unit_forget_bias": true, "return_sequences": true, "units": 8, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "LSTM"}, {"config": {"recurrent_regularizer": null, "go_backwards": false, "recurrent_dropout": 0.0, "unroll": false, "bias_constraint": null, "kernel_regularizer": null, "dropout": 0.0, "recurrent_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "trainable": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_constraint": null, "name": "lstm_6", "activation": "tanh", "implementation": 0, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "stateful": false, "unit_forget_bias": true, "return_sequences": true, "units": 8, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "LSTM"}, {"config": {"trainable": true, "name": "dense_1", "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "units": 1}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.2"}