{"keras_version": "2.0.2", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"recurrent_constraint": null, "unroll": false, "units": 8, "activity_regularizer": null, "go_backwards": false, "recurrent_regularizer": null, "unit_forget_bias": true, "recurrent_dropout": 0.0, "name": "lstm_1", "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}}, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "stateful": false, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "implementation": 0, "batch_input_shape": [null, 1, 48], "bias_constraint": null, "kernel_constraint": null, "dtype": "float32", "dropout": 0.0}}, {"class_name": "LSTM", "config": {"recurrent_constraint": null, "unroll": false, "units": 8, "go_backwards": false, "recurrent_regularizer": null, "unit_forget_bias": true, "stateful": false, "recurrent_dropout": 0.0, "name": "lstm_2", "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}}, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_activation": "hard_sigmoid", "implementation": 0, "activation": "tanh", "kernel_constraint": null, "dropout": 0.0}}, {"class_name": "LSTM", "config": {"recurrent_constraint": null, "unroll": false, "units": 8, "go_backwards": false, "recurrent_regularizer": null, "unit_forget_bias": true, "stateful": false, "recurrent_dropout": 0.0, "name": "lstm_3", "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}}, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_activation": "hard_sigmoid", "implementation": 0, "activation": "tanh", "kernel_constraint": null, "dropout": 0.0}}, {"class_name": "LSTM", "config": {"recurrent_constraint": null, "unroll": false, "units": 8, "go_backwards": false, "recurrent_regularizer": null, "unit_forget_bias": true, "stateful": false, "recurrent_dropout": 0.0, "name": "lstm_4", "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}}, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_activation": "hard_sigmoid", "implementation": 0, "activation": "tanh", "kernel_constraint": null, "dropout": 0.0}}, {"class_name": "LSTM", "config": {"recurrent_constraint": null, "unroll": false, "units": 8, "go_backwards": false, "recurrent_regularizer": null, "unit_forget_bias": true, "stateful": false, "recurrent_dropout": 0.0, "name": "lstm_5", "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}}, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_activation": "hard_sigmoid", "implementation": 0, "activation": "tanh", "kernel_constraint": null, "dropout": 0.0}}, {"class_name": "LSTM", "config": {"recurrent_constraint": null, "unroll": false, "units": 8, "go_backwards": false, "recurrent_regularizer": null, "unit_forget_bias": true, "stateful": false, "recurrent_dropout": 0.0, "name": "lstm_6", "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}}, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_activation": "hard_sigmoid", "implementation": 0, "activation": "tanh", "kernel_constraint": null, "dropout": 0.0}}, {"class_name": "LSTM", "config": {"recurrent_constraint": null, "unroll": false, "units": 2, "go_backwards": false, "recurrent_regularizer": null, "unit_forget_bias": true, "stateful": false, "recurrent_dropout": 0.0, "name": "lstm_7", "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}}, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_activation": "hard_sigmoid", "implementation": 0, "activation": "tanh", "kernel_constraint": null, "dropout": 0.0}}, {"class_name": "Dense", "config": {"name": "dense_1", "units": 1, "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}]}