{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.2", "config": [{"class_name": "LSTM", "config": {"implementation": 0, "stateful": false, "activity_regularizer": null, "batch_input_shape": [null, 1, 52], "use_bias": true, "recurrent_activation": "hard_sigmoid", "name": "lstm_1", "dtype": "float32", "unit_forget_bias": true, "recurrent_constraint": null, "bias_constraint": null, "unroll": false, "recurrent_dropout": 0.0, "kernel_constraint": null, "recurrent_regularizer": null, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}}, "kernel_regularizer": null, "return_sequences": true, "activation": "tanh", "units": 2, "trainable": true}}, {"class_name": "LSTM", "config": {"implementation": 0, "stateful": false, "activity_regularizer": null, "use_bias": true, "recurrent_activation": "hard_sigmoid", "name": "lstm_2", "trainable": true, "unit_forget_bias": true, "recurrent_constraint": null, "bias_constraint": null, "unroll": false, "recurrent_dropout": 0.0, "kernel_constraint": null, "recurrent_regularizer": null, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}}, "kernel_regularizer": null, "return_sequences": true, "activation": "tanh", "units": 8}}, {"class_name": "LSTM", "config": {"implementation": 0, "stateful": false, "activity_regularizer": null, "use_bias": true, "recurrent_activation": "hard_sigmoid", "name": "lstm_3", "trainable": true, "unit_forget_bias": true, "recurrent_constraint": null, "bias_constraint": null, "unroll": false, "recurrent_dropout": 0.0, "kernel_constraint": null, "recurrent_regularizer": null, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}}, "kernel_regularizer": null, "return_sequences": true, "activation": "tanh", "units": 16}}, {"class_name": "LSTM", "config": {"implementation": 0, "stateful": false, "activity_regularizer": null, "use_bias": true, "recurrent_activation": "hard_sigmoid", "name": "lstm_4", "trainable": true, "unit_forget_bias": true, "recurrent_constraint": null, "bias_constraint": null, "unroll": false, "recurrent_dropout": 0.0, "kernel_constraint": null, "recurrent_regularizer": null, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}}, "kernel_regularizer": null, "return_sequences": true, "activation": "tanh", "units": 128}}, {"class_name": "LSTM", "config": {"implementation": 0, "stateful": false, "activity_regularizer": null, "use_bias": true, "recurrent_activation": "hard_sigmoid", "name": "lstm_5", "trainable": true, "unit_forget_bias": true, "recurrent_constraint": null, "bias_constraint": null, "unroll": false, "recurrent_dropout": 0.0, "kernel_constraint": null, "recurrent_regularizer": null, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}}, "kernel_regularizer": null, "return_sequences": true, "activation": "tanh", "units": 16}}, {"class_name": "LSTM", "config": {"implementation": 0, "stateful": false, "activity_regularizer": null, "use_bias": true, "recurrent_activation": "hard_sigmoid", "name": "lstm_6", "trainable": true, "unit_forget_bias": true, "recurrent_constraint": null, "bias_constraint": null, "unroll": false, "recurrent_dropout": 0.0, "kernel_constraint": null, "recurrent_regularizer": null, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}}, "kernel_regularizer": null, "return_sequences": true, "activation": "tanh", "units": 8}}, {"class_name": "LSTM", "config": {"implementation": 0, "stateful": false, "activity_regularizer": null, "use_bias": true, "recurrent_activation": "hard_sigmoid", "name": "lstm_7", "trainable": true, "unit_forget_bias": true, "recurrent_constraint": null, "bias_constraint": null, "unroll": false, "recurrent_dropout": 0.0, "kernel_constraint": null, "recurrent_regularizer": null, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}}, "kernel_regularizer": null, "return_sequences": true, "activation": "tanh", "units": 2}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}}, "kernel_regularizer": null, "activation": "relu", "trainable": true, "name": "dense_1", "units": 1, "kernel_constraint": null}}]}