{"class_name": "Sequential", "keras_version": "2.0.2", "config": [{"class_name": "LSTM", "config": {"activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_1", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "units": 2, "bias_constraint": null, "unroll": false, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}}, "use_bias": true, "dropout": 0.0, "implementation": 0, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "recurrent_constraint": null, "trainable": true, "recurrent_regularizer": null, "stateful": false, "recurrent_dropout": 0.0, "go_backwards": false, "kernel_constraint": null, "unit_forget_bias": true, "activity_regularizer": null, "dtype": "float32", "bias_regularizer": null, "batch_input_shape": [null, 1, 48]}}, {"class_name": "LSTM", "config": {"activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_2", "implementation": 0, "units": 8, "bias_constraint": null, "unroll": false, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}}, "use_bias": true, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "recurrent_constraint": null, "trainable": true, "recurrent_regularizer": null, "stateful": false, "recurrent_dropout": 0.0, "go_backwards": false, "kernel_constraint": null, "unit_forget_bias": true, "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "LSTM", "config": {"activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_3", "implementation": 0, "units": 32, "bias_constraint": null, "unroll": false, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}}, "use_bias": true, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "recurrent_constraint": null, "trainable": true, "recurrent_regularizer": null, "stateful": false, "recurrent_dropout": 0.0, "go_backwards": false, "kernel_constraint": null, "unit_forget_bias": true, "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "LSTM", "config": {"activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_4", "implementation": 0, "units": 32, "bias_constraint": null, "unroll": false, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}}, "use_bias": true, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "recurrent_constraint": null, "trainable": true, "recurrent_regularizer": null, "stateful": false, "recurrent_dropout": 0.0, "go_backwards": false, "kernel_constraint": null, "unit_forget_bias": true, "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "LSTM", "config": {"activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_5", "implementation": 0, "units": 8, "bias_constraint": null, "unroll": false, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}}, "use_bias": true, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "recurrent_constraint": null, "trainable": true, "recurrent_regularizer": null, "stateful": false, "recurrent_dropout": 0.0, "go_backwards": false, "kernel_constraint": null, "unit_forget_bias": true, "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "LSTM", "config": {"activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_6", "implementation": 0, "units": 2, "bias_constraint": null, "unroll": false, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}}, "use_bias": true, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "recurrent_constraint": null, "trainable": true, "recurrent_regularizer": null, "stateful": false, "recurrent_dropout": 0.0, "go_backwards": false, "kernel_constraint": null, "unit_forget_bias": true, "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "units": 1, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}}, "use_bias": true, "bias_regularizer": null, "trainable": true}}], "backend": "tensorflow"}