{"backend": "tensorflow", "keras_version": "2.0.2", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"go_backwards": false, "batch_input_shape": [null, 1, 52], "activation": "tanh", "dropout": 0.0, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_dropout": 0.0, "bias_regularizer": null, "unroll": false, "recurrent_regularizer": null, "name": "lstm_1", "recurrent_constraint": null, "bias_constraint": null, "units": 128, "kernel_regularizer": null, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "implementation": 0, "unit_forget_bias": true, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "trainable": true, "kernel_constraint": null, "stateful": false, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "units": 1, "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "trainable": true, "name": "dense_1", "kernel_constraint": null, "activity_regularizer": null}}]}