{"config": [{"config": {"units": 128, "bias_regularizer": null, "kernel_constraint": null, "return_sequences": true, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "batch_input_shape": [null, 1, 52], "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "activation": "tanh", "dropout": 0.0, "kernel_regularizer": null, "stateful": false, "name": "lstm_1", "recurrent_constraint": null, "implementation": 0, "unit_forget_bias": true, "unroll": false, "use_bias": true, "trainable": true, "recurrent_dropout": 0.0, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "go_backwards": false}, "class_name": "LSTM"}, {"config": {"units": 64, "kernel_constraint": null, "return_sequences": true, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "activation": "tanh", "dropout": 0.0, "kernel_regularizer": null, "stateful": false, "trainable": true, "name": "lstm_2", "recurrent_constraint": null, "bias_regularizer": null, "unit_forget_bias": true, "unroll": false, "use_bias": true, "implementation": 0, "recurrent_dropout": 0.0, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false}, "class_name": "LSTM"}, {"config": {"units": 2, "kernel_constraint": null, "return_sequences": true, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "activation": "tanh", "dropout": 0.0, "kernel_regularizer": null, "stateful": false, "trainable": true, "name": "lstm_3", "recurrent_constraint": null, "bias_regularizer": null, "unit_forget_bias": true, "unroll": false, "use_bias": true, "implementation": 0, "recurrent_dropout": 0.0, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false}, "class_name": "LSTM"}, {"config": {"units": 1, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_1", "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu"}, "class_name": "Dense"}], "keras_version": "2.0.2", "class_name": "Sequential", "backend": "tensorflow"}