{"config": [{"config": {"name": "lstm_1", "dropout": 0.0, "kernel_constraint": null, "trainable": true, "return_sequences": true, "activity_regularizer": null, "units": 8, "batch_input_shape": [null, 1, 48], "bias_regularizer": null, "bias_constraint": null, "unit_forget_bias": true, "recurrent_dropout": 0.0, "use_bias": true, "dtype": "float32", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "stateful": false, "activation": "tanh", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "kernel_initializer": {"config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "implementation": 0, "unroll": false}, "class_name": "LSTM"}, {"config": {"name": "lstm_2", "dropout": 0.0, "kernel_constraint": null, "trainable": true, "return_sequences": true, "activity_regularizer": null, "units": 128, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "recurrent_dropout": 0.0, "use_bias": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "recurrent_constraint": null, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "stateful": false, "implementation": 0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "unit_forget_bias": true, "unroll": false}, "class_name": "LSTM"}, {"config": {"name": "lstm_3", "dropout": 0.0, "kernel_constraint": null, "trainable": true, "return_sequences": true, "activity_regularizer": null, "units": 8, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "recurrent_dropout": 0.0, "use_bias": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "recurrent_constraint": null, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "stateful": false, "implementation": 0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "unit_forget_bias": true, "unroll": false}, "class_name": "LSTM"}, {"config": {"name": "dense_1", "kernel_constraint": null, "trainable": true, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "units": 1, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_regularizer": null}, "class_name": "Dense"}], "keras_version": "2.0.2", "backend": "tensorflow", "class_name": "Sequential"}