{"config": [{"config": {"implementation": 0, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 1, 48], "kernel_constraint": null, "trainable": true, "dropout": 0.0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "activation": "tanh", "unit_forget_bias": true, "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.0, "unroll": false, "kernel_regularizer": null, "return_sequences": true, "go_backwards": false, "units": 64, "dtype": "float32", "stateful": false, "name": "lstm_1", "recurrent_constraint": null, "bias_regularizer": null, "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"implementation": 0, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "trainable": true, "dropout": 0.0, "activation": "tanh", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "unit_forget_bias": true, "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.0, "unroll": false, "kernel_regularizer": null, "return_sequences": true, "go_backwards": false, "units": 8, "stateful": false, "name": "lstm_2", "recurrent_constraint": null, "bias_regularizer": null, "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"implementation": 0, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "trainable": true, "dropout": 0.0, "activation": "tanh", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "unit_forget_bias": true, "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.0, "unroll": false, "kernel_regularizer": null, "return_sequences": true, "go_backwards": false, "units": 2, "stateful": false, "name": "lstm_3", "recurrent_constraint": null, "bias_regularizer": null, "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "units": 1, "name": "dense_1", "activation": "relu", "activity_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.2"}